[Killed] BlockStatement
src/engine/engine.ts:63:70
  * Deterministic given the same config and `rng` seed (docs/08 golden rule 5).
  */
 export function runEngine(config: EngineConfig): EngineResult {
-  if (!Number.isSafeInteger(config.duration) || config.duration < 0) {
-    throw new RangeError("runEngine: duration must be a non-negative safe integer");
-  }
+  if (!Number.isSafeInteger(config.duration) || config.duration < 0) {}
   const queue = createEventQueue<string>();
   // actor and its forked Rng are always registered together, so one map
killedBy: runEngine throws when duration is negative
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/engine/engine.ts:63:7
  * Deterministic given the same config and `rng` seed (docs/08 golden rule 5).
  */
 export function runEngine(config: EngineConfig): EngineResult {
-  if (!Number.isSafeInteger(config.duration) || config.duration < 0) {
+  if (Number.isSafeInteger(config.duration) || config.duration < 0) {
     throw new RangeError("runEngine: duration must be a non-negative safe integer");
   }
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: runEngine: duration must be a non-negative safe integer

[Killed] BlockStatement
src/engine/engine.ts:70:58
   // actor and its forked Rng are always registered together, so one map
   // (rather than two kept in sync) makes that invariant structural.
   const actorEntries = new Map<string, { actor: Actor; rng: Rng }>();
-  for (const { actor, slots } of config.scheduledActors) {
-    actorEntries.set(actor.id, { actor, rng: config.rng.fork(actor.id) });
-    for (const slot of slots) {
-      queue.schedule(slot, actor.id);
-    }
-  }
+  for (const { actor, slots } of config.scheduledActors) {}
 
   const wallets = new Map(config.initialWallets);
killedBy: determinism (docs/07) changing only the seed changes the result (proves the Rng is wired in)
statusReason: expected [] to not deeply equal []

[Killed] BlockStatement
src/engine/engine.ts:72:31
   const actorEntries = new Map<string, { actor: Actor; rng: Rng }>();
   for (const { actor, slots } of config.scheduledActors) {
     actorEntries.set(actor.id, { actor, rng: config.rng.fork(actor.id) });
-    for (const slot of slots) {
-      queue.schedule(slot, actor.id);
-    }
+    for (const slot of slots) {}
   }
 
killedBy: determinism (docs/07) changing only the seed changes the result (proves the Rng is wired in)
statusReason: expected [] to not deeply equal []

[Killed] CallExpression
src/engine/engine.ts:73:7
   for (const { actor, slots } of config.scheduledActors) {
     actorEntries.set(actor.id, { actor, rng: config.rng.fork(actor.id) });
     for (const slot of slots) {
-      queue.schedule(slot, actor.id);
+      ;
     }
   }
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrayDeclaration
src/engine/engine.ts:79:43
 
   const wallets = new Map(config.initialWallets);
   const trades: TradeRecord[] = [];
-  const mechanicEvents: MechanicEvent[] = [];
+  const mechanicEvents: MechanicEvent[] = ["Stryker was here"];
   const samples: TimelineSample[] = [];
   let peakQuoteReserve = config.market.state().quoteReserve;
killedBy: runEngine runs due mechanics after orders execute each slot
statusReason: expected [ 'Stryker was here', …(1) ] to deeply equal [ { slot: +0, …(3) } ]

[Killed] BlockStatement
src/engine/engine.ts:84:39
   let peakQuoteReserve = config.market.state().quoteReserve;
   let nextSampleSlot = 0;
 
-  function sample(slot: number): void {
-    const state = config.market.state();
-    peakQuoteReserve = maxBig(peakQuoteReserve, state.quoteReserve);
-    samples.push({ slot, quoteReserve: state.quoteReserve, baseReserve: state.baseReserve });
-  }
+  function sample(slot: number): void {}
 
   queue.schedule(0, TICK);
killedBy: runEngine samples the timeline at the configured interval and tracks the peak quote reserve
statusReason: expected [] to deeply equal [ +0, 5, 10 ]

[Killed] CallExpression
src/engine/engine.ts:90:3
     samples.push({ slot, quoteReserve: state.quoteReserve, baseReserve: state.baseReserve });
   }
 
-  queue.schedule(0, TICK);
+  ;
 
   while (!queue.isEmpty()) {
killedBy: runEngine runs due mechanics after orders execute each slot
statusReason: expected [] to deeply equal [ { slot: +0, …(3) } ]

[Killed] ConditionalExpression
src/engine/engine.ts:92:10
 
   queue.schedule(0, TICK);
 
-  while (!queue.isEmpty()) {
+  while (false) {
     const nextSlot = queue.peekSlot();
     /* v8 ignore next 3 -- coverage-ignore: unreachable, the while-guard already proved !queue.isEmpty(); TS narrowing only */
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/engine/engine.ts:92:10
 
   queue.schedule(0, TICK);
 
-  while (!queue.isEmpty()) {
+  while (queue.isEmpty()) {
     const nextSlot = queue.peekSlot();
     /* v8 ignore next 3 -- coverage-ignore: unreachable, the while-guard already proved !queue.isEmpty(); TS narrowing only */
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/engine/engine.ts:95:9
   while (!queue.isEmpty()) {
     const nextSlot = queue.peekSlot();
     /* v8 ignore next 3 -- coverage-ignore: unreachable, the while-guard already proved !queue.isEmpty(); TS narrowing only */
-    if (nextSlot === null) {
+    if (nextSlot !== null) {
       break;
     }
killedBy: determinism (docs/07) changing only the seed changes the result (proves the Rng is wired in)
statusReason: expected [] to not deeply equal []

[Killed] ConditionalExpression
src/engine/engine.ts:95:9
   while (!queue.isEmpty()) {
     const nextSlot = queue.peekSlot();
     /* v8 ignore next 3 -- coverage-ignore: unreachable, the while-guard already proved !queue.isEmpty(); TS narrowing only */
-    if (nextSlot === null) {
+    if (true) {
       break;
     }
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/engine/engine.ts:98:9
     if (nextSlot === null) {
       break;
     }
-    if (nextSlot > config.duration) {
+    if (nextSlot >= config.duration) {
       break;
     }
killedBy: runEngine samples the timeline at the configured interval and tracks the peak quote reserve
statusReason: expected [ +0, 5 ] to deeply equal [ +0, 5, 10 ]

[Killed] ConditionalExpression
src/engine/engine.ts:98:9
     if (nextSlot === null) {
       break;
     }
-    if (nextSlot > config.duration) {
+    if (false) {
       break;
     }
killedBy: runEngine ignores an actor scheduled beyond the scenario's duration
statusReason: expected [ Array(1) ] to deeply equal []

[Survived] CallExpression
src/engine/engine.ts:101:5
     if (nextSlot > config.duration) {
       break;
     }
-    config.clock.advanceTo(nextSlot);
+    ;
     const due = queue.popAllAtNextSlot();
     if (nextSlot < config.duration) {

[Killed] EqualityOperator
src/engine/engine.ts:103:9
     }
     config.clock.advanceTo(nextSlot);
     const due = queue.popAllAtNextSlot();
-    if (nextSlot < config.duration) {
+    if (nextSlot >= config.duration) {
       // Schedule the next tick lazily (one at a time), not the whole
       // duration upfront -- keeps the queue small across a long run.
killedBy: runEngine samples the timeline at the configured interval and tracks the peak quote reserve
statusReason: expected [ +0 ] to deeply equal [ +0, 5, 10 ]

[Killed] BlockStatement
src/engine/engine.ts:103:37
     }
     config.clock.advanceTo(nextSlot);
     const due = queue.popAllAtNextSlot();
-    if (nextSlot < config.duration) {
-      // Schedule the next tick lazily (one at a time), not the whole
-      // duration upfront -- keeps the queue small across a long run.
-      queue.schedule(nextSlot + 1, TICK);
-    }
+    if (nextSlot < config.duration) {}
 
     const orders: Order[] = [];
killedBy: runEngine samples the timeline at the configured interval and tracks the peak quote reserve
statusReason: expected [ +0 ] to deeply equal [ +0, 5, 10 ]

[Killed] ArithmeticOperator
src/engine/engine.ts:106:22
     if (nextSlot < config.duration) {
       // Schedule the next tick lazily (one at a time), not the whole
       // duration upfront -- keeps the queue small across a long run.
-      queue.schedule(nextSlot + 1, TICK);
+      queue.schedule(nextSlot - 1, TICK);
     }
 
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: EventQueue.schedule: slot must be non-negative

[Killed] BlockStatement
src/engine/engine.ts:110:30
     }
 
     const orders: Order[] = [];
-    for (const event of due) {
-      const actorId = event.payload;
-      const entry = actorEntries.get(actorId);
-      if (!entry) {
-        continue;
-      }
-      const { actor, rng } = entry;
-      const wallet = wallets.get(actorId) ?? createWallet(0n);
-      const state = config.market.state();
-      orders.push(
-        ...actor.decide({
-          slot: nextSlot,
-          market: { state, price: price(state.quoteReserve, state.baseReserve), peakQuoteReserve },
-          wallet,
-          rng,
-        }),
-      );
-    }
+    for (const event of due) {}
 
     orders.sort(comparePriorityFeeDescending);
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/engine/engine.ts:113:19
     for (const event of due) {
       const actorId = event.payload;
       const entry = actorEntries.get(actorId);
-      if (!entry) {
-        continue;
-      }
+      if (!entry) {}
       const { actor, rng } = entry;
       const wallet = wallets.get(actorId) ?? createWallet(0n);
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Cannot destructure property 'actor' of 'entry' as it is undefined.

[Killed] ConditionalExpression
src/engine/engine.ts:113:11
     for (const event of due) {
       const actorId = event.payload;
       const entry = actorEntries.get(actorId);
-      if (!entry) {
+      if (false) {
         continue;
       }
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: Cannot destructure property 'actor' of 'entry' as it is undefined.

[Killed] LogicalOperator
src/engine/engine.ts:117:22
         continue;
       }
       const { actor, rng } = entry;
-      const wallet = wallets.get(actorId) ?? createWallet(0n);
+      const wallet = wallets.get(actorId) && createWallet(0n);
       const state = config.market.state();
       orders.push(
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected 10000n to be 0n // Object.is equality

[Killed] MethodExpression
src/engine/engine.ts:129:5
       );
     }
 
-    orders.sort(comparePriorityFeeDescending);
+    orders;
 
     for (const order of orders) {
killedBy: runEngine orders within a slot by priority fee, higher first
statusReason: expected [ 'low', 'high' ] to deeply equal [ 'high', 'low' ]

[Killed] LogicalOperator
src/engine/engine.ts:132:22
     orders.sort(comparePriorityFeeDescending);
 
     for (const order of orders) {
-      const wallet = wallets.get(order.actorId) ?? createWallet(0n);
+      const wallet = wallets.get(order.actorId) && createWallet(0n);
       let quoteAmount = 0n;
       let baseAmount = 0n;
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected { slot: +0, actorId: 'buyer-1', …(6) } to match object { slot: +0, actorId: 'buyer-1', …(2) }
(4 matching properties omitted from actual)

[Killed] BooleanLiteral
src/engine/engine.ts:135:16
       const wallet = wallets.get(order.actorId) ?? createWallet(0n);
       let quoteAmount = 0n;
       let baseAmount = 0n;
-      let ok = false;
+      let ok = true;
       let reason: string | null = null;
 
killedBy: runEngine fails a trade gracefully when the actor lacks the balance, without touching the market
statusReason: expected { slot: +0, …(7) } to match object { ok: false, …(1) }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/engine/engine.ts:138:46
       let ok = false;
       let reason: string | null = null;
 
-      if (order.side === "buy" && order.buy) {
-        if (order.buy.quoteIn > wallet.quoteBalance) {
-          reason = "insufficient balance";
-        } else {
-          const outcome = config.market.buy(order.buy);
-          ok = outcome.ok;
-          if (outcome.ok) {
-            quoteAmount = order.buy.quoteIn;
-            baseAmount = outcome.amountOut;
-          } else {
-            reason = outcome.reason;
-          }
-        }
-      } else if (order.side === "sell" && order.sell) {
+      if (order.side === "buy" && order.buy) {} else if (order.side === "sell" && order.sell) {
         if (order.sell.baseIn > wallet.baseBalance) {
           reason = "insufficient balance";
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected { slot: +0, actorId: 'buyer-1', …(6) } to match object { slot: +0, actorId: 'buyer-1', …(2) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/engine/engine.ts:138:11
       let ok = false;
       let reason: string | null = null;
 
-      if (order.side === "buy" && order.buy) {
+      if (true) {
         if (order.buy.quoteIn > wallet.quoteBalance) {
           reason = "insufficient balance";
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Cannot read properties of undefined (reading 'quoteIn')

[Killed] EqualityOperator
src/engine/engine.ts:139:13
       let reason: string | null = null;
 
       if (order.side === "buy" && order.buy) {
-        if (order.buy.quoteIn > wallet.quoteBalance) {
+        if (order.buy.quoteIn >= wallet.quoteBalance) {
           reason = "insufficient balance";
         } else {
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected { slot: +0, actorId: 'buyer-1', …(6) } to match object { slot: +0, actorId: 'buyer-1', …(2) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/engine/engine.ts:139:13
       let reason: string | null = null;
 
       if (order.side === "buy" && order.buy) {
-        if (order.buy.quoteIn > wallet.quoteBalance) {
+        if (true) {
           reason = "insufficient balance";
         } else {
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected { slot: +0, actorId: 'buyer-1', …(6) } to match object { slot: +0, actorId: 'buyer-1', …(2) }
(4 matching properties omitted from actual)

[Killed] StringLiteral
src/engine/engine.ts:140:20
 
       if (order.side === "buy" && order.buy) {
         if (order.buy.quoteIn > wallet.quoteBalance) {
-          reason = "insufficient balance";
+          reason = "";
         } else {
           const outcome = config.market.buy(order.buy);
killedBy: runEngine fails a trade gracefully when the actor lacks the balance, without touching the market
statusReason: expected { slot: +0, …(7) } to match object { ok: false, …(1) }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/engine/engine.ts:141:16
       if (order.side === "buy" && order.buy) {
         if (order.buy.quoteIn > wallet.quoteBalance) {
           reason = "insufficient balance";
-        } else {
-          const outcome = config.market.buy(order.buy);
-          ok = outcome.ok;
-          if (outcome.ok) {
-            quoteAmount = order.buy.quoteIn;
-            baseAmount = outcome.amountOut;
-          } else {
-            reason = outcome.reason;
-          }
-        }
+        } else {}
       } else if (order.side === "sell" && order.sell) {
         if (order.sell.baseIn > wallet.baseBalance) {
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected { slot: +0, actorId: 'buyer-1', …(6) } to match object { slot: +0, actorId: 'buyer-1', …(2) }
(4 matching properties omitted from actual)

[Killed] BlockStatement
src/engine/engine.ts:144:27
         } else {
           const outcome = config.market.buy(order.buy);
           ok = outcome.ok;
-          if (outcome.ok) {
-            quoteAmount = order.buy.quoteIn;
-            baseAmount = outcome.amountOut;
-          } else {
+          if (outcome.ok) {} else {
             reason = outcome.reason;
           }
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected 10000n to be 0n // Object.is equality

[Killed] ConditionalExpression
src/engine/engine.ts:144:15
         } else {
           const outcome = config.market.buy(order.buy);
           ok = outcome.ok;
-          if (outcome.ok) {
+          if (true) {
             quoteAmount = order.buy.quoteIn;
             baseAmount = outcome.amountOut;
killedBy: runEngine records a rejected buy outcome from the market (e.g. slippage)
statusReason: expected { slot: +0, actorId: 'buyer', …(6) } to match object { ok: false, …(1) }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/engine/engine.ts:147:18
           if (outcome.ok) {
             quoteAmount = order.buy.quoteIn;
             baseAmount = outcome.amountOut;
-          } else {
-            reason = outcome.reason;
-          }
+          } else {}
         }
       } else if (order.side === "sell" && order.sell) {
killedBy: runEngine records a rejected buy outcome from the market (e.g. slippage)
statusReason: expected { slot: +0, actorId: 'buyer', …(6) } to match object { ok: false, …(1) }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/engine/engine.ts:151:55
             reason = outcome.reason;
           }
         }
-      } else if (order.side === "sell" && order.sell) {
-        if (order.sell.baseIn > wallet.baseBalance) {
-          reason = "insufficient balance";
-        } else {
-          const outcome = config.market.sell(order.sell);
-          ok = outcome.ok;
-          if (outcome.ok) {
-            quoteAmount = outcome.amountOut;
-            baseAmount = order.sell.baseIn;
-          } else {
-            reason = outcome.reason;
-          }
-        }
-      } else {
+      } else if (order.side === "sell" && order.sell) {} else {
         reason = "malformed order";
       }
killedBy: runEngine fills a sell order, updating the market and wallet
statusReason: expected { slot: +0, actorId: 'seller', …(6) } to match object { side: 'sell', ok: true, base: 9802n }
(5 matching properties omitted from actual)

[Killed] EqualityOperator
src/engine/engine.ts:151:18
             reason = outcome.reason;
           }
         }
-      } else if (order.side === "sell" && order.sell) {
+      } else if (order.side !== "sell" && order.sell) {
         if (order.sell.baseIn > wallet.baseBalance) {
           reason = "insufficient balance";
killedBy: runEngine fills a sell order, updating the market and wallet
statusReason: expected { slot: +0, actorId: 'seller', …(6) } to match object { side: 'sell', ok: true, base: 9802n }
(5 matching properties omitted from actual)

[Killed] EqualityOperator
src/engine/engine.ts:152:13
           }
         }
       } else if (order.side === "sell" && order.sell) {
-        if (order.sell.baseIn > wallet.baseBalance) {
+        if (order.sell.baseIn >= wallet.baseBalance) {
           reason = "insufficient balance";
         } else {
killedBy: runEngine fills a sell order, updating the market and wallet
statusReason: expected { slot: +0, actorId: 'seller', …(6) } to match object { side: 'sell', ok: true, base: 9802n }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
src/engine/engine.ts:152:13
           }
         }
       } else if (order.side === "sell" && order.sell) {
-        if (order.sell.baseIn > wallet.baseBalance) {
+        if (true) {
           reason = "insufficient balance";
         } else {
killedBy: runEngine fills a sell order, updating the market and wallet
statusReason: expected { slot: +0, actorId: 'seller', …(6) } to match object { side: 'sell', ok: true, base: 9802n }
(5 matching properties omitted from actual)

[Killed] BlockStatement
src/engine/engine.ts:154:16
       } else if (order.side === "sell" && order.sell) {
         if (order.sell.baseIn > wallet.baseBalance) {
           reason = "insufficient balance";
-        } else {
-          const outcome = config.market.sell(order.sell);
-          ok = outcome.ok;
-          if (outcome.ok) {
-            quoteAmount = outcome.amountOut;
-            baseAmount = order.sell.baseIn;
-          } else {
-            reason = outcome.reason;
-          }
-        }
+        } else {}
       } else {
         reason = "malformed order";
killedBy: runEngine fills a sell order, updating the market and wallet
statusReason: expected { slot: +0, actorId: 'seller', …(6) } to match object { side: 'sell', ok: true, base: 9802n }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
src/engine/engine.ts:157:15
         } else {
           const outcome = config.market.sell(order.sell);
           ok = outcome.ok;
-          if (outcome.ok) {
+          if (false) {
             quoteAmount = outcome.amountOut;
             baseAmount = order.sell.baseIn;
killedBy: runEngine fills a sell order, updating the market and wallet
statusReason: expected { slot: +0, actorId: 'seller', …(6) } to match object { side: 'sell', ok: true, base: 9802n }
(5 matching properties omitted from actual)

[Killed] BlockStatement
src/engine/engine.ts:160:18
           if (outcome.ok) {
             quoteAmount = outcome.amountOut;
             baseAmount = order.sell.baseIn;
-          } else {
-            reason = outcome.reason;
-          }
+          } else {}
         }
       } else {
killedBy: runEngine records a rejected sell outcome from the market (e.g. slippage)
statusReason: expected { slot: +0, actorId: 'seller', …(6) } to match object { ok: false, …(1) }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/engine/engine.ts:164:14
             reason = outcome.reason;
           }
         }
-      } else {
-        reason = "malformed order";
-      }
+      } else {}
 
       if (ok) {
killedBy: runEngine records a malformed order (side without a matching buy/sell payload) as rejected
statusReason: expected { slot: +0, actorId: 'confused', …(6) } to match object { Object (ok, reason) }
(6 matching properties omitted from actual)

[Killed] StringLiteral
src/engine/engine.ts:165:18
           }
         }
       } else {
-        reason = "malformed order";
+        reason = "";
       }
 
killedBy: runEngine records a malformed order (side without a matching buy/sell payload) as rejected
statusReason: expected { slot: +0, actorId: 'confused', …(6) } to match object { Object (ok, reason) }
(6 matching properties omitted from actual)

[Killed] BlockStatement
src/engine/engine.ts:168:15
         reason = "malformed order";
       }
 
-      if (ok) {
-        wallets.set(
-          order.actorId,
-          applyFill(wallet, { side: order.side, quoteAmount, baseAmount }),
-        );
-      }
+      if (ok) {}
       trades.push({
         slot: nextSlot,
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected 10000n to be 0n // Object.is equality

[Killed] ConditionalExpression
src/engine/engine.ts:168:11
         reason = "malformed order";
       }
 
-      if (ok) {
+      if (false) {
         wallets.set(
           order.actorId,
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected 10000n to be 0n // Object.is equality

[Killed] ObjectLiteral
src/engine/engine.ts:171:29
       if (ok) {
         wallets.set(
           order.actorId,
-          applyFill(wallet, { side: order.side, quoteAmount, baseAmount }),
+          applyFill(wallet, {}),
         );
       }
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] BlockStatement
src/engine/engine.ts:186:46
       });
     }
 
-    for (const mechanic of config.mechanics) {
-      if (mechanic.due(nextSlot)) {
-        mechanicEvents.push(mechanic.apply({ slot: nextSlot, market: config.market }));
-      }
-    }
+    for (const mechanic of config.mechanics) {}
 
     if (nextSlot >= nextSampleSlot) {
killedBy: runEngine runs due mechanics after orders execute each slot
statusReason: expected [] to deeply equal [ { slot: +0, …(3) } ]

[Killed] ConditionalExpression
src/engine/engine.ts:187:11
     }
 
     for (const mechanic of config.mechanics) {
-      if (mechanic.due(nextSlot)) {
+      if (false) {
         mechanicEvents.push(mechanic.apply({ slot: nextSlot, market: config.market }));
       }
killedBy: runEngine runs due mechanics after orders execute each slot
statusReason: expected [] to deeply equal [ { slot: +0, …(3) } ]

[Killed] BlockStatement
src/engine/engine.ts:187:35
     }
 
     for (const mechanic of config.mechanics) {
-      if (mechanic.due(nextSlot)) {
-        mechanicEvents.push(mechanic.apply({ slot: nextSlot, market: config.market }));
-      }
+      if (mechanic.due(nextSlot)) {}
     }
 
killedBy: runEngine runs due mechanics after orders execute each slot
statusReason: expected [] to deeply equal [ { slot: +0, …(3) } ]

[Killed] ObjectLiteral
src/engine/engine.ts:188:44
 
     for (const mechanic of config.mechanics) {
       if (mechanic.due(nextSlot)) {
-        mechanicEvents.push(mechanic.apply({ slot: nextSlot, market: config.market }));
+        mechanicEvents.push(mechanic.apply({}));
       }
     }
killedBy: runEngine runs due mechanics after orders execute each slot
statusReason: Cannot read properties of undefined (reading 'burnFromPool')

[Killed] EqualityOperator
src/engine/engine.ts:192:9
       }
     }
 
-    if (nextSlot >= nextSampleSlot) {
+    if (nextSlot < nextSampleSlot) {
       sample(nextSlot);
       nextSampleSlot = nextSlot + config.sampleEvery;
killedBy: runEngine samples the timeline at the configured interval and tracks the peak quote reserve
statusReason: expected [] to deeply equal [ +0, 5, 10 ]

[Killed] ConditionalExpression
src/engine/engine.ts:192:9
       }
     }
 
-    if (nextSlot >= nextSampleSlot) {
+    if (true) {
       sample(nextSlot);
       nextSampleSlot = nextSlot + config.sampleEvery;
killedBy: runEngine samples the timeline at the configured interval and tracks the peak quote reserve
statusReason: expected [ +0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ] to deeply equal [ +0, 5, 10 ]

[Killed] CallExpression
src/engine/engine.ts:193:7
     }
 
     if (nextSlot >= nextSampleSlot) {
-      sample(nextSlot);
+      ;
       nextSampleSlot = nextSlot + config.sampleEvery;
     }
killedBy: runEngine samples the timeline at the configured interval and tracks the peak quote reserve
statusReason: expected [] to deeply equal [ +0, 5, 10 ]

[Killed] ArithmeticOperator
src/engine/engine.ts:194:24
 
     if (nextSlot >= nextSampleSlot) {
       sample(nextSlot);
-      nextSampleSlot = nextSlot + config.sampleEvery;
+      nextSampleSlot = nextSlot - config.sampleEvery;
     }
   }
killedBy: runEngine samples the timeline at the configured interval and tracks the peak quote reserve
statusReason: expected [ +0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ] to deeply equal [ +0, 5, 10 ]

[Killed] ObjectLiteral
src/engine/engine.ts:198:10
     }
   }
 
-  return {
-    durationSlots: config.duration,
-    timeline: { samples, peakQuoteReserve },
-    trades,
-    mechanicEvents,
-    wallets,
-  };
+  return {};
 }
 
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: Target cannot be null or undefined.
