[Killed] BlockStatement
src/engine/event-queue.ts:24:79
 }
 
 /** Orders events by `(slot, sequence)`, ascending. */
-function compareEvents<T>(a: ScheduledEvent<T>, b: ScheduledEvent<T>): number {
-  return a.slot !== b.slot ? a.slot - b.slot : a.sequence - b.sequence;
-}
+function compareEvents<T>(a: ScheduledEvent<T>, b: ScheduledEvent<T>): number {}
 
 /**
killedBy: runEngine gives each scheduled actor its own forked Rng stream, stable across calls
statusReason: Clock.advanceTo: cannot move backward

[Killed] ConditionalExpression
src/engine/event-queue.ts:25:10
 
 /** Orders events by `(slot, sequence)`, ascending. */
 function compareEvents<T>(a: ScheduledEvent<T>, b: ScheduledEvent<T>): number {
-  return a.slot !== b.slot ? a.slot - b.slot : a.sequence - b.sequence;
+  return false ? a.slot - b.slot : a.sequence - b.sequence;
 }
 
killedBy: runEngine gives each scheduled actor its own forked Rng stream, stable across calls
statusReason: Clock.advanceTo: cannot move backward

[Killed] EqualityOperator
src/engine/event-queue.ts:25:10
 
 /** Orders events by `(slot, sequence)`, ascending. */
 function compareEvents<T>(a: ScheduledEvent<T>, b: ScheduledEvent<T>): number {
-  return a.slot !== b.slot ? a.slot - b.slot : a.sequence - b.sequence;
+  return a.slot === b.slot ? a.slot - b.slot : a.sequence - b.sequence;
 }
 
killedBy: runEngine gives each scheduled actor its own forked Rng stream, stable across calls
statusReason: Clock.advanceTo: cannot move backward

[Killed] ArrayDeclaration
src/engine/event-queue.ts:44:37
  * ```
  */
 export function createEventQueue<T>(): EventQueue<T> {
-  const heap: ScheduledEvent<T>[] = [];
+  const heap: ScheduledEvent<T>[] = ["Stryker was here"];
   let nextSequence = 0;
 
killedBy: runEngine orders within a slot by priority fee, higher first
statusReason: expected [ 'low' ] to deeply equal [ 'high', 'low' ]

[Killed] EqualityOperator
src/engine/event-queue.ts:51:9
     const a = heap[i];
     const b = heap[j];
-    if (a === undefined || b === undefined) {
+    if (a !== undefined || b === undefined) {
       return;
     }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] EqualityOperator
src/engine/event-queue.ts:51:28
     const a = heap[i];
     const b = heap[j];
-    if (a === undefined || b === undefined) {
+    if (a === undefined || b !== undefined) {
       return;
     }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] BlockStatement
src/engine/event-queue.ts:58:45
     heap[j] = a;
   }
 
-  function siftUp(startIndex: number): void {
-    let index = startIndex;
-    while (index > 0) {
-      const parent = (index - 1) >> 1;
-      const current = heap[index];
-      const parentEvent = heap[parent];
-      if (!current || !parentEvent || compareEvents(current, parentEvent) >= 0) {
-        break;
-      }
-      swap(index, parent);
-      index = parent;
-    }
-  }
+  function siftUp(startIndex: number): void {}
 
   function siftDown(startIndex: number): void {
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] EqualityOperator
src/engine/event-queue.ts:60:12
 
   function siftUp(startIndex: number): void {
     let index = startIndex;
-    while (index > 0) {
+    while (index <= 0) {
       const parent = (index - 1) >> 1;
       const current = heap[index];
killedBy: createEventQueue leaves later-slot events queued after popping the earliest slot
statusReason: expected [ { slot: 10, sequence: +0, …(1) } ] to deeply equal [ { slot: 5, sequence: 1, …(1) } ]

[Killed] ConditionalExpression
src/engine/event-queue.ts:60:12
 
   function siftUp(startIndex: number): void {
     let index = startIndex;
-    while (index > 0) {
+    while (false) {
       const parent = (index - 1) >> 1;
       const current = heap[index];
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] ArithmeticOperator
src/engine/event-queue.ts:61:23
   function siftUp(startIndex: number): void {
     let index = startIndex;
     while (index > 0) {
-      const parent = (index - 1) >> 1;
+      const parent = (index + 1) >> 1;
       const current = heap[index];
       const parentEvent = heap[parent];
killedBy: createEventQueue leaves later-slot events queued after popping the earliest slot
statusReason: expected [ { slot: 10, sequence: +0, …(1) } ] to deeply equal [ { slot: 5, sequence: 1, …(1) } ]

[Killed] ConditionalExpression
src/engine/event-queue.ts:64:11
       const parent = (index - 1) >> 1;
       const current = heap[index];
       const parentEvent = heap[parent];
-      if (!current || !parentEvent || compareEvents(current, parentEvent) >= 0) {
+      if (true) {
         break;
       }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] LogicalOperator
src/engine/event-queue.ts:64:11
       const parent = (index - 1) >> 1;
       const current = heap[index];
       const parentEvent = heap[parent];
-      if (!current || !parentEvent || compareEvents(current, parentEvent) >= 0) {
+      if ((!current || !parentEvent) && compareEvents(current, parentEvent) >= 0) {
         break;
       }
killedBy: createEventQueue pops all events at the earliest slot, ordered by scheduling sequence
statusReason: expected [ 'third', 'first', 'second' ] to deeply equal [ 'first', 'second', 'third' ]

[Killed] CallExpression
src/engine/event-queue.ts:67:7
       if (!current || !parentEvent || compareEvents(current, parentEvent) >= 0) {
         break;
       }
-      swap(index, parent);
+      ;
       index = parent;
     }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] ConditionalExpression
src/engine/event-queue.ts:74:5
 
   function siftDown(startIndex: number): void {
     let index = startIndex;
-    for (;;) {
-      const left = index * 2 + 1;
-      const right = index * 2 + 2;
-      let smallest = index;
-      const smallestEvent = heap[smallest];
-      const leftEvent = heap[left];
-      const rightEvent = heap[right];
-      if (left < heap.length && leftEvent && smallestEvent && compareEvents(leftEvent, smallestEvent) < 0) {
-        smallest = left;
-      }
-      const smallestSoFar = heap[smallest];
-      if (
-        right < heap.length &&
-        rightEvent &&
-        smallestSoFar &&
-        compareEvents(rightEvent, smallestSoFar) < 0
-      ) {
-        smallest = right;
-      }
-      if (smallest === index) {
-        break;
-      }
-      swap(index, smallest);
-      index = smallest;
-    }
+    for (; false;) {
+  const left = index * 2 + 1;
+  const right = index * 2 + 2;
+  let smallest = index;
+  const smallestEvent = heap[smallest];
+  const leftEvent = heap[left];
+  const rightEvent = heap[right];
+  if (left < heap.length && leftEvent && smallestEvent && compareEvents(leftEvent, smallestEvent) < 0) {
+    smallest = left;
+  }
+  const smallestSoFar = heap[smallest];
+  if (right < heap.length && rightEvent && smallestSoFar && compareEvents(rightEvent, smallestSoFar) < 0) {
+    smallest = right;
+  }
+  if (smallest === index) {
+    break;
+  }
+  swap(index, smallest);
+  index = smallest;
+}
   }
 
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Timeout] BlockStatement
src/engine/event-queue.ts:74:14
 
   function siftDown(startIndex: number): void {
     let index = startIndex;
-    for (;;) {
-      const left = index * 2 + 1;
-      const right = index * 2 + 2;
-      let smallest = index;
-      const smallestEvent = heap[smallest];
-      const leftEvent = heap[left];
-      const rightEvent = heap[right];
-      if (left < heap.length && leftEvent && smallestEvent && compareEvents(leftEvent, smallestEvent) < 0) {
-        smallest = left;
-      }
-      const smallestSoFar = heap[smallest];
-      if (
-        right < heap.length &&
-        rightEvent &&
-        smallestSoFar &&
-        compareEvents(rightEvent, smallestSoFar) < 0
-      ) {
-        smallest = right;
-      }
-      if (smallest === index) {
-        break;
-      }
-      swap(index, smallest);
-      index = smallest;
-    }
+    for (;;) {}
   }
 

[Killed] ArithmeticOperator
src/engine/event-queue.ts:75:20
   function siftDown(startIndex: number): void {
     let index = startIndex;
     for (;;) {
-      const left = index * 2 + 1;
+      const left = index * 2 - 1;
       const right = index * 2 + 2;
       let smallest = index;
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Timeout] ArithmeticOperator
src/engine/event-queue.ts:75:20
   function siftDown(startIndex: number): void {
     let index = startIndex;
     for (;;) {
-      const left = index * 2 + 1;
+      const left = index / 2 + 1;
       const right = index * 2 + 2;
       let smallest = index;

[Killed] ArithmeticOperator
src/engine/event-queue.ts:76:21
     let index = startIndex;
     for (;;) {
       const left = index * 2 + 1;
-      const right = index * 2 + 2;
+      const right = index / 2 + 2;
       let smallest = index;
       const smallestEvent = heap[smallest];
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Timeout] ArithmeticOperator
src/engine/event-queue.ts:76:21
     let index = startIndex;
     for (;;) {
       const left = index * 2 + 1;
-      const right = index * 2 + 2;
+      const right = index * 2 - 2;
       let smallest = index;
       const smallestEvent = heap[smallest];

[Killed] LogicalOperator
src/engine/event-queue.ts:81:11
       const smallestEvent = heap[smallest];
       const leftEvent = heap[left];
       const rightEvent = heap[right];
-      if (left < heap.length && leftEvent && smallestEvent && compareEvents(leftEvent, smallestEvent) < 0) {
+      if (left < heap.length && leftEvent || smallestEvent && compareEvents(leftEvent, smallestEvent) < 0) {
         smallest = left;
       }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Cannot read properties of undefined (reading 'slot')

[Killed] ConditionalExpression
src/engine/event-queue.ts:81:63
       const smallestEvent = heap[smallest];
       const leftEvent = heap[left];
       const rightEvent = heap[right];
-      if (left < heap.length && leftEvent && smallestEvent && compareEvents(leftEvent, smallestEvent) < 0) {
+      if (left < heap.length && leftEvent && smallestEvent && true) {
         smallest = left;
       }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] EqualityOperator
src/engine/event-queue.ts:86:9
       }
       const smallestSoFar = heap[smallest];
       if (
-        right < heap.length &&
+        right >= heap.length &&
         rightEvent &&
         smallestSoFar &&
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] LogicalOperator
src/engine/event-queue.ts:86:9
       }
       const smallestSoFar = heap[smallest];
       if (
-        right < heap.length &&
-        rightEvent &&
-        smallestSoFar &&
-        compareEvents(rightEvent, smallestSoFar) < 0
+        right < heap.length && rightEvent && smallestSoFar || compareEvents(rightEvent, smallestSoFar) < 0
       ) {
         smallest = right;
killedBy: createEventQueue pops all events at the earliest slot, ordered by scheduling sequence
statusReason: Cannot read properties of undefined (reading 'slot')

[Killed] ConditionalExpression
src/engine/event-queue.ts:89:9
         right < heap.length &&
         rightEvent &&
         smallestSoFar &&
-        compareEvents(rightEvent, smallestSoFar) < 0
+        true
       ) {
         smallest = right;
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] EqualityOperator
src/engine/event-queue.ts:89:9
         right < heap.length &&
         rightEvent &&
         smallestSoFar &&
-        compareEvents(rightEvent, smallestSoFar) < 0
+        compareEvents(rightEvent, smallestSoFar) >= 0
       ) {
         smallest = right;
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] BlockStatement
src/engine/event-queue.ts:90:9
         rightEvent &&
         smallestSoFar &&
         compareEvents(rightEvent, smallestSoFar) < 0
-      ) {
-        smallest = right;
-      }
+      ) {}
       if (smallest === index) {
         break;
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] ConditionalExpression
src/engine/event-queue.ts:93:11
       ) {
         smallest = right;
       }
-      if (smallest === index) {
+      if (true) {
         break;
       }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] EqualityOperator
src/engine/event-queue.ts:93:11
       ) {
         smallest = right;
       }
-      if (smallest === index) {
+      if (smallest !== index) {
         break;
       }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] CallExpression
src/engine/event-queue.ts:96:7
       if (smallest === index) {
         break;
       }
-      swap(index, smallest);
+      ;
       index = smallest;
     }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Timeout] BlockStatement
src/engine/event-queue.ts:101:52
     }
   }
 
-  function popMin(): ScheduledEvent<T> | undefined {
-    const top = heap[0];
-    const last = heap.pop();
-    /* v8 ignore next 3 -- coverage-ignore: unreachable, popAllAtNextSlot only calls popMin while heap[0] is confirmed present; this exists only for TS's noUncheckedIndexedAccess. */
-    if (top === undefined) {
-      return undefined;
-    }
-    if (last !== undefined && heap.length > 0) {
-      heap[0] = last;
-      siftDown(0);
-    }
-    return top;
-  }
+  function popMin(): ScheduledEvent<T> | undefined {}
 
   return {

[Killed] ConditionalExpression
src/engine/event-queue.ts:105:9
     const top = heap[0];
     const last = heap.pop();
     /* v8 ignore next 3 -- coverage-ignore: unreachable, popAllAtNextSlot only calls popMin while heap[0] is confirmed present; this exists only for TS's noUncheckedIndexedAccess. */
-    if (top === undefined) {
+    if (true) {
       return undefined;
     }
killedBy: determinism (docs/07) changing only the seed changes the result (proves the Rng is wired in)
statusReason: expected [] to not deeply equal []

[Killed] EqualityOperator
src/engine/event-queue.ts:105:9
     const top = heap[0];
     const last = heap.pop();
     /* v8 ignore next 3 -- coverage-ignore: unreachable, popAllAtNextSlot only calls popMin while heap[0] is confirmed present; this exists only for TS's noUncheckedIndexedAccess. */
-    if (top === undefined) {
+    if (top !== undefined) {
       return undefined;
     }
killedBy: determinism (docs/07) changing only the seed changes the result (proves the Rng is wired in)
statusReason: expected [] to not deeply equal []

[Killed] EqualityOperator
src/engine/event-queue.ts:108:9
     if (top === undefined) {
       return undefined;
     }
-    if (last !== undefined && heap.length > 0) {
+    if (last === undefined && heap.length > 0) {
       heap[0] = last;
       siftDown(0);
killedBy: runEngine orders within a slot by priority fee, higher first
statusReason: expected [ 'low' ] to deeply equal [ 'high', 'low' ]

[Killed] ConditionalExpression
src/engine/event-queue.ts:108:9
     if (top === undefined) {
       return undefined;
     }
-    if (last !== undefined && heap.length > 0) {
+    if (false) {
       heap[0] = last;
       siftDown(0);
killedBy: runEngine orders within a slot by priority fee, higher first
statusReason: expected [ 'low' ] to deeply equal [ 'high', 'low' ]

[Killed] CallExpression
src/engine/event-queue.ts:110:7
     }
     if (last !== undefined && heap.length > 0) {
       heap[0] = last;
-      siftDown(0);
+      ;
     }
     return top;
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] BlockStatement
src/engine/event-queue.ts:116:46
   }
 
   return {
-    schedule(slot: number, payload: T): void {
-      if (!Number.isSafeInteger(slot)) {
-        throw new RangeError("EventQueue.schedule: slot must be a safe integer");
-      }
-      if (slot < 0) {
-        throw new RangeError("EventQueue.schedule: slot must be non-negative");
-      }
-      heap.push({ slot, sequence: nextSequence, payload });
-      nextSequence += 1;
-      siftUp(heap.length - 1);
-    },
+    schedule(slot: number, payload: T): void {},
     isEmpty(): boolean {
       return heap.length === 0;
killedBy: determinism (docs/07) changing only the seed changes the result (proves the Rng is wired in)
statusReason: expected [] to not deeply equal []

[Killed] ConditionalExpression
src/engine/event-queue.ts:117:11
 
   return {
     schedule(slot: number, payload: T): void {
-      if (!Number.isSafeInteger(slot)) {
+      if (true) {
         throw new RangeError("EventQueue.schedule: slot must be a safe integer");
       }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: EventQueue.schedule: slot must be a safe integer

[Killed] BlockStatement
src/engine/event-queue.ts:117:40
 
   return {
     schedule(slot: number, payload: T): void {
-      if (!Number.isSafeInteger(slot)) {
-        throw new RangeError("EventQueue.schedule: slot must be a safe integer");
-      }
+      if (!Number.isSafeInteger(slot)) {}
       if (slot < 0) {
         throw new RangeError("EventQueue.schedule: slot must be non-negative");
killedBy: createEventQueue throws when scheduling a non-integer slot
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/engine/event-queue.ts:120:11
       if (!Number.isSafeInteger(slot)) {
         throw new RangeError("EventQueue.schedule: slot must be a safe integer");
       }
-      if (slot < 0) {
+      if (true) {
         throw new RangeError("EventQueue.schedule: slot must be non-negative");
       }
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: EventQueue.schedule: slot must be non-negative

[Killed] EqualityOperator
src/engine/event-queue.ts:120:11
       if (!Number.isSafeInteger(slot)) {
         throw new RangeError("EventQueue.schedule: slot must be a safe integer");
       }
-      if (slot < 0) {
+      if (slot <= 0) {
         throw new RangeError("EventQueue.schedule: slot must be non-negative");
       }
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: EventQueue.schedule: slot must be non-negative

[Killed] AssignmentOperator
src/engine/event-queue.ts:124:7
         throw new RangeError("EventQueue.schedule: slot must be non-negative");
       }
       heap.push({ slot, sequence: nextSequence, payload });
-      nextSequence += 1;
+      nextSequence -= 1;
       siftUp(heap.length - 1);
     },
killedBy: runEngine preserves scheduling order when two orders have equal priority fee
statusReason: expected [ 'second', 'first' ] to deeply equal [ 'first', 'second' ]

[Killed] ArithmeticOperator
src/engine/event-queue.ts:125:14
       }
       heap.push({ slot, sequence: nextSequence, payload });
       nextSequence += 1;
-      siftUp(heap.length - 1);
+      siftUp(heap.length + 1);
     },
     isEmpty(): boolean {
killedBy: createEventQueue leaves later-slot events queued after popping the earliest slot
statusReason: expected [ { slot: 10, sequence: +0, …(1) } ] to deeply equal [ { slot: 5, sequence: 1, …(1) } ]

[Killed] BlockStatement
src/engine/event-queue.ts:127:24
       nextSequence += 1;
       siftUp(heap.length - 1);
     },
-    isEmpty(): boolean {
-      return heap.length === 0;
-    },
+    isEmpty(): boolean {},
     peekSlot(): number | null {
       return heap[0]?.slot ?? null;
killedBy: createEventQueue starts empty
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/engine/event-queue.ts:128:14
       siftUp(heap.length - 1);
     },
     isEmpty(): boolean {
-      return heap.length === 0;
+      return false;
     },
     peekSlot(): number | null {
killedBy: createEventQueue starts empty
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/engine/event-queue.ts:128:14
       siftUp(heap.length - 1);
     },
     isEmpty(): boolean {
-      return heap.length === 0;
+      return heap.length !== 0;
     },
     peekSlot(): number | null {
killedBy: createEventQueue starts empty
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/engine/event-queue.ts:130:31
     isEmpty(): boolean {
       return heap.length === 0;
     },
-    peekSlot(): number | null {
-      return heap[0]?.slot ?? null;
-    },
+    peekSlot(): number | null {},
     popAllAtNextSlot(): ScheduledEvent<T>[] {
       const firstSlot = heap[0]?.slot;
killedBy: createEventQueue starts empty
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/engine/event-queue.ts:131:14
       return heap.length === 0;
     },
     peekSlot(): number | null {
-      return heap[0]?.slot ?? null;
+      return heap[0]?.slot && null;
     },
     popAllAtNextSlot(): ScheduledEvent<T>[] {
killedBy: createEventQueue starts empty
statusReason: expected undefined to be null

[Killed] OptionalChaining
src/engine/event-queue.ts:131:14
       return heap.length === 0;
     },
     peekSlot(): number | null {
-      return heap[0]?.slot ?? null;
+      return heap[0].slot ?? null;
     },
     popAllAtNextSlot(): ScheduledEvent<T>[] {
killedBy: createEventQueue starts empty
statusReason: Cannot read properties of undefined (reading 'slot')

[Killed] OptionalChaining
src/engine/event-queue.ts:134:25
       return heap[0]?.slot ?? null;
     },
     popAllAtNextSlot(): ScheduledEvent<T>[] {
-      const firstSlot = heap[0]?.slot;
+      const firstSlot = heap[0].slot;
       if (firstSlot === undefined) {
         return [];
killedBy: createEventQueue starts empty
statusReason: Cannot read properties of undefined (reading 'slot')

[Killed] ConditionalExpression
src/engine/event-queue.ts:135:11
     },
     popAllAtNextSlot(): ScheduledEvent<T>[] {
       const firstSlot = heap[0]?.slot;
-      if (firstSlot === undefined) {
+      if (true) {
         return [];
       }
killedBy: createEventQueue schedules and pops a single event
statusReason: expected [] to deeply equal [ { slot: 5, sequence: +0, …(1) } ]

[Timeout] BlockStatement
src/engine/event-queue.ts:135:36
     },
     popAllAtNextSlot(): ScheduledEvent<T>[] {
       const firstSlot = heap[0]?.slot;
-      if (firstSlot === undefined) {
-        return [];
-      }
+      if (firstSlot === undefined) {}
       const due: ScheduledEvent<T>[] = [];
       // The heap always yields the global (slot, sequence) minimum next, so

[Killed] OptionalChaining
src/engine/event-queue.ts:141:14
       const due: ScheduledEvent<T>[] = [];
       // The heap always yields the global (slot, sequence) minimum next, so
       // repeated pops while the slot matches come out already in sequence order.
-      while (heap[0]?.slot === firstSlot) {
+      while (heap[0].slot === firstSlot) {
         const event = popMin();
killedBy: createEventQueue schedules and pops a single event
statusReason: Cannot read properties of undefined (reading 'slot')

[Killed] ConditionalExpression
src/engine/event-queue.ts:141:14
       const due: ScheduledEvent<T>[] = [];
       // The heap always yields the global (slot, sequence) minimum next, so
       // repeated pops while the slot matches come out already in sequence order.
-      while (heap[0]?.slot === firstSlot) {
+      while (false) {
         const event = popMin();
killedBy: createEventQueue schedules and pops a single event
statusReason: expected [] to deeply equal [ { slot: 5, sequence: +0, …(1) } ]

[Killed] ConditionalExpression
src/engine/event-queue.ts:144:13
       while (heap[0]?.slot === firstSlot) {
         const event = popMin();
-        if (event) {
+        if (false) {
           due.push(event);
         }
killedBy: createEventQueue schedules and pops a single event
statusReason: expected [] to deeply equal [ { slot: 5, sequence: +0, …(1) } ]

[Killed] BlockStatement
src/engine/event-queue.ts:144:20
       while (heap[0]?.slot === firstSlot) {
         const event = popMin();
-        if (event) {
-          due.push(event);
-        }
+        if (event) {}
       }
       return due;
killedBy: createEventQueue schedules and pops a single event
statusReason: expected [] to deeply equal [ { slot: 5, sequence: +0, …(1) } ]

[Killed] CallExpression
src/engine/event-queue.ts:145:11
         const event = popMin();
         if (event) {
-          due.push(event);
+          ;
         }
       }
killedBy: createEventQueue schedules and pops a single event
statusReason: expected [] to deeply equal [ { slot: 5, sequence: +0, …(1) } ]
