[Killed] Regex
src/math/parse-amount.ts:6:23
 /** Lamports per SOL: SOL has 9 decimal places on-chain. */
 const LAMPORTS_PER_SOL_DECIMALS = 9;
 
-const AMOUNT_STRING = /^(\S+)\s+(\S+)$/;
+const AMOUNT_STRING = /^(\S+)\s+(\S)$/;
 
 /** Units `parseAmount` accepts, mapped to their decimal places. */
killedBy: parseAmount converts a whole SOL amount to lamports
statusReason: parseAmount: invalid amount "2 SOL"

[Killed] BlockStatement
src/math/parse-amount.ts:24:52
  * parseAmount("2 SOL"); // 2_000_000_000n
  * ```
  */
-export function parseAmount(input: string): bigint {
-  const match = AMOUNT_STRING.exec(input.trim());
-  if (!match) {
-    throw new RangeError(`parseAmount: invalid amount "${input}"`);
-  }
-  const [, value = "", unit = ""] = match;
-  const decimals = UNIT_DECIMALS[unit];
-  if (decimals === undefined) {
-    throw new RangeError(`parseAmount: unsupported unit "${unit}" in "${input}"`);
-  }
-  try {
-    return parseDecimalToBigInt(value, decimals);
-  } catch {
-    throw new RangeError(`parseAmount: invalid amount "${input}"`);
-  }
-}
+export function parseAmount(input: string): bigint {}
 
killedBy: parseAmount converts a whole SOL amount to lamports
statusReason: expected undefined to be 2000000000n // Object.is equality

[Killed] MethodExpression
src/math/parse-amount.ts:25:36
  * ```
  */
 export function parseAmount(input: string): bigint {
-  const match = AMOUNT_STRING.exec(input.trim());
+  const match = AMOUNT_STRING.exec(input);
   if (!match) {
     throw new RangeError(`parseAmount: invalid amount "${input}"`);
killedBy: parseAmount trims surrounding whitespace
statusReason: parseAmount: invalid amount "  2 SOL  "

[Killed] BlockStatement
src/math/parse-amount.ts:26:15
  */
 export function parseAmount(input: string): bigint {
   const match = AMOUNT_STRING.exec(input.trim());
-  if (!match) {
-    throw new RangeError(`parseAmount: invalid amount "${input}"`);
-  }
+  if (!match) {}
   const [, value = "", unit = ""] = match;
   const decimals = UNIT_DECIMALS[unit];
killedBy: parseAmount throws when the unit is missing
statusReason: expected [Function] to throw error matching /invalid amount/ but got 'match is not iterable'

[Killed] ConditionalExpression
src/math/parse-amount.ts:26:7
  */
 export function parseAmount(input: string): bigint {
   const match = AMOUNT_STRING.exec(input.trim());
-  if (!match) {
+  if (true) {
     throw new RangeError(`parseAmount: invalid amount "${input}"`);
   }
killedBy: parseAmount converts a whole SOL amount to lamports
statusReason: parseAmount: invalid amount "2 SOL"

[Killed] StringLiteral
src/math/parse-amount.ts:27:26
 export function parseAmount(input: string): bigint {
   const match = AMOUNT_STRING.exec(input.trim());
   if (!match) {
-    throw new RangeError(`parseAmount: invalid amount "${input}"`);
+    throw new RangeError(``);
   }
   const [, value = "", unit = ""] = match;
killedBy: parseAmount throws when the unit is missing
statusReason: expected [Function] to throw error matching /invalid amount/ but got ''

[NoCoverage] StringLiteral
src/math/parse-amount.ts:29:31
   if (!match) {
     throw new RangeError(`parseAmount: invalid amount "${input}"`);
   }
-  const [, value = "", unit = ""] = match;
+  const [, value = "", unit = "Stryker was here!"] = match;
   const decimals = UNIT_DECIMALS[unit];
   if (decimals === undefined) {

[Killed] ConditionalExpression
src/math/parse-amount.ts:31:7
   }
   const [, value = "", unit = ""] = match;
   const decimals = UNIT_DECIMALS[unit];
-  if (decimals === undefined) {
+  if (false) {
     throw new RangeError(`parseAmount: unsupported unit "${unit}" in "${input}"`);
   }
killedBy: parseAmount throws on an unsupported unit
statusReason: expected [Function] to throw error matching /unsupported unit/ but got 'parseAmount: invalid amount "2 USDC"'

[Killed] BlockStatement
src/math/parse-amount.ts:31:31
   }
   const [, value = "", unit = ""] = match;
   const decimals = UNIT_DECIMALS[unit];
-  if (decimals === undefined) {
-    throw new RangeError(`parseAmount: unsupported unit "${unit}" in "${input}"`);
-  }
+  if (decimals === undefined) {}
   try {
     return parseDecimalToBigInt(value, decimals);
killedBy: parseAmount throws on an unsupported unit
statusReason: expected [Function] to throw error matching /unsupported unit/ but got 'parseAmount: invalid amount "2 USDC"'

[Killed] BlockStatement
src/math/parse-amount.ts:34:7
   if (decimals === undefined) {
     throw new RangeError(`parseAmount: unsupported unit "${unit}" in "${input}"`);
   }
-  try {
-    return parseDecimalToBigInt(value, decimals);
-  } catch {
+  try {} catch {
     throw new RangeError(`parseAmount: invalid amount "${input}"`);
   }
killedBy: parseAmount converts a whole SOL amount to lamports
statusReason: expected undefined to be 2000000000n // Object.is equality

[Killed] BlockStatement
src/math/parse-amount.ts:36:11
   }
   try {
     return parseDecimalToBigInt(value, decimals);
-  } catch {
-    throw new RangeError(`parseAmount: invalid amount "${input}"`);
-  }
+  } catch {}
 }
 
killedBy: parseAmount throws on a malformed number
statusReason: expected [Function] to throw an error
