[Killed] Regex
src/math/parse-decimal.ts:1:24
-const DECIMAL_STRING = /^(\d+)(?:\.(\d+))?$/;
+const DECIMAL_STRING = /^(\d)(?:\.(\d+))?$/;
 
 /**
killedBy: parseDuration converts seconds to slots
statusReason: parseDuration: invalid duration "30s"

[Killed] Regex
src/math/parse-decimal.ts:1:24
-const DECIMAL_STRING = /^(\d+)(?:\.(\d+))?$/;
+const DECIMAL_STRING = /^(\d+)(?:\.(\D+))?$/;
 
 /**
killedBy: parseDecimalToBigInt scales a decimal number by 10^decimals
statusReason: parseDecimalToBigInt: invalid decimal string "2.5"

[Killed] BlockStatement
src/math/parse-decimal.ts:19:79
  * parseDecimalToBigInt("2.5", 9); // 2_500_000_000n
  * ```
  */
-export function parseDecimalToBigInt(input: string, decimals: number): bigint {
-  const match = DECIMAL_STRING.exec(input);
-  if (!match) {
-    throw new RangeError(`parseDecimalToBigInt: invalid decimal string "${input}"`);
-  }
-  const [, whole = "", fraction = ""] = match;
-  if (fraction.length > decimals) {
-    throw new RangeError(
-      `parseDecimalToBigInt: "${input}" has more precision than ${String(decimals)} decimal places`,
-    );
-  }
-  const paddedFraction = fraction.padEnd(decimals, "0");
-  return BigInt(whole) * 10n ** BigInt(decimals) + BigInt(paddedFraction || "0");
-}
+export function parseDecimalToBigInt(input: string, decimals: number): bigint {}
 
killedBy: parseAmount converts a whole SOL amount to lamports
statusReason: expected undefined to be 2000000000n // Object.is equality

[Killed] BlockStatement
src/math/parse-decimal.ts:21:15
  */
 export function parseDecimalToBigInt(input: string, decimals: number): bigint {
   const match = DECIMAL_STRING.exec(input);
-  if (!match) {
-    throw new RangeError(`parseDecimalToBigInt: invalid decimal string "${input}"`);
-  }
+  if (!match) {}
   const [, whole = "", fraction = ""] = match;
   if (fraction.length > decimals) {
killedBy: parseDecimalToBigInt throws on a non-numeric string
statusReason: expected [Function] to throw error matching /invalid/ but got 'match is not iterable'

[Killed] ConditionalExpression
src/math/parse-decimal.ts:21:7
  */
 export function parseDecimalToBigInt(input: string, decimals: number): bigint {
   const match = DECIMAL_STRING.exec(input);
-  if (!match) {
+  if (false) {
     throw new RangeError(`parseDecimalToBigInt: invalid decimal string "${input}"`);
   }
killedBy: parseDecimalToBigInt throws on a non-numeric string
statusReason: expected [Function] to throw error matching /invalid/ but got 'match is not iterable'

[Killed] StringLiteral
src/math/parse-decimal.ts:22:26
 export function parseDecimalToBigInt(input: string, decimals: number): bigint {
   const match = DECIMAL_STRING.exec(input);
   if (!match) {
-    throw new RangeError(`parseDecimalToBigInt: invalid decimal string "${input}"`);
+    throw new RangeError(``);
   }
   const [, whole = "", fraction = ""] = match;
killedBy: parseDecimalToBigInt throws on a non-numeric string
statusReason: expected [Function] to throw error matching /invalid/ but got ''

[Killed] StringLiteral
src/math/parse-decimal.ts:24:35
   if (!match) {
     throw new RangeError(`parseDecimalToBigInt: invalid decimal string "${input}"`);
   }
-  const [, whole = "", fraction = ""] = match;
+  const [, whole = "", fraction = "Stryker was here!"] = match;
   if (fraction.length > decimals) {
     throw new RangeError(
killedBy: parseAmount converts a whole SOL amount to lamports
statusReason: parseAmount: invalid amount "2 SOL"

[NoCoverage] StringLiteral
src/math/parse-decimal.ts:24:20
   if (!match) {
     throw new RangeError(`parseDecimalToBigInt: invalid decimal string "${input}"`);
   }
-  const [, whole = "", fraction = ""] = match;
+  const [, whole = "Stryker was here!", fraction = ""] = match;
   if (fraction.length > decimals) {
     throw new RangeError(

[Killed] BlockStatement
src/math/parse-decimal.ts:25:35
     throw new RangeError(`parseDecimalToBigInt: invalid decimal string "${input}"`);
   }
   const [, whole = "", fraction = ""] = match;
-  if (fraction.length > decimals) {
-    throw new RangeError(
-      `parseDecimalToBigInt: "${input}" has more precision than ${String(decimals)} decimal places`,
-    );
-  }
+  if (fraction.length > decimals) {}
   const paddedFraction = fraction.padEnd(decimals, "0");
   return BigInt(whole) * 10n ** BigInt(decimals) + BigInt(paddedFraction || "0");
killedBy: parsePercent throws when given more precision than a basis point allows
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/math/parse-decimal.ts:25:7
     throw new RangeError(`parseDecimalToBigInt: invalid decimal string "${input}"`);
   }
   const [, whole = "", fraction = ""] = match;
-  if (fraction.length > decimals) {
+  if (true) {
     throw new RangeError(
       `parseDecimalToBigInt: "${input}" has more precision than ${String(decimals)} decimal places`,
killedBy: parseAmount converts a whole SOL amount to lamports
statusReason: parseAmount: invalid amount "2 SOL"

[Killed] StringLiteral
src/math/parse-decimal.ts:30:52
       `parseDecimalToBigInt: "${input}" has more precision than ${String(decimals)} decimal places`,
     );
   }
-  const paddedFraction = fraction.padEnd(decimals, "0");
+  const paddedFraction = fraction.padEnd(decimals, "");
   return BigInt(whole) * 10n ** BigInt(decimals) + BigInt(paddedFraction || "0");
 }
killedBy: parseDecimalToBigInt scales a decimal number by 10^decimals
statusReason: expected 2000000005n to be 2500000000n // Object.is equality

[Killed] ConditionalExpression
src/math/parse-decimal.ts:31:59
     );
   }
   const paddedFraction = fraction.padEnd(decimals, "0");
-  return BigInt(whole) * 10n ** BigInt(decimals) + BigInt(paddedFraction || "0");
+  return BigInt(whole) * 10n ** BigInt(decimals) + BigInt(true);
 }
 
killedBy: parseDecimalToBigInt (properties) round-trips through format() for any non-negative value and decimals
statusReason: Property failed after 1 tests
{ seed: 42, path: "0:0:0", endOnFailure: true }
Counterexample: [0n,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/math/parse-decimal.ts:31:10
     );
   }
   const paddedFraction = fraction.padEnd(decimals, "0");
-  return BigInt(whole) * 10n ** BigInt(decimals) + BigInt(paddedFraction || "0");
+  return BigInt(whole) / 10n ** BigInt(decimals) + BigInt(paddedFraction || "0");
 }
 
killedBy: parsePercent converts a whole percentage to basis points
statusReason: expected 0n to be 500n // Object.is equality
