[Killed] Regex
src/math/parse-duration.ts:8:25
 const DURATION_VALUE_DECIMALS = 6;
 const DURATION_VALUE_SCALE = 10n ** BigInt(DURATION_VALUE_DECIMALS);
 
-const DURATION_STRING = /^([\d.]+)([a-zA-Z]+)$/;
+const DURATION_STRING = /^([\D.]+)([a-zA-Z]+)$/;
 
 /** Milliseconds per duration unit. */
killedBy: parseDuration converts hours to slots
statusReason: parseDuration: invalid duration "6h"

[Killed] ConditionalExpression
src/math/parse-duration.ts:39:7
  * ```
  */
 export function parseDuration(input: string, slotMs: number): number {
-  if (!Number.isSafeInteger(slotMs)) {
+  if (false) {
     throw new RangeError("parseDuration: slotMs must be a safe integer");
   }
killedBy: parseDuration throws when slotMs is not a safe integer
statusReason: expected [Function] to throw error matching /slotMs must be a safe integer/ but got 'The number 1.5 cannot be converted to…'

[Killed] BlockStatement
src/math/parse-duration.ts:39:38
  * ```
  */
 export function parseDuration(input: string, slotMs: number): number {
-  if (!Number.isSafeInteger(slotMs)) {
-    throw new RangeError("parseDuration: slotMs must be a safe integer");
-  }
+  if (!Number.isSafeInteger(slotMs)) {}
   if (slotMs <= 0) {
     throw new RangeError("parseDuration: slotMs must be positive");
killedBy: parseDuration throws when slotMs is not a safe integer
statusReason: expected [Function] to throw error matching /slotMs must be a safe integer/ but got 'The number 1.5 cannot be converted to…'

[Killed] EqualityOperator
src/math/parse-duration.ts:42:7
   if (!Number.isSafeInteger(slotMs)) {
     throw new RangeError("parseDuration: slotMs must be a safe integer");
   }
-  if (slotMs <= 0) {
+  if (slotMs < 0) {
     throw new RangeError("parseDuration: slotMs must be positive");
   }
killedBy: parseDuration throws when slotMs is zero
statusReason: expected [Function] to throw error matching /slotMs must be positive/ but got 'ceilDiv: division by zero'

[Killed] BlockStatement
src/math/parse-duration.ts:42:20
   if (!Number.isSafeInteger(slotMs)) {
     throw new RangeError("parseDuration: slotMs must be a safe integer");
   }
-  if (slotMs <= 0) {
-    throw new RangeError("parseDuration: slotMs must be positive");
-  }
+  if (slotMs <= 0) {}
   const match = DURATION_STRING.exec(input.trim());
   if (!match) {
killedBy: parseDuration throws when slotMs is zero
statusReason: expected [Function] to throw error matching /slotMs must be positive/ but got 'ceilDiv: division by zero'

[Killed] StringLiteral
src/math/parse-duration.ts:43:26
     throw new RangeError("parseDuration: slotMs must be a safe integer");
   }
   if (slotMs <= 0) {
-    throw new RangeError("parseDuration: slotMs must be positive");
+    throw new RangeError("");
   }
   const match = DURATION_STRING.exec(input.trim());
killedBy: parseDuration throws when slotMs is zero
statusReason: expected [Function] to throw error matching /slotMs must be positive/ but got ''

[Killed] MethodExpression
src/math/parse-duration.ts:45:38
   if (slotMs <= 0) {
     throw new RangeError("parseDuration: slotMs must be positive");
   }
-  const match = DURATION_STRING.exec(input.trim());
+  const match = DURATION_STRING.exec(input);
   if (!match) {
     throw new RangeError(`parseDuration: invalid duration "${input}"`);
killedBy: parseDuration trims surrounding whitespace
statusReason: parseDuration: invalid duration "  6h  "

[Killed] BlockStatement
src/math/parse-duration.ts:46:15
     throw new RangeError("parseDuration: slotMs must be positive");
   }
   const match = DURATION_STRING.exec(input.trim());
-  if (!match) {
-    throw new RangeError(`parseDuration: invalid duration "${input}"`);
-  }
+  if (!match) {}
   const [, value = "", unit = ""] = match;
   const msPerUnit = MS_PER_UNIT[unit];
killedBy: parseDuration throws on a malformed number
statusReason: expected [Function] to throw error matching /invalid duration/ but got 'match is not iterable'

[Killed] ConditionalExpression
src/math/parse-duration.ts:46:7
     throw new RangeError("parseDuration: slotMs must be positive");
   }
   const match = DURATION_STRING.exec(input.trim());
-  if (!match) {
+  if (true) {
     throw new RangeError(`parseDuration: invalid duration "${input}"`);
   }
killedBy: parseDuration converts hours to slots
statusReason: parseDuration: invalid duration "6h"

[Killed] StringLiteral
src/math/parse-duration.ts:47:26
   }
   const match = DURATION_STRING.exec(input.trim());
   if (!match) {
-    throw new RangeError(`parseDuration: invalid duration "${input}"`);
+    throw new RangeError(``);
   }
   const [, value = "", unit = ""] = match;
killedBy: parseDuration throws on a malformed number
statusReason: expected [Function] to throw error matching /invalid duration/ but got ''

[NoCoverage] StringLiteral
src/math/parse-duration.ts:49:20
   if (!match) {
     throw new RangeError(`parseDuration: invalid duration "${input}"`);
   }
-  const [, value = "", unit = ""] = match;
+  const [, value = "Stryker was here!", unit = ""] = match;
   const msPerUnit = MS_PER_UNIT[unit];
   if (msPerUnit === undefined) {

[Killed] ConditionalExpression
src/math/parse-duration.ts:51:7
   }
   const [, value = "", unit = ""] = match;
   const msPerUnit = MS_PER_UNIT[unit];
-  if (msPerUnit === undefined) {
+  if (true) {
     throw new RangeError(`parseDuration: invalid duration "${input}"`);
   }
killedBy: parseDuration converts hours to slots
statusReason: parseDuration: invalid duration "6h"

[Killed] EqualityOperator
src/math/parse-duration.ts:51:7
   }
   const [, value = "", unit = ""] = match;
   const msPerUnit = MS_PER_UNIT[unit];
-  if (msPerUnit === undefined) {
+  if (msPerUnit !== undefined) {
     throw new RangeError(`parseDuration: invalid duration "${input}"`);
   }
killedBy: parseDuration converts hours to slots
statusReason: parseDuration: invalid duration "6h"

[Killed] BlockStatement
src/math/parse-duration.ts:55:7
     throw new RangeError(`parseDuration: invalid duration "${input}"`);
   }
   let scaledValue: bigint;
-  try {
-    scaledValue = parseDecimalToBigInt(value, DURATION_VALUE_DECIMALS);
-  } catch {
+  try {} catch {
     throw new RangeError(`parseDuration: invalid duration "${input}"`);
   }
killedBy: parseDuration converts hours to slots
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] BlockStatement
src/math/parse-duration.ts:57:11
   let scaledValue: bigint;
   try {
     scaledValue = parseDecimalToBigInt(value, DURATION_VALUE_DECIMALS);
-  } catch {
-    throw new RangeError(`parseDuration: invalid duration "${input}"`);
-  }
+  } catch {}
   const totalMs = ceilDiv(scaledValue * msPerUnit, DURATION_VALUE_SCALE);
   const slots = ceilDiv(totalMs, BigInt(slotMs));
killedBy: parseDuration throws when the value has more precision than parseDuration allows
statusReason: expected [Function] to throw error matching /invalid duration/ but got 'Cannot mix BigInt and other types, us…'

[Killed] ArithmeticOperator
src/math/parse-duration.ts:60:27
   } catch {
     throw new RangeError(`parseDuration: invalid duration "${input}"`);
   }
-  const totalMs = ceilDiv(scaledValue * msPerUnit, DURATION_VALUE_SCALE);
+  const totalMs = ceilDiv(scaledValue / msPerUnit, DURATION_VALUE_SCALE);
   const slots = ceilDiv(totalMs, BigInt(slotMs));
   if (slots > BigInt(Number.MAX_SAFE_INTEGER)) {
killedBy: parseDuration converts hours to slots
statusReason: expected 1 to be 54000 // Object.is equality

[Killed] BlockStatement
src/math/parse-duration.ts:62:48
   }
   const totalMs = ceilDiv(scaledValue * msPerUnit, DURATION_VALUE_SCALE);
   const slots = ceilDiv(totalMs, BigInt(slotMs));
-  if (slots > BigInt(Number.MAX_SAFE_INTEGER)) {
-    throw new RangeError(`parseDuration: "${input}" exceeds Number.MAX_SAFE_INTEGER slots`);
-  }
+  if (slots > BigInt(Number.MAX_SAFE_INTEGER)) {}
   return Number(slots);
 }
killedBy: parseDuration throws when the resulting slot count exceeds Number.MAX_SAFE_INTEGER
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/math/parse-duration.ts:62:7
   }
   const totalMs = ceilDiv(scaledValue * msPerUnit, DURATION_VALUE_SCALE);
   const slots = ceilDiv(totalMs, BigInt(slotMs));
-  if (slots > BigInt(Number.MAX_SAFE_INTEGER)) {
+  if (slots <= BigInt(Number.MAX_SAFE_INTEGER)) {
     throw new RangeError(`parseDuration: "${input}" exceeds Number.MAX_SAFE_INTEGER slots`);
   }
killedBy: parseDuration converts hours to slots
statusReason: parseDuration: "6h" exceeds Number.MAX_SAFE_INTEGER slots

[Killed] StringLiteral
src/math/parse-duration.ts:63:26
   const totalMs = ceilDiv(scaledValue * msPerUnit, DURATION_VALUE_SCALE);
   const slots = ceilDiv(totalMs, BigInt(slotMs));
   if (slots > BigInt(Number.MAX_SAFE_INTEGER)) {
-    throw new RangeError(`parseDuration: "${input}" exceeds Number.MAX_SAFE_INTEGER slots`);
+    throw new RangeError(``);
   }
   return Number(slots);
killedBy: parseDuration throws when the resulting slot count exceeds Number.MAX_SAFE_INTEGER
statusReason: expected [Function] to throw error matching /exceeds Number.MAX_SAFE_INTEGER/ but got ''
