[Killed] Regex
src/math/parse-percent.ts:6:24
 /** Basis points have 2 decimal digits of percent precision (1 bp = 0.01%). */
 const BPS_DECIMALS = 2;
 
-const PERCENT_STRING = /^(\S+)%$/;
+const PERCENT_STRING = /^(\s+)%$/;
 
 /**
killedBy: parsePercent converts a whole percentage to basis points
statusReason: parsePercent: invalid percent "5%"

[Killed] BlockStatement
src/math/parse-percent.ts:19:53
  * parsePercent("5%"); // 500n
  * ```
  */
-export function parsePercent(input: string): bigint {
-  const match = PERCENT_STRING.exec(input.trim());
-  if (!match) {
-    throw new RangeError(`parsePercent: invalid percent "${input}"`);
-  }
-  const [, value = ""] = match;
-  try {
-    return parseDecimalToBigInt(value, BPS_DECIMALS);
-  } catch {
-    throw new RangeError(`parsePercent: invalid percent "${input}"`);
-  }
-}
+export function parsePercent(input: string): bigint {}
 
killedBy: parsePercent converts a whole percentage to basis points
statusReason: expected undefined to be 500n // Object.is equality

[Killed] MethodExpression
src/math/parse-percent.ts:20:37
  * ```
  */
 export function parsePercent(input: string): bigint {
-  const match = PERCENT_STRING.exec(input.trim());
+  const match = PERCENT_STRING.exec(input);
   if (!match) {
     throw new RangeError(`parsePercent: invalid percent "${input}"`);
killedBy: parsePercent trims surrounding whitespace
statusReason: parsePercent: invalid percent "  5%  "

[Killed] BlockStatement
src/math/parse-percent.ts:21:15
  */
 export function parsePercent(input: string): bigint {
   const match = PERCENT_STRING.exec(input.trim());
-  if (!match) {
-    throw new RangeError(`parsePercent: invalid percent "${input}"`);
-  }
+  if (!match) {}
   const [, value = ""] = match;
   try {
killedBy: parsePercent throws when the % suffix is missing
statusReason: expected [Function] to throw error matching /invalid percent/ but got 'match is not iterable'

[Killed] ConditionalExpression
src/math/parse-percent.ts:21:7
  */
 export function parsePercent(input: string): bigint {
   const match = PERCENT_STRING.exec(input.trim());
-  if (!match) {
+  if (true) {
     throw new RangeError(`parsePercent: invalid percent "${input}"`);
   }
killedBy: parsePercent converts a whole percentage to basis points
statusReason: parsePercent: invalid percent "5%"

[Killed] StringLiteral
src/math/parse-percent.ts:22:26
 export function parsePercent(input: string): bigint {
   const match = PERCENT_STRING.exec(input.trim());
   if (!match) {
-    throw new RangeError(`parsePercent: invalid percent "${input}"`);
+    throw new RangeError(``);
   }
   const [, value = ""] = match;
killedBy: parsePercent throws when the % suffix is missing
statusReason: expected [Function] to throw error matching /invalid percent/ but got ''

[Killed] BlockStatement
src/math/parse-percent.ts:25:7
     throw new RangeError(`parsePercent: invalid percent "${input}"`);
   }
   const [, value = ""] = match;
-  try {
-    return parseDecimalToBigInt(value, BPS_DECIMALS);
-  } catch {
+  try {} catch {
     throw new RangeError(`parsePercent: invalid percent "${input}"`);
   }
killedBy: parsePercent converts a whole percentage to basis points
statusReason: expected undefined to be 500n // Object.is equality

[Killed] BlockStatement
src/math/parse-percent.ts:27:11
   const [, value = ""] = match;
   try {
     return parseDecimalToBigInt(value, BPS_DECIMALS);
-  } catch {
-    throw new RangeError(`parsePercent: invalid percent "${input}"`);
-  }
+  } catch {}
 }
 
killedBy: parsePercent throws on a malformed number
statusReason: expected [Function] to throw an error
