[Killed] BlockStatement
src/actors/monitoring-slots.ts:8:85
  *
  * @throws {RangeError} If `end` is before `start` or `step` is not positive.
  */
-export function monitoringSlots(start: number, end: number, step: number): number[] {
-  if (end < start) {
-    throw new RangeError("monitoringSlots: end must be at or after start");
-  }
-  if (step <= 0) {
-    throw new RangeError("monitoringSlots: step must be positive");
-  }
-  const slots: number[] = [];
-  for (let slot = start; slot < end; slot += step) {
-    slots.push(slot);
-  }
-  slots.push(end);
-  return slots;
-}
+export function monitoringSlots(start: number, end: number, step: number): number[] {}
 
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: slots is not iterable

[Killed] EqualityOperator
src/actors/monitoring-slots.ts:9:7
  * @throws {RangeError} If `end` is before `start` or `step` is not positive.
  */
 export function monitoringSlots(start: number, end: number, step: number): number[] {
-  if (end < start) {
+  if (end >= start) {
     throw new RangeError("monitoringSlots: end must be at or after start");
   }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: monitoringSlots: end must be at or after start

[Killed] BlockStatement
src/actors/monitoring-slots.ts:9:20
  * @throws {RangeError} If `end` is before `start` or `step` is not positive.
  */
 export function monitoringSlots(start: number, end: number, step: number): number[] {
-  if (end < start) {
-    throw new RangeError("monitoringSlots: end must be at or after start");
-  }
+  if (end < start) {}
   if (step <= 0) {
     throw new RangeError("monitoringSlots: step must be positive");
killedBy: monitoringSlots throws when end is before start
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/actors/monitoring-slots.ts:12:7
   if (end < start) {
     throw new RangeError("monitoringSlots: end must be at or after start");
   }
-  if (step <= 0) {
+  if (true) {
     throw new RangeError("monitoringSlots: step must be positive");
   }
killedBy: monitoringSlots returns slots from start to end at the given step, inclusive of both ends
statusReason: monitoringSlots: step must be positive

[Killed] EqualityOperator
src/actors/monitoring-slots.ts:12:7
   if (end < start) {
     throw new RangeError("monitoringSlots: end must be at or after start");
   }
-  if (step <= 0) {
+  if (step > 0) {
     throw new RangeError("monitoringSlots: step must be positive");
   }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: monitoringSlots: step must be positive

[Killed] BlockStatement
src/actors/monitoring-slots.ts:16:52
     throw new RangeError("monitoringSlots: step must be positive");
   }
   const slots: number[] = [];
-  for (let slot = start; slot < end; slot += step) {
-    slots.push(slot);
-  }
+  for (let slot = start; slot < end; slot += step) {}
   slots.push(end);
   return slots;
killedBy: createRetailActors samples each actor's arrival slot within [0, overSlots]
statusReason: expected 200000 to be less than or equal to 90000

[Killed] ConditionalExpression
src/actors/monitoring-slots.ts:16:26
     throw new RangeError("monitoringSlots: step must be positive");
   }
   const slots: number[] = [];
-  for (let slot = start; slot < end; slot += step) {
+  for (let slot = start; false; slot += step) {
     slots.push(slot);
   }
killedBy: determinism (docs/07) changing only the seed changes the result (proves the Rng is wired in)
statusReason: expected [] to not deeply equal []

[Killed] CallExpression
src/actors/monitoring-slots.ts:17:5
   }
   const slots: number[] = [];
   for (let slot = start; slot < end; slot += step) {
-    slots.push(slot);
+    ;
   }
   slots.push(end);
killedBy: createRetailActors samples each actor's arrival slot within [0, overSlots]
statusReason: expected 200000 to be less than or equal to 90000

[Killed] CallExpression
src/actors/monitoring-slots.ts:19:3
   for (let slot = start; slot < end; slot += step) {
     slots.push(slot);
   }
-  slots.push(end);
+  ;
   return slots;
 }
killedBy: monitoringSlots returns slots from start to end at the given step, inclusive of both ends
statusReason: expected [ +0, 5 ] to deeply equal [ +0, 5, 10 ]
