[Killed] BlockStatement
src/actors/panic-seller.ts:29:12
   quoteReserve: bigint,
   peakQuoteReserve: bigint,
   triggerDrawdownBps: bigint,
-): boolean {
-  return (peakQuoteReserve - quoteReserve) * 10_000n >= triggerDrawdownBps * peakQuoteReserve;
-}
+): boolean {}
 
 function createPanicSellerActor(id: string, config: PanicSellerConfig): Actor {
killedBy: createPanicSellerActors sells everything once drawdown from peak reaches the trigger
statusReason: expected [] to deeply equal [ { actorId: 'panicSeller-0', …(5) } ]

[Killed] ConditionalExpression
src/actors/panic-seller.ts:30:10
   peakQuoteReserve: bigint,
   triggerDrawdownBps: bigint,
 ): boolean {
-  return (peakQuoteReserve - quoteReserve) * 10_000n >= triggerDrawdownBps * peakQuoteReserve;
+  return true;
 }
 
killedBy: createPanicSellerActors does nothing below the drawdown threshold
statusReason: expected [ { actorId: 'panicSeller-0', …(5) } ] to deeply equal []

[Killed] EqualityOperator
src/actors/panic-seller.ts:30:10
   peakQuoteReserve: bigint,
   triggerDrawdownBps: bigint,
 ): boolean {
-  return (peakQuoteReserve - quoteReserve) * 10_000n >= triggerDrawdownBps * peakQuoteReserve;
+  return (peakQuoteReserve - quoteReserve) * 10_000n < triggerDrawdownBps * peakQuoteReserve;
 }
 
killedBy: createPanicSellerActors does nothing below the drawdown threshold
statusReason: expected [ { actorId: 'panicSeller-0', …(5) } ] to deeply equal []

[Survived] StringLiteral
src/actors/panic-seller.ts:36:12
 function createPanicSellerActor(id: string, config: PanicSellerConfig): Actor {
   return {
     id,
-    group: "panicSeller",
+    group: "",
     decide(ctx: ActorContext): readonly Order[] {
       if (ctx.wallet.baseBalance === 0n) {

[Killed] BlockStatement
src/actors/panic-seller.ts:37:49
   return {
     id,
     group: "panicSeller",
-    decide(ctx: ActorContext): readonly Order[] {
-      if (ctx.wallet.baseBalance === 0n) {
-        return [];
-      }
-      if (
-        !isPastDrawdownTrigger(
-          ctx.market.state.quoteReserve,
-          ctx.market.peakQuoteReserve,
-          config.triggerDrawdownBps,
-        )
-      ) {
-        return [];
-      }
-      return [
-        {
-          actorId: id,
-          group: "panicSeller",
-          side: "sell",
-          priorityFee: 0n,
-          reason: "panic sell: drawdown trigger",
-          sell: { baseIn: ctx.wallet.baseBalance, minQuoteOut: 0n },
-        },
-      ];
-    },
+    decide(ctx: ActorContext): readonly Order[] {},
   };
 }
killedBy: createPanicSellerActors does nothing below the drawdown threshold
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/actors/panic-seller.ts:38:11
     id,
     group: "panicSeller",
     decide(ctx: ActorContext): readonly Order[] {
-      if (ctx.wallet.baseBalance === 0n) {
+      if (false) {
         return [];
       }
killedBy: createPanicSellerActors does nothing once already sold out (no base balance)
statusReason: expected [ { actorId: 'panicSeller-0', …(5) } ] to deeply equal []

[Killed] EqualityOperator
src/actors/panic-seller.ts:38:11
     id,
     group: "panicSeller",
     decide(ctx: ActorContext): readonly Order[] {
-      if (ctx.wallet.baseBalance === 0n) {
+      if (ctx.wallet.baseBalance !== 0n) {
         return [];
       }
killedBy: createPanicSellerActors sells everything once drawdown from peak reaches the trigger
statusReason: expected [] to deeply equal [ { actorId: 'panicSeller-0', …(5) } ]

[Killed] ArrayDeclaration
src/actors/panic-seller.ts:39:16
     group: "panicSeller",
     decide(ctx: ActorContext): readonly Order[] {
       if (ctx.wallet.baseBalance === 0n) {
-        return [];
+        return ["Stryker was here"];
       }
       if (
killedBy: createPanicSellerActors does nothing once already sold out (no base balance)
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
src/actors/panic-seller.ts:42:9
         return [];
       }
       if (
-        !isPastDrawdownTrigger(
-          ctx.market.state.quoteReserve,
-          ctx.market.peakQuoteReserve,
-          config.triggerDrawdownBps,
-        )
+        false
       ) {
         return [];
killedBy: createPanicSellerActors does nothing below the drawdown threshold
statusReason: expected [ { actorId: 'panicSeller-0', …(5) } ] to deeply equal []

[Killed] BooleanLiteral
src/actors/panic-seller.ts:42:9
         return [];
       }
       if (
-        !isPastDrawdownTrigger(
-          ctx.market.state.quoteReserve,
-          ctx.market.peakQuoteReserve,
-          config.triggerDrawdownBps,
-        )
+        isPastDrawdownTrigger(ctx.market.state.quoteReserve, ctx.market.peakQuoteReserve, config.triggerDrawdownBps)
       ) {
         return [];
killedBy: createPanicSellerActors does nothing below the drawdown threshold
statusReason: expected [ { actorId: 'panicSeller-0', …(5) } ] to deeply equal []

[Killed] BlockStatement
src/actors/panic-seller.ts:47:9
           ctx.market.peakQuoteReserve,
           config.triggerDrawdownBps,
         )
-      ) {
-        return [];
-      }
+      ) {}
       return [
         {
killedBy: createPanicSellerActors does nothing below the drawdown threshold
statusReason: expected [ { actorId: 'panicSeller-0', …(5) } ] to deeply equal []

[Killed] ObjectLiteral
src/actors/panic-seller.ts:51:9
         return [];
       }
       return [
-        {
-          actorId: id,
-          group: "panicSeller",
-          side: "sell",
-          priorityFee: 0n,
-          reason: "panic sell: drawdown trigger",
-          sell: { baseIn: ctx.wallet.baseBalance, minQuoteOut: 0n },
-        },
+        {},
       ];
     },
killedBy: createPanicSellerActors sells everything once drawdown from peak reaches the trigger
statusReason: expected [ {} ] to deeply equal [ { actorId: 'panicSeller-0', …(5) } ]

[Killed] StringLiteral
src/actors/panic-seller.ts:54:17
         {
           actorId: id,
           group: "panicSeller",
-          side: "sell",
+          side: "",
           priorityFee: 0n,
           reason: "panic sell: drawdown trigger",
killedBy: createPanicSellerActors sells everything once drawdown from peak reaches the trigger
statusReason: expected [ { actorId: 'panicSeller-0', …(5) } ] to deeply equal [ { actorId: 'panicSeller-0', …(5) } ]

[Killed] BlockStatement
src/actors/panic-seller.ts:81:22
   duration: number,
   monitorStep: number,
   rng: Rng,
-): PanicSellerActors {
-  const scheduled: ScheduledActor[] = [];
-  const initialWallets = new Map<string, WalletView>();
-  for (let i = 0; i < count; i++) {
-    const id = `panicSeller-${String(i)}`;
-    const holdings = sampleAmountRange(rng.fork(id), config.holdingsMin, config.holdingsMax);
-    scheduled.push({
-      actor: createPanicSellerActor(id, config),
-      slots: monitoringSlots(0, duration, monitorStep),
-    });
-    initialWallets.set(id, { quoteBalance: 0n, baseBalance: holdings, entryPrice: null });
-  }
-  return { scheduled, initialWallets };
-}
+): PanicSellerActors {}
 
killedBy: createPanicSellerActors creates `count` distinct actors, each pre-funded with sampled holdings
statusReason: Cannot destructure property 'scheduled' of 'createPanicSellerActors(...)' as it is undefined.

[Killed] ArrayDeclaration
src/actors/panic-seller.ts:82:39
   monitorStep: number,
   rng: Rng,
 ): PanicSellerActors {
-  const scheduled: ScheduledActor[] = [];
+  const scheduled: ScheduledActor[] = ["Stryker was here"];
   const initialWallets = new Map<string, WalletView>();
   for (let i = 0; i < count; i++) {
killedBy: createPanicSellerActors creates `count` distinct actors, each pre-funded with sampled holdings
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/actors/panic-seller.ts:84:19
 ): PanicSellerActors {
   const scheduled: ScheduledActor[] = [];
   const initialWallets = new Map<string, WalletView>();
-  for (let i = 0; i < count; i++) {
+  for (let i = 0; false; i++) {
     const id = `panicSeller-${String(i)}`;
     const holdings = sampleAmountRange(rng.fork(id), config.holdingsMin, config.holdingsMax);
killedBy: createPanicSellerActors creates `count` distinct actors, each pre-funded with sampled holdings
statusReason: expected [] to deeply equal [ 'panicSeller-0', …(2) ]

[Killed] EqualityOperator
src/actors/panic-seller.ts:84:19
 ): PanicSellerActors {
   const scheduled: ScheduledActor[] = [];
   const initialWallets = new Map<string, WalletView>();
-  for (let i = 0; i < count; i++) {
+  for (let i = 0; i >= count; i++) {
     const id = `panicSeller-${String(i)}`;
     const holdings = sampleAmountRange(rng.fork(id), config.holdingsMin, config.holdingsMax);
killedBy: createPanicSellerActors creates `count` distinct actors, each pre-funded with sampled holdings
statusReason: expected [] to deeply equal [ 'panicSeller-0', …(2) ]

[Killed] StringLiteral
src/actors/panic-seller.ts:85:16
   const scheduled: ScheduledActor[] = [];
   const initialWallets = new Map<string, WalletView>();
   for (let i = 0; i < count; i++) {
-    const id = `panicSeller-${String(i)}`;
+    const id = ``;
     const holdings = sampleAmountRange(rng.fork(id), config.holdingsMin, config.holdingsMax);
     scheduled.push({
killedBy: createPanicSellerActors creates `count` distinct actors, each pre-funded with sampled holdings
statusReason: expected [ '', '', '' ] to deeply equal [ 'panicSeller-0', …(2) ]

[Killed] ObjectLiteral
src/actors/panic-seller.ts:91:28
       actor: createPanicSellerActor(id, config),
       slots: monitoringSlots(0, duration, monitorStep),
     });
-    initialWallets.set(id, { quoteBalance: 0n, baseBalance: holdings, entryPrice: null });
+    initialWallets.set(id, {});
   }
   return { scheduled, initialWallets };
killedBy: createPanicSellerActors creates `count` distinct actors, each pre-funded with sampled holdings
statusReason: actual value must be number or bigint, received "undefined"
