[Killed] BlockStatement
src/actors/price-target.ts:15:95
  *
  * @throws {RangeError} If `multiplier` is not positive.
  */
-export function hasReachedMultiple(current: Price, entry: Price, multiplier: number): boolean {
-  if (!(multiplier > 0)) {
-    throw new RangeError("hasReachedMultiple: multiplier must be positive");
-  }
-  const multiplierNum = BigInt(Math.round(multiplier * Number(MULTIPLIER_SCALE)));
-  // current >= entry * multiplier
-  // current.num/current.den >= (entry.num * multiplierNum) / (entry.den * MULTIPLIER_SCALE)
-  const left = current.num * entry.den * MULTIPLIER_SCALE;
-  const right = entry.num * multiplierNum * current.den;
-  return left >= right;
-}
+export function hasReachedMultiple(current: Price, entry: Price, multiplier: number): boolean {}
 
 /**
killedBy: createRetailActors sells on reaching takeProfitX when the probability roll succeeds
statusReason: expected [] to deeply equal [ { actorId: 'retail-0', …(5) } ]

[Killed] BlockStatement
src/actors/price-target.ts:16:26
  * @throws {RangeError} If `multiplier` is not positive.
  */
 export function hasReachedMultiple(current: Price, entry: Price, multiplier: number): boolean {
-  if (!(multiplier > 0)) {
-    throw new RangeError("hasReachedMultiple: multiplier must be positive");
-  }
+  if (!(multiplier > 0)) {}
   const multiplierNum = BigInt(Math.round(multiplier * Number(MULTIPLIER_SCALE)));
   // current >= entry * multiplier
killedBy: hasReachedMultiple throws when multiplier is not positive
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/actors/price-target.ts:16:7
  * @throws {RangeError} If `multiplier` is not positive.
  */
 export function hasReachedMultiple(current: Price, entry: Price, multiplier: number): boolean {
-  if (!(multiplier > 0)) {
+  if (multiplier > 0) {
     throw new RangeError("hasReachedMultiple: multiplier must be positive");
   }
killedBy: createRetailActors does not buy again at the arrival slot if somehow already holding
statusReason: hasReachedMultiple: multiplier must be positive

[Killed] ArithmeticOperator
src/actors/price-target.ts:19:43
   if (!(multiplier > 0)) {
     throw new RangeError("hasReachedMultiple: multiplier must be positive");
   }
-  const multiplierNum = BigInt(Math.round(multiplier * Number(MULTIPLIER_SCALE)));
+  const multiplierNum = BigInt(Math.round(multiplier / Number(MULTIPLIER_SCALE)));
   // current >= entry * multiplier
   // current.num/current.den >= (entry.num * multiplierNum) / (entry.den * MULTIPLIER_SCALE)
killedBy: createRetailActors does not buy again at the arrival slot if somehow already holding
statusReason: expected [ { actorId: 'retail-0', …(5) } ] to deeply equal []

[Killed] ArithmeticOperator
src/actors/price-target.ts:22:16
   const multiplierNum = BigInt(Math.round(multiplier * Number(MULTIPLIER_SCALE)));
   // current >= entry * multiplier
   // current.num/current.den >= (entry.num * multiplierNum) / (entry.den * MULTIPLIER_SCALE)
-  const left = current.num * entry.den * MULTIPLIER_SCALE;
+  const left = current.num * entry.den / MULTIPLIER_SCALE;
   const right = entry.num * multiplierNum * current.den;
   return left >= right;
killedBy: hasReachedMultiple returns true when the current price has reached the target multiple
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/actors/price-target.ts:22:16
   const multiplierNum = BigInt(Math.round(multiplier * Number(MULTIPLIER_SCALE)));
   // current >= entry * multiplier
   // current.num/current.den >= (entry.num * multiplierNum) / (entry.den * MULTIPLIER_SCALE)
-  const left = current.num * entry.den * MULTIPLIER_SCALE;
+  const left = current.num / entry.den * MULTIPLIER_SCALE;
   const right = entry.num * multiplierNum * current.den;
   return left >= right;

[Killed] ArithmeticOperator
src/actors/price-target.ts:23:17
   // current >= entry * multiplier
   // current.num/current.den >= (entry.num * multiplierNum) / (entry.den * MULTIPLIER_SCALE)
   const left = current.num * entry.den * MULTIPLIER_SCALE;
-  const right = entry.num * multiplierNum * current.den;
+  const right = entry.num * multiplierNum / current.den;
   return left >= right;
 }
killedBy: hasReachedMultiple returns false when the current price is below the target multiple
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/actors/price-target.ts:23:17
   // current >= entry * multiplier
   // current.num/current.den >= (entry.num * multiplierNum) / (entry.den * MULTIPLIER_SCALE)
   const left = current.num * entry.den * MULTIPLIER_SCALE;
-  const right = entry.num * multiplierNum * current.den;
+  const right = entry.num / multiplierNum * current.den;
   return left >= right;
 }
killedBy: hasReachedMultiple returns false when the current price is below the target multiple
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/actors/price-target.ts:24:10
   // current.num/current.den >= (entry.num * multiplierNum) / (entry.den * MULTIPLIER_SCALE)
   const left = current.num * entry.den * MULTIPLIER_SCALE;
   const right = entry.num * multiplierNum * current.den;
-  return left >= right;
+  return true;
 }
 
killedBy: hasReachedMultiple returns false when the current price is below the target multiple
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/actors/price-target.ts:24:10
   // current.num/current.den >= (entry.num * multiplierNum) / (entry.den * MULTIPLIER_SCALE)
   const left = current.num * entry.den * MULTIPLIER_SCALE;
   const right = entry.num * multiplierNum * current.den;
-  return left >= right;
+  return left > right;
 }
 
killedBy: hasReachedMultiple returns true when the current price has reached the target multiple
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/actors/price-target.ts:34:97
  *
  * @throws {RangeError} If `multiplier` is not positive.
  */
-export function hasDroppedToMultiple(current: Price, entry: Price, multiplier: number): boolean {
-  if (!(multiplier > 0)) {
-    throw new RangeError("hasDroppedToMultiple: multiplier must be positive");
-  }
-  const multiplierNum = BigInt(Math.round(multiplier * Number(MULTIPLIER_SCALE)));
-  const left = current.num * entry.den * MULTIPLIER_SCALE;
-  const right = entry.num * multiplierNum * current.den;
-  return left <= right;
-}
+export function hasDroppedToMultiple(current: Price, entry: Price, multiplier: number): boolean {}
 
killedBy: hasDroppedToMultiple returns true when the current price has dropped to the target multiple
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/actors/price-target.ts:35:7
  * @throws {RangeError} If `multiplier` is not positive.
  */
 export function hasDroppedToMultiple(current: Price, entry: Price, multiplier: number): boolean {
-  if (!(multiplier > 0)) {
+  if (true) {
     throw new RangeError("hasDroppedToMultiple: multiplier must be positive");
   }
killedBy: hasDroppedToMultiple returns true when the current price has dropped to the target multiple
statusReason: hasDroppedToMultiple: multiplier must be positive

[Killed] BooleanLiteral
src/actors/price-target.ts:35:7
  * @throws {RangeError} If `multiplier` is not positive.
  */
 export function hasDroppedToMultiple(current: Price, entry: Price, multiplier: number): boolean {
-  if (!(multiplier > 0)) {
+  if (multiplier > 0) {
     throw new RangeError("hasDroppedToMultiple: multiplier must be positive");
   }
killedBy: hasDroppedToMultiple returns true when the current price has dropped to the target multiple
statusReason: hasDroppedToMultiple: multiplier must be positive

[Killed] ArithmeticOperator
src/actors/price-target.ts:39:16
     throw new RangeError("hasDroppedToMultiple: multiplier must be positive");
   }
   const multiplierNum = BigInt(Math.round(multiplier * Number(MULTIPLIER_SCALE)));
-  const left = current.num * entry.den * MULTIPLIER_SCALE;
+  const left = current.num * entry.den / MULTIPLIER_SCALE;
   const right = entry.num * multiplierNum * current.den;
   return left <= right;
killedBy: hasDroppedToMultiple returns false when the current price is still above the target multiple
statusReason: expected true to be false // Object.is equality

[Survived] ArithmeticOperator
src/actors/price-target.ts:39:16
     throw new RangeError("hasDroppedToMultiple: multiplier must be positive");
   }
   const multiplierNum = BigInt(Math.round(multiplier * Number(MULTIPLIER_SCALE)));
-  const left = current.num * entry.den * MULTIPLIER_SCALE;
+  const left = current.num / entry.den * MULTIPLIER_SCALE;
   const right = entry.num * multiplierNum * current.den;
   return left <= right;

[Killed] ConditionalExpression
src/actors/price-target.ts:41:10
   const multiplierNum = BigInt(Math.round(multiplier * Number(MULTIPLIER_SCALE)));
   const left = current.num * entry.den * MULTIPLIER_SCALE;
   const right = entry.num * multiplierNum * current.den;
-  return left <= right;
+  return true;
 }
 
killedBy: hasDroppedToMultiple returns false when the current price is still above the target multiple
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/actors/price-target.ts:41:10
   const multiplierNum = BigInt(Math.round(multiplier * Number(MULTIPLIER_SCALE)));
   const left = current.num * entry.den * MULTIPLIER_SCALE;
   const right = entry.num * multiplierNum * current.den;
-  return left <= right;
+  return false;
 }
 
killedBy: hasDroppedToMultiple returns true when the current price has dropped to the target multiple
statusReason: expected false to be true // Object.is equality
