[Killed] LogicalOperator
src/actors/retail.ts:28:11
     id,
     group: "retail",
     decide(ctx: ActorContext): readonly Order[] {
-      if (ctx.slot === arrivalSlot && ctx.wallet.baseBalance === 0n) {
+      if (ctx.slot === arrivalSlot || ctx.wallet.baseBalance === 0n) {
         return [
           {
killedBy: createRetailActors does not buy again at the arrival slot if somehow already holding
statusReason: expected [ { actorId: 'retail-0', …(5) } ] to deeply equal []

[Killed] ConditionalExpression
src/actors/retail.ts:28:11
     id,
     group: "retail",
     decide(ctx: ActorContext): readonly Order[] {
-      if (ctx.slot === arrivalSlot && ctx.wallet.baseBalance === 0n) {
+      if (false) {
         return [
           {
killedBy: createRetailActors samples each actor's arrival slot within [0, overSlots]
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/actors/retail.ts:30:11
     decide(ctx: ActorContext): readonly Order[] {
       if (ctx.slot === arrivalSlot && ctx.wallet.baseBalance === 0n) {
         return [
-          {
-            actorId: id,
-            group: "retail",
-            side: "buy",
-            priorityFee: 0n,
-            reason: "retail entry",
-            buy: { quoteIn: spend, minBaseOut: 0n },
-          },
+          {},
         ];
       }
killedBy: createRetailActors buys once at the arrival slot
statusReason: expected {} to match object { actorId: 'retail-0', …(2) }

[Killed] EqualityOperator
src/actors/retail.ts:40:11
           },
         ];
       }
-      if (ctx.wallet.baseBalance === 0n || !ctx.wallet.entryPrice) {
+      if (ctx.wallet.baseBalance !== 0n || !ctx.wallet.entryPrice) {
         return [];
       }
killedBy: createRetailActors sells on reaching takeProfitX when the probability roll succeeds
statusReason: expected [] to deeply equal [ { actorId: 'retail-0', …(5) } ]

[Killed] LogicalOperator
src/actors/retail.ts:40:11
           },
         ];
       }
-      if (ctx.wallet.baseBalance === 0n || !ctx.wallet.entryPrice) {
+      if (ctx.wallet.baseBalance === 0n && !ctx.wallet.entryPrice) {
         return [];
       }
killedBy: createRetailActors does nothing when holding base but somehow has no entry price recorded
statusReason: Cannot read properties of null (reading 'den')

[Killed] ArrayDeclaration
src/actors/retail.ts:41:16
         ];
       }
       if (ctx.wallet.baseBalance === 0n || !ctx.wallet.entryPrice) {
-        return [];
+        return ["Stryker was here"];
       }
       const tookProfit = hasReachedMultiple(ctx.market.price, ctx.wallet.entryPrice, config.takeProfitX);
killedBy: createRetailActors does not buy on a slot other than its arrival slot
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
src/actors/retail.ts:49:11
         ctx.wallet.entryPrice,
         config.stopLossMultiplier,
       );
-      if (!tookProfit && !stoppedOut) {
+      if (true) {
         return [];
       }
killedBy: createRetailActors sells on reaching takeProfitX when the probability roll succeeds
statusReason: expected [] to deeply equal [ { actorId: 'retail-0', …(5) } ]

[Killed] BooleanLiteral
src/actors/retail.ts:49:11
         ctx.wallet.entryPrice,
         config.stopLossMultiplier,
       );
-      if (!tookProfit && !stoppedOut) {
+      if (tookProfit && !stoppedOut) {
         return [];
       }
killedBy: createRetailActors does not buy again at the arrival slot if somehow already holding
statusReason: expected [ { actorId: 'retail-0', …(5) } ] to deeply equal []

[Killed] ConditionalExpression
src/actors/retail.ts:52:11
       if (!tookProfit && !stoppedOut) {
         return [];
       }
-      if (BigInt(Math.floor(ctx.rng.next() * 10_000)) >= config.sellProbabilityBps) {
+      if (true) {
         return [];
       }
killedBy: createRetailActors sells on reaching takeProfitX when the probability roll succeeds
statusReason: expected [] to deeply equal [ { actorId: 'retail-0', …(5) } ]

[Killed] EqualityOperator
src/actors/retail.ts:52:11
       if (!tookProfit && !stoppedOut) {
         return [];
       }
-      if (BigInt(Math.floor(ctx.rng.next() * 10_000)) >= config.sellProbabilityBps) {
+      if (BigInt(Math.floor(ctx.rng.next() * 10_000)) > config.sellProbabilityBps) {
         return [];
       }
killedBy: createRetailActors does not sell exactly at the probability boundary (roll >= threshold)
statusReason: expected [ { actorId: 'retail-0', …(5) } ] to deeply equal []

[Killed] ArrayDeclaration
src/actors/retail.ts:55:14
       if (BigInt(Math.floor(ctx.rng.next() * 10_000)) >= config.sellProbabilityBps) {
         return [];
       }
-      return [
-        {
-          actorId: id,
-          group: "retail",
-          side: "sell",
-          priorityFee: 0n,
-          reason: tookProfit ? "retail exit: take profit" : "retail exit: stop loss",
-          sell: { baseIn: ctx.wallet.baseBalance, minQuoteOut: 0n },
-        },
-      ];
+      return [];
     },
   };
killedBy: createRetailActors sells on reaching takeProfitX when the probability roll succeeds
statusReason: expected [] to deeply equal [ { actorId: 'retail-0', …(5) } ]

[Killed] ObjectLiteral
src/actors/retail.ts:62:17
           side: "sell",
           priorityFee: 0n,
           reason: tookProfit ? "retail exit: take profit" : "retail exit: stop loss",
-          sell: { baseIn: ctx.wallet.baseBalance, minQuoteOut: 0n },
+          sell: {},
         },
       ];
killedBy: createRetailActors sells on reaching takeProfitX when the probability roll succeeds
statusReason: expected [ { actorId: 'retail-0', …(5) } ] to deeply equal [ { actorId: 'retail-0', …(5) } ]

[Killed] BlockStatement
src/actors/retail.ts:86:21
   duration: number,
   monitorStep: number,
   rng: Rng,
-): ScheduledActor[] {
-  const scheduled: ScheduledActor[] = [];
-  for (let i = 0; i < count; i++) {
-    const id = `retail-${String(i)}`;
-    const instanceRng = rng.fork(id);
-    const spend = sampleAmountRange(instanceRng, config.spendMin, config.spendMax);
-    const arrivalSlot = instanceRng.nextInt(config.overSlots + 1);
-    scheduled.push({
-      actor: createRetailActor(id, config, spend, arrivalSlot),
-      slots: monitoringSlots(arrivalSlot, duration, monitorStep),
-    });
-  }
-  return scheduled;
-}
+): ScheduledActor[] {}
 
killedBy: createRetailActors creates `count` distinct scheduled actors with distinct ids
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] EqualityOperator
src/actors/retail.ts:88:19
   rng: Rng,
 ): ScheduledActor[] {
   const scheduled: ScheduledActor[] = [];
-  for (let i = 0; i < count; i++) {
+  for (let i = 0; i >= count; i++) {
     const id = `retail-${String(i)}`;
     const instanceRng = rng.fork(id);
killedBy: createRetailActors creates `count` distinct scheduled actors with distinct ids
statusReason: expected [] to deeply equal [ 'retail-0', 'retail-1', 'retail-2' ]

[Killed] EqualityOperator
src/actors/retail.ts:88:19
   rng: Rng,
 ): ScheduledActor[] {
   const scheduled: ScheduledActor[] = [];
-  for (let i = 0; i < count; i++) {
+  for (let i = 0; i <= count; i++) {
     const id = `retail-${String(i)}`;
     const instanceRng = rng.fork(id);
killedBy: createRetailActors creates `count` distinct scheduled actors with distinct ids
statusReason: expected [ 'retail-0', 'retail-1', …(2) ] to deeply equal [ 'retail-0', 'retail-1', 'retail-2' ]

[Killed] StringLiteral
src/actors/retail.ts:89:16
 ): ScheduledActor[] {
   const scheduled: ScheduledActor[] = [];
   for (let i = 0; i < count; i++) {
-    const id = `retail-${String(i)}`;
+    const id = ``;
     const instanceRng = rng.fork(id);
     const spend = sampleAmountRange(instanceRng, config.spendMin, config.spendMax);
killedBy: createRetailActors creates `count` distinct scheduled actors with distinct ids
statusReason: expected [ '', '', '' ] to deeply equal [ 'retail-0', 'retail-1', 'retail-2' ]

[Killed] ArithmeticOperator
src/actors/retail.ts:92:45
     const id = `retail-${String(i)}`;
     const instanceRng = rng.fork(id);
     const spend = sampleAmountRange(instanceRng, config.spendMin, config.spendMax);
-    const arrivalSlot = instanceRng.nextInt(config.overSlots + 1);
+    const arrivalSlot = instanceRng.nextInt(config.overSlots - 1);
     scheduled.push({
       actor: createRetailActor(id, config, spend, arrivalSlot),
killedBy: createRetailActors buys once at the arrival slot
statusReason: Rng.nextInt: maxExclusive must be positive
