[Killed] BlockStatement
src/actors/sample-amount-range.ts:12:79
  *
  * @throws {RangeError} If `max < min`, or `max - min` exceeds `Number.MAX_SAFE_INTEGER`.
  */
-export function sampleAmountRange(rng: Rng, min: bigint, max: bigint): bigint {
-  if (max < min) {
-    throw new RangeError("sampleAmountRange: max must be at or above min");
-  }
-  const width = max - min;
-  if (width === 0n) {
-    return min;
-  }
-  if (width > BigInt(Number.MAX_SAFE_INTEGER)) {
-    throw new RangeError("sampleAmountRange: range exceeds Number.MAX_SAFE_INTEGER");
-  }
-  return min + BigInt(rng.nextInt(Number(width) + 1));
-}
+export function sampleAmountRange(rng: Rng, min: bigint, max: bigint): bigint {}
 
killedBy: createPanicSellerActors creates `count` distinct actors, each pre-funded with sampled holdings
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ConditionalExpression
src/actors/sample-amount-range.ts:13:7
  * @throws {RangeError} If `max < min`, or `max - min` exceeds `Number.MAX_SAFE_INTEGER`.
  */
 export function sampleAmountRange(rng: Rng, min: bigint, max: bigint): bigint {
-  if (max < min) {
+  if (false) {
     throw new RangeError("sampleAmountRange: max must be at or above min");
   }
killedBy: sampleAmountRange throws when max is less than min
statusReason: expected [Function] to throw error matching /max must be/ but got 'Rng.nextInt: maxExclusive must be pos…'

[Killed] ConditionalExpression
src/actors/sample-amount-range.ts:13:7
  * @throws {RangeError} If `max < min`, or `max - min` exceeds `Number.MAX_SAFE_INTEGER`.
  */
 export function sampleAmountRange(rng: Rng, min: bigint, max: bigint): bigint {
-  if (max < min) {
+  if (true) {
     throw new RangeError("sampleAmountRange: max must be at or above min");
   }
killedBy: createRetailActors creates `count` distinct scheduled actors with distinct ids
statusReason: sampleAmountRange: max must be at or above min

[Killed] ArithmeticOperator
src/actors/sample-amount-range.ts:16:17
   if (max < min) {
     throw new RangeError("sampleAmountRange: max must be at or above min");
   }
-  const width = max - min;
+  const width = max + min;
   if (width === 0n) {
     return min;
killedBy: createPanicSellerActors creates `count` distinct actors, each pre-funded with sampled holdings
statusReason: expected 10740 to be less than or equal to 10000

[Killed] EqualityOperator
src/actors/sample-amount-range.ts:17:7
     throw new RangeError("sampleAmountRange: max must be at or above min");
   }
   const width = max - min;
-  if (width === 0n) {
+  if (width !== 0n) {
     return min;
   }
killedBy: sampleAmountRange throws when the range exceeds Number.MAX_SAFE_INTEGER
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/actors/sample-amount-range.ts:17:7
     throw new RangeError("sampleAmountRange: max must be at or above min");
   }
   const width = max - min;
-  if (width === 0n) {
+  if (true) {
     return min;
   }
killedBy: sampleAmountRange throws when the range exceeds Number.MAX_SAFE_INTEGER
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/actors/sample-amount-range.ts:20:7
   if (width === 0n) {
     return min;
   }
-  if (width > BigInt(Number.MAX_SAFE_INTEGER)) {
+  if (true) {
     throw new RangeError("sampleAmountRange: range exceeds Number.MAX_SAFE_INTEGER");
   }
killedBy: createRetailActors creates `count` distinct scheduled actors with distinct ids
statusReason: sampleAmountRange: range exceeds Number.MAX_SAFE_INTEGER

[Killed] EqualityOperator
src/actors/sample-amount-range.ts:20:7
   if (width === 0n) {
     return min;
   }
-  if (width > BigInt(Number.MAX_SAFE_INTEGER)) {
+  if (width <= BigInt(Number.MAX_SAFE_INTEGER)) {
     throw new RangeError("sampleAmountRange: range exceeds Number.MAX_SAFE_INTEGER");
   }
killedBy: createPanicSellerActors creates `count` distinct actors, each pre-funded with sampled holdings
statusReason: sampleAmountRange: range exceeds Number.MAX_SAFE_INTEGER

[Killed] ArithmeticOperator
src/actors/sample-amount-range.ts:23:10
   if (width > BigInt(Number.MAX_SAFE_INTEGER)) {
     throw new RangeError("sampleAmountRange: range exceeds Number.MAX_SAFE_INTEGER");
   }
-  return min + BigInt(rng.nextInt(Number(width) + 1));
+  return min - BigInt(rng.nextInt(Number(width) + 1));
 }
 
killedBy: sampleAmountRange returns a value within [min, max]
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/actors/sample-amount-range.ts:23:35
   if (width > BigInt(Number.MAX_SAFE_INTEGER)) {
     throw new RangeError("sampleAmountRange: range exceeds Number.MAX_SAFE_INTEGER");
   }
-  return min + BigInt(rng.nextInt(Number(width) + 1));
+  return min + BigInt(rng.nextInt(Number(width) - 1));
 }
 
