[Killed] ArithmeticOperator
src/actors/sniper.ts:19:20
 }
 
 function createSniperActor(id: string, config: SniperConfig, spend: bigint): Actor {
-  const exitSlot = config.at + config.holdSlots;
+  const exitSlot = config.at - config.holdSlots;
   return {
     id,
killedBy: createSniperActors does nothing while holding, before the target or holdSlots
statusReason: expected [ { actorId: 'sniper-0', …(5) } ] to deeply equal []

[Killed] ConditionalExpression
src/actors/sniper.ts:24:11
     id,
     group: "sniper",
     decide(ctx: ActorContext): readonly Order[] {
-      if (ctx.slot === config.at && ctx.wallet.baseBalance === 0n) {
+      if (false) {
         return [
           {
killedBy: createSniperActors buys with the configured priority fee at the entry slot
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/actors/sniper.ts:24:37
     id,
     group: "sniper",
     decide(ctx: ActorContext): readonly Order[] {
-      if (ctx.slot === config.at && ctx.wallet.baseBalance === 0n) {
+      if (ctx.slot === config.at && ctx.wallet.baseBalance !== 0n) {
         return [
           {
killedBy: createSniperActors buys with the configured priority fee at the entry slot
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/actors/sniper.ts:36:11
           },
         ];
       }
-      if (ctx.wallet.baseBalance === 0n || !ctx.wallet.entryPrice) {
+      if (false) {
         return [];
       }
killedBy: createSniperActors does nothing when holding base but somehow has no entry price recorded
statusReason: Cannot read properties of null (reading 'den')

[Killed] BlockStatement
src/actors/sniper.ts:36:68
           },
         ];
       }
-      if (ctx.wallet.baseBalance === 0n || !ctx.wallet.entryPrice) {
-        return [];
-      }
+      if (ctx.wallet.baseBalance === 0n || !ctx.wallet.entryPrice) {}
       if (hasReachedMultiple(ctx.market.price, ctx.wallet.entryPrice, config.sellAtX)) {
         return [
killedBy: createSniperActors does nothing when holding base but somehow has no entry price recorded
statusReason: Cannot read properties of null (reading 'den')

[Killed] BlockStatement
src/actors/sniper.ts:39:88
       if (ctx.wallet.baseBalance === 0n || !ctx.wallet.entryPrice) {
         return [];
       }
-      if (hasReachedMultiple(ctx.market.price, ctx.wallet.entryPrice, config.sellAtX)) {
-        return [
-          {
-            actorId: id,
-            group: "sniper",
-            side: "sell",
-            priorityFee: config.priorityFee,
-            reason: `sniper exit: ${String(config.sellAtX)}x target`,
-            sell: { baseIn: ctx.wallet.baseBalance, minQuoteOut: 0n },
-          },
-        ];
-      }
+      if (hasReachedMultiple(ctx.market.price, ctx.wallet.entryPrice, config.sellAtX)) {}
       if (ctx.slot >= exitSlot) {
         return [
killedBy: createSniperActors sells early once the price reaches sellAtX, before holdSlots
statusReason: expected [] to deeply equal [ { actorId: 'sniper-0', …(5) } ]

[Killed] ConditionalExpression
src/actors/sniper.ts:39:11
       if (ctx.wallet.baseBalance === 0n || !ctx.wallet.entryPrice) {
         return [];
       }
-      if (hasReachedMultiple(ctx.market.price, ctx.wallet.entryPrice, config.sellAtX)) {
+      if (true) {
         return [
           {
killedBy: createSniperActors force-sells at holdSlots even without reaching the price target
statusReason: expected [ { actorId: 'sniper-0', …(5) } ] to deeply equal [ { actorId: 'sniper-0', …(5) } ]

[Killed] ObjectLiteral
src/actors/sniper.ts:41:11
       }
       if (hasReachedMultiple(ctx.market.price, ctx.wallet.entryPrice, config.sellAtX)) {
         return [
-          {
-            actorId: id,
-            group: "sniper",
-            side: "sell",
-            priorityFee: config.priorityFee,
-            reason: `sniper exit: ${String(config.sellAtX)}x target`,
-            sell: { baseIn: ctx.wallet.baseBalance, minQuoteOut: 0n },
-          },
+          {},
         ];
       }
killedBy: createSniperActors sells early once the price reaches sellAtX, before holdSlots
statusReason: expected [ {} ] to deeply equal [ { actorId: 'sniper-0', …(5) } ]

[Killed] StringLiteral
src/actors/sniper.ts:46:21
             group: "sniper",
             side: "sell",
             priorityFee: config.priorityFee,
-            reason: `sniper exit: ${String(config.sellAtX)}x target`,
+            reason: ``,
             sell: { baseIn: ctx.wallet.baseBalance, minQuoteOut: 0n },
           },
killedBy: createSniperActors sells early once the price reaches sellAtX, before holdSlots
statusReason: expected [ { actorId: 'sniper-0', …(5) } ] to deeply equal [ { actorId: 'sniper-0', …(5) } ]

[Killed] ConditionalExpression
src/actors/sniper.ts:51:11
           },
         ];
       }
-      if (ctx.slot >= exitSlot) {
+      if (true) {
         return [
           {
killedBy: createSniperActors does nothing while holding, before the target or holdSlots
statusReason: expected [ { actorId: 'sniper-0', …(5) } ] to deeply equal []

[Killed] EqualityOperator
src/actors/sniper.ts:51:11
           },
         ];
       }
-      if (ctx.slot >= exitSlot) {
+      if (ctx.slot < exitSlot) {
         return [
           {
killedBy: createSniperActors force-sells at holdSlots even without reaching the price target
statusReason: expected [] to deeply equal [ { actorId: 'sniper-0', …(5) } ]

[Killed] ArrayDeclaration
src/actors/sniper.ts:52:16
         ];
       }
       if (ctx.slot >= exitSlot) {
-        return [
-          {
-            actorId: id,
-            group: "sniper",
-            side: "sell",
-            priorityFee: config.priorityFee,
-            reason: "sniper exit: holdSlots elapsed",
-            sell: { baseIn: ctx.wallet.baseBalance, minQuoteOut: 0n },
-          },
-        ];
+        return [];
       }
       return [];
killedBy: createSniperActors force-sells at holdSlots even without reaching the price target
statusReason: expected [] to deeply equal [ { actorId: 'sniper-0', …(5) } ]

[Killed] ObjectLiteral
src/actors/sniper.ts:53:11
       }
       if (ctx.slot >= exitSlot) {
         return [
-          {
-            actorId: id,
-            group: "sniper",
-            side: "sell",
-            priorityFee: config.priorityFee,
-            reason: "sniper exit: holdSlots elapsed",
-            sell: { baseIn: ctx.wallet.baseBalance, minQuoteOut: 0n },
-          },
+          {},
         ];
       }
killedBy: createSniperActors force-sells at holdSlots even without reaching the price target
statusReason: expected [ {} ] to deeply equal [ { actorId: 'sniper-0', …(5) } ]

[Killed] BlockStatement
src/actors/sniper.ts:83:21
   count: number,
   duration: number,
   rng: Rng,
-): ScheduledActor[] {
-  const scheduled: ScheduledActor[] = [];
-  for (let i = 0; i < count; i++) {
-    const id = `sniper-${String(i)}`;
-    const spend = sampleAmountRange(rng.fork(id), config.spendMin, config.spendMax);
-    const exitSlot = Math.min(config.at + config.holdSlots, duration);
-    scheduled.push({
-      actor: createSniperActor(id, config, spend),
-      slots: monitoringSlots(config.at, exitSlot, 1),
-    });
-  }
-  return scheduled;
-}
+): ScheduledActor[] {}
 
killedBy: createSniperActors creates `count` distinct scheduled actors with distinct ids
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] StringLiteral
src/actors/sniper.ts:86:16
 ): ScheduledActor[] {
   const scheduled: ScheduledActor[] = [];
   for (let i = 0; i < count; i++) {
-    const id = `sniper-${String(i)}`;
+    const id = ``;
     const spend = sampleAmountRange(rng.fork(id), config.spendMin, config.spendMax);
     const exitSlot = Math.min(config.at + config.holdSlots, duration);
killedBy: createSniperActors creates `count` distinct scheduled actors with distinct ids
statusReason: expected [ '', '', '' ] to deeply equal [ 'sniper-0', 'sniper-1', 'sniper-2' ]

[Killed] MethodExpression
src/actors/sniper.ts:88:22
   for (let i = 0; i < count; i++) {
     const id = `sniper-${String(i)}`;
     const spend = sampleAmountRange(rng.fork(id), config.spendMin, config.spendMax);
-    const exitSlot = Math.min(config.at + config.holdSlots, duration);
+    const exitSlot = Math.max(config.at + config.holdSlots, duration);
     scheduled.push({
       actor: createSniperActor(id, config, spend),
killedBy: createSniperActors schedules each actor at the entry slot and every slot through holdSlots
statusReason: expected 1000 to be 150 // Object.is equality

[Killed] ArithmeticOperator
src/actors/sniper.ts:88:31
   for (let i = 0; i < count; i++) {
     const id = `sniper-${String(i)}`;
     const spend = sampleAmountRange(rng.fork(id), config.spendMin, config.spendMax);
-    const exitSlot = Math.min(config.at + config.holdSlots, duration);
+    const exitSlot = Math.min(config.at - config.holdSlots, duration);
     scheduled.push({
       actor: createSniperActor(id, config, spend),
killedBy: createSniperActors creates `count` distinct scheduled actors with distinct ids
statusReason: monitoringSlots: end must be at or after start
