[Killed] ConditionalExpression
src/actors/whale.ts:32:11
     id,
     group: "whale",
     decide(ctx: ActorContext): readonly Order[] {
-      if (ctx.slot === config.at && ctx.wallet.baseBalance === 0n) {
+      if (true) {
         return [
           {
killedBy: createWhaleActor does nothing before the entry slot
statusReason: expected [ { actorId: 'whale-0', …(5) } ] to deeply equal []

[Killed] ConditionalExpression
src/actors/whale.ts:32:11
     id,
     group: "whale",
     decide(ctx: ActorContext): readonly Order[] {
-      if (ctx.slot === config.at && ctx.wallet.baseBalance === 0n) {
+      if (true && ctx.wallet.baseBalance === 0n) {
         return [
           {
killedBy: createWhaleActor does nothing before the entry slot
statusReason: expected [ { actorId: 'whale-0', …(5) } ] to deeply equal []

[Killed] StringLiteral
src/actors/whale.ts:36:20
         return [
           {
             actorId: id,
-            group: "whale",
+            group: "",
             side: "buy",
             priorityFee: 0n,
killedBy: createWhaleActor buys the full spend at the entry slot
statusReason: expected [ { actorId: 'whale-0', …(5) } ] to deeply equal [ { actorId: 'whale-0', …(5) } ]

[Killed] StringLiteral
src/actors/whale.ts:37:19
           {
             actorId: id,
             group: "whale",
-            side: "buy",
+            side: "",
             priorityFee: 0n,
             reason: "whale entry",
killedBy: createWhaleActor buys the full spend at the entry slot
statusReason: expected [ { actorId: 'whale-0', …(5) } ] to deeply equal [ { actorId: 'whale-0', …(5) } ]

[Killed] StringLiteral
src/actors/whale.ts:39:21
             group: "whale",
             side: "buy",
             priorityFee: 0n,
-            reason: "whale entry",
+            reason: "",
             buy: { quoteIn: config.spend, minBaseOut: 0n },
           },
killedBy: createWhaleActor buys the full spend at the entry slot
statusReason: expected [ { actorId: 'whale-0', …(5) } ] to deeply equal [ { actorId: 'whale-0', …(5) } ]

[Killed] ConditionalExpression
src/actors/whale.ts:45:9
         ];
       }
       if (
-        ctx.wallet.baseBalance > 0n &&
-        ctx.wallet.entryPrice &&
-        hasReachedMultiple(ctx.market.price, ctx.wallet.entryPrice, config.sellAtX)
+        false
       ) {
         return [
killedBy: createWhaleActor sells everything once the price reaches sellAtX times the entry price
statusReason: expected [] to deeply equal [ { actorId: 'whale-0', …(5) } ]

[Killed] ConditionalExpression
src/actors/whale.ts:45:9
         ];
       }
       if (
-        ctx.wallet.baseBalance > 0n &&
-        ctx.wallet.entryPrice &&
-        hasReachedMultiple(ctx.market.price, ctx.wallet.entryPrice, config.sellAtX)
+        true
       ) {
         return [
killedBy: createWhaleActor does nothing before the entry slot
statusReason: expected [ { actorId: 'whale-0', …(5) } ] to deeply equal []

[Killed] BlockStatement
src/actors/whale.ts:48:9
         ctx.wallet.baseBalance > 0n &&
         ctx.wallet.entryPrice &&
         hasReachedMultiple(ctx.market.price, ctx.wallet.entryPrice, config.sellAtX)
-      ) {
-        return [
-          {
-            actorId: id,
-            group: "whale",
-            side: "sell",
-            priorityFee: 0n,
-            reason: `whale exit: ${String(config.sellAtX)}x target`,
-            sell: { baseIn: ctx.wallet.baseBalance, minQuoteOut: 0n },
-          },
-        ];
-      }
+      ) {}
       return [];
     },
killedBy: createWhaleActor sells everything once the price reaches sellAtX times the entry price
statusReason: expected [] to deeply equal [ { actorId: 'whale-0', …(5) } ]

[Killed] ObjectLiteral
src/actors/whale.ts:50:11
         hasReachedMultiple(ctx.market.price, ctx.wallet.entryPrice, config.sellAtX)
       ) {
         return [
-          {
-            actorId: id,
-            group: "whale",
-            side: "sell",
-            priorityFee: 0n,
-            reason: `whale exit: ${String(config.sellAtX)}x target`,
-            sell: { baseIn: ctx.wallet.baseBalance, minQuoteOut: 0n },
-          },
+          {},
         ];
       }
killedBy: createWhaleActor sells everything once the price reaches sellAtX times the entry price
statusReason: expected [ {} ] to deeply equal [ { actorId: 'whale-0', …(5) } ]

[Killed] StringLiteral
src/actors/whale.ts:53:19
           {
             actorId: id,
             group: "whale",
-            side: "sell",
+            side: "",
             priorityFee: 0n,
             reason: `whale exit: ${String(config.sellAtX)}x target`,
killedBy: createWhaleActor sells everything once the price reaches sellAtX times the entry price
statusReason: expected [ { actorId: 'whale-0', …(5) } ] to deeply equal [ { actorId: 'whale-0', …(5) } ]
