[Killed] BlockStatement
src/checks/group-supply-share-below.ts:20:42
     evaluate(ledger: Ledger): CheckResult {
       let groupBase = 0n;
       let totalBase = 0n;
-      for (const trade of ledger.trades) {
-        if (!trade.ok || trade.slot > at) {
-          continue;
-        }
-        const delta = trade.side === "buy" ? trade.base : -trade.base;
-        totalBase += delta;
-        if (trade.group === group) {
-          groupBase += delta;
-        }
-      }
+      for (const trade of ledger.trades) {}
       const passed = totalBase <= 0n || groupBase * 10_000n < bps * totalBase;
       const observedBps = totalBase <= 0n ? 0n : (groupBase * 10_000n) / totalBase;
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected '0' to be '500' // Object.is equality

[Killed] ConditionalExpression
src/checks/group-supply-share-below.ts:21:13
       let groupBase = 0n;
       let totalBase = 0n;
       for (const trade of ledger.trades) {
-        if (!trade.ok || trade.slot > at) {
+        if (true) {
           continue;
         }
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected '0' to be '500' // Object.is equality

[Killed] LogicalOperator
src/checks/group-supply-share-below.ts:21:13
       let groupBase = 0n;
       let totalBase = 0n;
       for (const trade of ledger.trades) {
-        if (!trade.ok || trade.slot > at) {
+        if (!trade.ok && trade.slot > at) {
           continue;
         }
killedBy: createGroupSupplyShareBelowCheck excludes trades after the `at` slot even when they would flip the result
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/checks/group-supply-share-below.ts:24:23
         if (!trade.ok || trade.slot > at) {
           continue;
         }
-        const delta = trade.side === "buy" ? trade.base : -trade.base;
+        const delta = trade.side !== "buy" ? trade.base : -trade.base;
         totalBase += delta;
         if (trade.group === group) {
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected '0' to be '500' // Object.is equality

[Killed] ConditionalExpression
src/checks/group-supply-share-below.ts:24:23
         if (!trade.ok || trade.slot > at) {
           continue;
         }
-        const delta = trade.side === "buy" ? trade.base : -trade.base;
+        const delta = false ? trade.base : -trade.base;
         totalBase += delta;
         if (trade.group === group) {
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected '0' to be '500' // Object.is equality

[Killed] AssignmentOperator
src/checks/group-supply-share-below.ts:25:9
           continue;
         }
         const delta = trade.side === "buy" ? trade.base : -trade.base;
-        totalBase += delta;
+        totalBase -= delta;
         if (trade.group === group) {
           groupBase += delta;
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected '0' to be '500' // Object.is equality

[Killed] EqualityOperator
src/checks/group-supply-share-below.ts:26:13
         }
         const delta = trade.side === "buy" ? trade.base : -trade.base;
         totalBase += delta;
-        if (trade.group === group) {
+        if (trade.group !== group) {
           groupBase += delta;
         }
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/checks/group-supply-share-below.ts:26:36
         }
         const delta = trade.side === "buy" ? trade.base : -trade.base;
         totalBase += delta;
-        if (trade.group === group) {
-          groupBase += delta;
-        }
+        if (trade.group === group) {}
       }
       const passed = totalBase <= 0n || groupBase * 10_000n < bps * totalBase;
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected '0' to be '500' // Object.is equality

[Killed] AssignmentOperator
src/checks/group-supply-share-below.ts:27:11
         const delta = trade.side === "buy" ? trade.base : -trade.base;
         totalBase += delta;
         if (trade.group === group) {
-          groupBase += delta;
+          groupBase -= delta;
         }
       }
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected '-500' to be '500' // Object.is equality

[Killed] ConditionalExpression
src/checks/group-supply-share-below.ts:30:22
           groupBase += delta;
         }
       }
-      const passed = totalBase <= 0n || groupBase * 10_000n < bps * totalBase;
+      const passed = false;
       const observedBps = totalBase <= 0n ? 0n : (groupBase * 10_000n) / totalBase;
       return {
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/checks/group-supply-share-below.ts:30:22
           groupBase += delta;
         }
       }
-      const passed = totalBase <= 0n || groupBase * 10_000n < bps * totalBase;
+      const passed = false || groupBase * 10_000n < bps * totalBase;
       const observedBps = totalBase <= 0n ? 0n : (groupBase * 10_000n) / totalBase;
       return {
killedBy: createGroupSupplyShareBelowCheck passes vacuously when no circulating supply exists yet at `at`
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/checks/group-supply-share-below.ts:31:27
         }
       }
       const passed = totalBase <= 0n || groupBase * 10_000n < bps * totalBase;
-      const observedBps = totalBase <= 0n ? 0n : (groupBase * 10_000n) / totalBase;
+      const observedBps = totalBase < 0n ? 0n : (groupBase * 10_000n) / totalBase;
       return {
         id: "groupSupplyShareBelow",
killedBy: createGroupSupplyShareBelowCheck passes vacuously when no circulating supply exists yet at `at`
statusReason: Division by zero

[Killed] ArithmeticOperator
src/checks/group-supply-share-below.ts:31:51
         }
       }
       const passed = totalBase <= 0n || groupBase * 10_000n < bps * totalBase;
-      const observedBps = totalBase <= 0n ? 0n : (groupBase * 10_000n) / totalBase;
+      const observedBps = totalBase <= 0n ? 0n : (groupBase / 10_000n) / totalBase;
       return {
         id: "groupSupplyShareBelow",
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected '0' to be '500' // Object.is equality

[Killed] StringLiteral
src/checks/group-supply-share-below.ts:34:15
       const observedBps = totalBase <= 0n ? 0n : (groupBase * 10_000n) / totalBase;
       return {
         id: "groupSupplyShareBelow",
-        kind: "groupSupplyShareBelow",
+        kind: "",
         passed,
         summary: passed
killedBy: createGroupSupplyShareBelowCheck reports its id and kind
statusReason: expected '' to be 'groupSupplyShareBelow' // Object.is equality

[Killed] ArithmeticOperator
src/checks/group-supply-share-below.ts:37:111
         kind: "groupSupplyShareBelow",
         passed,
         summary: passed
-          ? `${group} held ${String(observedBps / 100n)}% of supply at slot ${String(at)}, below the ${String(bps / 100n)}% limit`
+          ? `${group} held ${String(observedBps / 100n)}% of supply at slot ${String(at)}, below the ${String(bps * 100n)}% limit`
           : `${group} held ${String(observedBps / 100n)}% of supply at slot ${String(at)}, at or above the ${String(bps / 100n)}% limit`,
         observed: observedBps.toString(),
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected 'sniper held 5% of supply at slot 100,…' to be 'sniper held 5% of supply at slot 100,…' // Object.is equality

[Killed] ArithmeticOperator
src/checks/group-supply-share-below.ts:37:37
         kind: "groupSupplyShareBelow",
         passed,
         summary: passed
-          ? `${group} held ${String(observedBps / 100n)}% of supply at slot ${String(at)}, below the ${String(bps / 100n)}% limit`
+          ? `${group} held ${String(observedBps * 100n)}% of supply at slot ${String(at)}, below the ${String(bps / 100n)}% limit`
           : `${group} held ${String(observedBps / 100n)}% of supply at slot ${String(at)}, at or above the ${String(bps / 100n)}% limit`,
         observed: observedBps.toString(),
killedBy: createGroupSupplyShareBelowCheck passes when the group's share of circulating supply is below the threshold
statusReason: expected 'sniper held 50000% of supply at slot …' to be 'sniper held 5% of supply at slot 100,…' // Object.is equality

[Killed] ArithmeticOperator
src/checks/group-supply-share-below.ts:38:117
         passed,
         summary: passed
           ? `${group} held ${String(observedBps / 100n)}% of supply at slot ${String(at)}, below the ${String(bps / 100n)}% limit`
-          : `${group} held ${String(observedBps / 100n)}% of supply at slot ${String(at)}, at or above the ${String(bps / 100n)}% limit`,
+          : `${group} held ${String(observedBps / 100n)}% of supply at slot ${String(at)}, at or above the ${String(bps * 100n)}% limit`,
         observed: observedBps.toString(),
         threshold: bps.toString(),
killedBy: createGroupSupplyShareBelowCheck fails when the group's share is exactly at the threshold (below is strict)
statusReason: expected 'sniper held 10% of supply at slot 100…' to be 'sniper held 10% of supply at slot 100…' // Object.is equality

[Killed] ArithmeticOperator
src/checks/group-supply-share-below.ts:38:37
         passed,
         summary: passed
           ? `${group} held ${String(observedBps / 100n)}% of supply at slot ${String(at)}, below the ${String(bps / 100n)}% limit`
-          : `${group} held ${String(observedBps / 100n)}% of supply at slot ${String(at)}, at or above the ${String(bps / 100n)}% limit`,
+          : `${group} held ${String(observedBps * 100n)}% of supply at slot ${String(at)}, at or above the ${String(bps / 100n)}% limit`,
         observed: observedBps.toString(),
         threshold: bps.toString(),
killedBy: createGroupSupplyShareBelowCheck fails when the group's share is exactly at the threshold (below is strict)
statusReason: expected 'sniper held 100000% of supply at slot…' to be 'sniper held 10% of supply at slot 100…' // Object.is equality
