[Killed] StringLiteral
src/checks/max-drawdown-below.ts:17:9
  */
 export function createMaxDrawdownBelowCheck(bps: bigint, window: number): Check {
   return {
-    id: "maxDrawdownBelow",
+    id: "",
     evaluate(ledger: Ledger): CheckResult {
       const { samples } = ledger.timeline;
killedBy: createMaxDrawdownBelowCheck reports its id and kind
statusReason: expected '' to be 'maxDrawdownBelow' // Object.is equality

[Killed] EqualityOperator
src/checks/max-drawdown-below.ts:23:23
       let worstDropBps = 0n;
       let worstSlot: number | null = null;
 
-      for (let i = 0; i < samples.length; i++) {
+      for (let i = 0; i >= samples.length; i++) {
         const peak = samples[i];
         if (!peak || peak.quoteReserve <= 0n) {
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '0' to be '1500' // Object.is equality

[Killed] ConditionalExpression
src/checks/max-drawdown-below.ts:23:23
       let worstDropBps = 0n;
       let worstSlot: number | null = null;
 
-      for (let i = 0; i < samples.length; i++) {
+      for (let i = 0; false; i++) {
         const peak = samples[i];
         if (!peak || peak.quoteReserve <= 0n) {
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '0' to be '1500' // Object.is equality

[Killed] LogicalOperator
src/checks/max-drawdown-below.ts:25:13
 
       for (let i = 0; i < samples.length; i++) {
         const peak = samples[i];
-        if (!peak || peak.quoteReserve <= 0n) {
+        if (!peak && peak.quoteReserve <= 0n) {
           continue;
         }
killedBy: createMaxDrawdownBelowCheck does not divide by zero when a zero-reserve peak is skipped against a negative trough
statusReason: Division by zero

[Killed] ConditionalExpression
src/checks/max-drawdown-below.ts:25:13
 
       for (let i = 0; i < samples.length; i++) {
         const peak = samples[i];
-        if (!peak || peak.quoteReserve <= 0n) {
+        if (true) {
           continue;
         }
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '0' to be '1500' // Object.is equality

[Killed] EqualityOperator
src/checks/max-drawdown-below.ts:28:29
         if (!peak || peak.quoteReserve <= 0n) {
           continue;
         }
-        for (let j = i + 1; j < samples.length; j++) {
+        for (let j = i + 1; j >= samples.length; j++) {
           const trough = samples[j];
           if (!trough || trough.slot - peak.slot > window) {
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '0' to be '1500' // Object.is equality

[Killed] ArithmeticOperator
src/checks/max-drawdown-below.ts:28:22
         if (!peak || peak.quoteReserve <= 0n) {
           continue;
         }
-        for (let j = i + 1; j < samples.length; j++) {
+        for (let j = i - 1; j < samples.length; j++) {
           const trough = samples[j];
           if (!trough || trough.slot - peak.slot > window) {
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '556' to be '1500' // Object.is equality

[Killed] EqualityOperator
src/checks/max-drawdown-below.ts:30:26
         }
         for (let j = i + 1; j < samples.length; j++) {
           const trough = samples[j];
-          if (!trough || trough.slot - peak.slot > window) {
+          if (!trough || trough.slot - peak.slot >= window) {
             break;
           }
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '1000' to be '1500' // Object.is equality

[Killed] EqualityOperator
src/checks/max-drawdown-below.ts:30:26
         }
         for (let j = i + 1; j < samples.length; j++) {
           const trough = samples[j];
-          if (!trough || trough.slot - peak.slot > window) {
+          if (!trough || trough.slot - peak.slot <= window) {
             break;
           }
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '0' to be '1500' // Object.is equality

[Killed] ArithmeticOperator
src/checks/max-drawdown-below.ts:33:29
           if (!trough || trough.slot - peak.slot > window) {
             break;
           }
-          const peakCross = trough.quoteReserve * peak.baseReserve;
+          const peakCross = trough.quoteReserve / peak.baseReserve;
           const troughCross = peak.quoteReserve * trough.baseReserve;
           if (peakCross >= troughCross) {
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/checks/max-drawdown-below.ts:34:31
             break;
           }
           const peakCross = trough.quoteReserve * peak.baseReserve;
-          const troughCross = peak.quoteReserve * trough.baseReserve;
+          const troughCross = peak.quoteReserve / trough.baseReserve;
           if (peakCross >= troughCross) {
             continue; // not a drop: trough price is at or above peak price
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '0' to be '1500' // Object.is equality

[Killed] ConditionalExpression
src/checks/max-drawdown-below.ts:35:15
           }
           const peakCross = trough.quoteReserve * peak.baseReserve;
           const troughCross = peak.quoteReserve * trough.baseReserve;
-          if (peakCross >= troughCross) {
+          if (false) {
             continue; // not a drop: trough price is at or above peak price
           }
killedBy: createMaxDrawdownBelowCheck does not divide by zero when a trough sample is fully drained
statusReason: Division by zero

[Killed] EqualityOperator
src/checks/max-drawdown-below.ts:35:15
           }
           const peakCross = trough.quoteReserve * peak.baseReserve;
           const troughCross = peak.quoteReserve * trough.baseReserve;
-          if (peakCross >= troughCross) {
+          if (peakCross < troughCross) {
             continue; // not a drop: trough price is at or above peak price
           }
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '0' to be '1500' // Object.is equality

[Killed] ArithmeticOperator
src/checks/max-drawdown-below.ts:40:29
           }
           // round: pool-favoring -- floors the surviving ratio, so it never
           // understates the drop.
-          const ratioBps = (peakCross * 10_000n) / troughCross;
+          const ratioBps = (peakCross / 10_000n) / troughCross;
           const dropBps = 10_000n - ratioBps;
           if (dropBps > worstDropBps) {
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/checks/max-drawdown-below.ts:40:28
           }
           // round: pool-favoring -- floors the surviving ratio, so it never
           // understates the drop.
-          const ratioBps = (peakCross * 10_000n) / troughCross;
+          const ratioBps = peakCross * 10_000n * troughCross;
           const dropBps = 10_000n - ratioBps;
           if (dropBps > worstDropBps) {
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '0' to be '1500' // Object.is equality

[Killed] ArithmeticOperator
src/checks/max-drawdown-below.ts:41:27
           // round: pool-favoring -- floors the surviving ratio, so it never
           // understates the drop.
           const ratioBps = (peakCross * 10_000n) / troughCross;
-          const dropBps = 10_000n - ratioBps;
+          const dropBps = 10_000n + ratioBps;
           if (dropBps > worstDropBps) {
             worstDropBps = dropBps;
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/checks/max-drawdown-below.ts:42:39
           // understates the drop.
           const ratioBps = (peakCross * 10_000n) / troughCross;
           const dropBps = 10_000n - ratioBps;
-          if (dropBps > worstDropBps) {
-            worstDropBps = dropBps;
-            worstSlot = trough.slot;
-          }
+          if (dropBps > worstDropBps) {}
         }
       }
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '0' to be '1500' // Object.is equality

[Killed] ConditionalExpression
src/checks/max-drawdown-below.ts:42:15
           // understates the drop.
           const ratioBps = (peakCross * 10_000n) / troughCross;
           const dropBps = 10_000n - ratioBps;
-          if (dropBps > worstDropBps) {
+          if (true) {
             worstDropBps = dropBps;
             worstSlot = trough.slot;
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected '556' to be '1500' // Object.is equality

[Killed] EqualityOperator
src/checks/max-drawdown-below.ts:49:22
         }
       }
 
-      const passed = worstDropBps < bps;
+      const passed = worstDropBps <= bps;
       return {
         id: "maxDrawdownBelow",
killedBy: createMaxDrawdownBelowCheck fails when the drawdown exactly equals the threshold (below is strict)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/checks/max-drawdown-below.ts:49:22
         }
       }
 
-      const passed = worstDropBps < bps;
+      const passed = worstDropBps >= bps;
       return {
         id: "maxDrawdownBelow",
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/checks/max-drawdown-below.ts:55:63
         kind: "maxDrawdownBelow",
         passed,
         summary: passed
-          ? `max ${String(window)}-slot drawdown was ${String(worstDropBps / 100n)}%, below the ${String(bps / 100n)}% limit`
+          ? `max ${String(window)}-slot drawdown was ${String(worstDropBps * 100n)}%, below the ${String(bps / 100n)}% limit`
           : `max ${String(window)}-slot drawdown reached ${String(worstDropBps / 100n)}% at slot ${String(worstSlot)}`,
         observed: worstDropBps.toString(),
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected 'max 100-slot drawdown was 150000%, be…' to be 'max 100-slot drawdown was 15%, below …' // Object.is equality

[Killed] ArithmeticOperator
src/checks/max-drawdown-below.ts:55:106
         kind: "maxDrawdownBelow",
         passed,
         summary: passed
-          ? `max ${String(window)}-slot drawdown was ${String(worstDropBps / 100n)}%, below the ${String(bps / 100n)}% limit`
+          ? `max ${String(window)}-slot drawdown was ${String(worstDropBps / 100n)}%, below the ${String(bps * 100n)}% limit`
           : `max ${String(window)}-slot drawdown reached ${String(worstDropBps / 100n)}% at slot ${String(worstSlot)}`,
         observed: worstDropBps.toString(),
killedBy: createMaxDrawdownBelowCheck passes when no window's price drop reaches the threshold
statusReason: expected 'max 100-slot drawdown was 15%, below …' to be 'max 100-slot drawdown was 15%, below …' // Object.is equality

[Killed] ArithmeticOperator
src/checks/max-drawdown-below.ts:56:67
         passed,
         summary: passed
           ? `max ${String(window)}-slot drawdown was ${String(worstDropBps / 100n)}%, below the ${String(bps / 100n)}% limit`
-          : `max ${String(window)}-slot drawdown reached ${String(worstDropBps / 100n)}% at slot ${String(worstSlot)}`,
+          : `max ${String(window)}-slot drawdown reached ${String(worstDropBps * 100n)}% at slot ${String(worstSlot)}`,
         observed: worstDropBps.toString(),
         threshold: bps.toString(),
killedBy: createMaxDrawdownBelowCheck fails when some window's price drop reaches the threshold
statusReason: expected 'max 100-slot drawdown reached 600000%…' to be 'max 100-slot drawdown reached 60% at …' // Object.is equality
