[Killed] StringLiteral
src/checks/quote-never-below-pct-of-peak.ts:13:9
  */
 export function createQuoteNeverBelowPctOfPeakCheck(bps: bigint): Check {
   return {
-    id: "quoteNeverBelowPctOfPeak",
+    id: "",
     evaluate(ledger: Ledger): CheckResult {
       let runningPeak = 0n;
killedBy: createQuoteNeverBelowPctOfPeak reports its id and kind
statusReason: expected '' to be 'quoteNeverBelowPctOfPeak' // Object.is equality

[Killed] BlockStatement
src/checks/quote-never-below-pct-of-peak.ts:16:53
     id: "quoteNeverBelowPctOfPeak",
     evaluate(ledger: Ledger): CheckResult {
       let runningPeak = 0n;
-      for (const sample of ledger.timeline.samples) {
-        runningPeak = maxBig(runningPeak, sample.quoteReserve);
-        if (runningPeak > 0n && sample.quoteReserve * 10_000n < bps * runningPeak) {
-          const observedBps = (sample.quoteReserve * 10_000n) / runningPeak;
-          return {
-            id: "quoteNeverBelowPctOfPeak",
-            kind: "quoteNeverBelowPctOfPeak",
-            passed: false,
-            summary: `pool quote fell to ${String(observedBps / 100n)}% of peak at slot ${String(sample.slot)}`,
-            observed: observedBps.toString(),
-            threshold: bps.toString(),
-            atSlot: sample.slot,
-          };
-        }
-      }
+      for (const sample of ledger.timeline.samples) {}
       return {
         id: "quoteNeverBelowPctOfPeak",
killedBy: createQuoteNeverBelowPctOfPeak fails at the first slot the reserve drops below the threshold of its running peak
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/checks/quote-never-below-pct-of-peak.ts:18:33
       let runningPeak = 0n;
       for (const sample of ledger.timeline.samples) {
         runningPeak = maxBig(runningPeak, sample.quoteReserve);
-        if (runningPeak > 0n && sample.quoteReserve * 10_000n < bps * runningPeak) {
+        if (runningPeak > 0n && sample.quoteReserve * 10_000n >= bps * runningPeak) {
           const observedBps = (sample.quoteReserve * 10_000n) / runningPeak;
           return {
killedBy: createQuoteNeverBelowPctOfPeak passes when the quote reserve never drops below the threshold of its running peak
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/checks/quote-never-below-pct-of-peak.ts:18:13
       let runningPeak = 0n;
       for (const sample of ledger.timeline.samples) {
         runningPeak = maxBig(runningPeak, sample.quoteReserve);
-        if (runningPeak > 0n && sample.quoteReserve * 10_000n < bps * runningPeak) {
+        if (false) {
           const observedBps = (sample.quoteReserve * 10_000n) / runningPeak;
           return {
killedBy: createQuoteNeverBelowPctOfPeak fails at the first slot the reserve drops below the threshold of its running peak
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/checks/quote-never-below-pct-of-peak.ts:19:31
       for (const sample of ledger.timeline.samples) {
         runningPeak = maxBig(runningPeak, sample.quoteReserve);
         if (runningPeak > 0n && sample.quoteReserve * 10_000n < bps * runningPeak) {
-          const observedBps = (sample.quoteReserve * 10_000n) / runningPeak;
+          const observedBps = sample.quoteReserve * 10_000n * runningPeak;
           return {
             id: "quoteNeverBelowPctOfPeak",
killedBy: createQuoteNeverBelowPctOfPeak fails at the first slot the reserve drops below the threshold of its running peak
statusReason: expected '4000000000' to be '4000' // Object.is equality

[Killed] ArithmeticOperator
src/checks/quote-never-below-pct-of-peak.ts:19:32
       for (const sample of ledger.timeline.samples) {
         runningPeak = maxBig(runningPeak, sample.quoteReserve);
         if (runningPeak > 0n && sample.quoteReserve * 10_000n < bps * runningPeak) {
-          const observedBps = (sample.quoteReserve * 10_000n) / runningPeak;
+          const observedBps = (sample.quoteReserve / 10_000n) / runningPeak;
           return {
             id: "quoteNeverBelowPctOfPeak",
killedBy: createQuoteNeverBelowPctOfPeak fails at the first slot the reserve drops below the threshold of its running peak
statusReason: expected '0' to be '4000' // Object.is equality

[Killed] ObjectLiteral
src/checks/quote-never-below-pct-of-peak.ts:20:18
         runningPeak = maxBig(runningPeak, sample.quoteReserve);
         if (runningPeak > 0n && sample.quoteReserve * 10_000n < bps * runningPeak) {
           const observedBps = (sample.quoteReserve * 10_000n) / runningPeak;
-          return {
-            id: "quoteNeverBelowPctOfPeak",
-            kind: "quoteNeverBelowPctOfPeak",
-            passed: false,
-            summary: `pool quote fell to ${String(observedBps / 100n)}% of peak at slot ${String(sample.slot)}`,
-            observed: observedBps.toString(),
-            threshold: bps.toString(),
-            atSlot: sample.slot,
-          };
+          return {};
         }
       }
killedBy: createQuoteNeverBelowPctOfPeak fails at the first slot the reserve drops below the threshold of its running peak
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/checks/quote-never-below-pct-of-peak.ts:23:21
           return {
             id: "quoteNeverBelowPctOfPeak",
             kind: "quoteNeverBelowPctOfPeak",
-            passed: false,
+            passed: true,
             summary: `pool quote fell to ${String(observedBps / 100n)}% of peak at slot ${String(sample.slot)}`,
             observed: observedBps.toString(),
killedBy: createQuoteNeverBelowPctOfPeak fails at the first slot the reserve drops below the threshold of its running peak
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/checks/quote-never-below-pct-of-peak.ts:24:51
             id: "quoteNeverBelowPctOfPeak",
             kind: "quoteNeverBelowPctOfPeak",
             passed: false,
-            summary: `pool quote fell to ${String(observedBps / 100n)}% of peak at slot ${String(sample.slot)}`,
+            summary: `pool quote fell to ${String(observedBps * 100n)}% of peak at slot ${String(sample.slot)}`,
             observed: observedBps.toString(),
             threshold: bps.toString(),
killedBy: createQuoteNeverBelowPctOfPeak fails at the first slot the reserve drops below the threshold of its running peak
statusReason: expected 'pool quote fell to 400000% of peak at…' to be 'pool quote fell to 40% of peak at slo…' // Object.is equality

[Killed] StringLiteral
src/checks/quote-never-below-pct-of-peak.ts:24:22
             id: "quoteNeverBelowPctOfPeak",
             kind: "quoteNeverBelowPctOfPeak",
             passed: false,
-            summary: `pool quote fell to ${String(observedBps / 100n)}% of peak at slot ${String(sample.slot)}`,
+            summary: ``,
             observed: observedBps.toString(),
             threshold: bps.toString(),
killedBy: createQuoteNeverBelowPctOfPeak fails at the first slot the reserve drops below the threshold of its running peak
statusReason: expected '' to be 'pool quote fell to 40% of peak at slo…' // Object.is equality

[Killed] BooleanLiteral
src/checks/quote-never-below-pct-of-peak.ts:34:17
       return {
         id: "quoteNeverBelowPctOfPeak",
         kind: "quoteNeverBelowPctOfPeak",
-        passed: true,
+        passed: false,
         summary: `pool quote never fell below ${String(bps / 100n)}% of its running peak`,
         observed: bps.toString(),
killedBy: createQuoteNeverBelowPctOfPeak passes when the quote reserve never drops below the threshold of its running peak
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/checks/quote-never-below-pct-of-peak.ts:35:56
         id: "quoteNeverBelowPctOfPeak",
         kind: "quoteNeverBelowPctOfPeak",
         passed: true,
-        summary: `pool quote never fell below ${String(bps / 100n)}% of its running peak`,
+        summary: `pool quote never fell below ${String(bps * 100n)}% of its running peak`,
         observed: bps.toString(),
         threshold: bps.toString(),
killedBy: createQuoteNeverBelowPctOfPeak passes when the quote reserve never drops below the threshold of its running peak
statusReason: expected 'pool quote never fell below 500000% o…' to be 'pool quote never fell below 50% of it…' // Object.is equality

[Killed] StringLiteral
src/checks/quote-never-below-pct-of-peak.ts:35:18
         id: "quoteNeverBelowPctOfPeak",
         kind: "quoteNeverBelowPctOfPeak",
         passed: true,
-        summary: `pool quote never fell below ${String(bps / 100n)}% of its running peak`,
+        summary: ``,
         observed: bps.toString(),
         threshold: bps.toString(),
killedBy: createQuoteNeverBelowPctOfPeak passes when the quote reserve never drops below the threshold of its running peak
statusReason: expected '' to be 'pool quote never fell below 50% of it…' // Object.is equality
