[Killed] BlockStatement
src/engine/clock.ts:22:38
  * @throws {RangeError} If `slotMs` is not a positive safe integer.
  */
 export function createClock(slotMs: number): Clock {
-  if (!Number.isSafeInteger(slotMs)) {
-    throw new RangeError("createClock: slotMs must be a safe integer");
-  }
+  if (!Number.isSafeInteger(slotMs)) {}
   if (slotMs <= 0) {
     throw new RangeError("createClock: slotMs must be positive");
killedBy: createClock throws when slotMs is not an integer
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/engine/clock.ts:22:7
  * @throws {RangeError} If `slotMs` is not a positive safe integer.
  */
 export function createClock(slotMs: number): Clock {
-  if (!Number.isSafeInteger(slotMs)) {
+  if (false) {
     throw new RangeError("createClock: slotMs must be a safe integer");
   }
killedBy: createClock throws when slotMs is not an integer
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/engine/clock.ts:23:26
  */
 export function createClock(slotMs: number): Clock {
   if (!Number.isSafeInteger(slotMs)) {
-    throw new RangeError("createClock: slotMs must be a safe integer");
+    throw new RangeError("");
   }
   if (slotMs <= 0) {
killedBy: createClock throws when slotMs is not an integer
statusReason: expected [Function] to throw error matching /safe integer/ but got ''

[Killed] ConditionalExpression
src/engine/clock.ts:25:7
   if (!Number.isSafeInteger(slotMs)) {
     throw new RangeError("createClock: slotMs must be a safe integer");
   }
-  if (slotMs <= 0) {
+  if (true) {
     throw new RangeError("createClock: slotMs must be positive");
   }
killedBy: createClock starts at slot 0
statusReason: createClock: slotMs must be positive

[Killed] ConditionalExpression
src/engine/clock.ts:25:7
   if (!Number.isSafeInteger(slotMs)) {
     throw new RangeError("createClock: slotMs must be a safe integer");
   }
-  if (slotMs <= 0) {
+  if (false) {
     throw new RangeError("createClock: slotMs must be positive");
   }
killedBy: createClock throws when slotMs is not a positive safe integer
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/engine/clock.ts:26:26
     throw new RangeError("createClock: slotMs must be a safe integer");
   }
   if (slotMs <= 0) {
-    throw new RangeError("createClock: slotMs must be positive");
+    throw new RangeError("");
   }
   let current = 0;
killedBy: createClock throws when slotMs is not a positive safe integer
statusReason: expected [Function] to throw error matching /positive/ but got ''

[Killed] BlockStatement
src/engine/clock.ts:31:19
   let current = 0;
   return {
     slotMs,
-    now(): number {
-      return current;
-    },
+    now(): number {},
     advanceTo(slot: number): void {
       if (!Number.isSafeInteger(slot)) {
killedBy: createClock starts at slot 0
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/engine/clock.ts:34:35
     now(): number {
       return current;
     },
-    advanceTo(slot: number): void {
-      if (!Number.isSafeInteger(slot)) {
-        throw new RangeError("Clock.advanceTo: slot must be a safe integer");
-      }
-      if (slot < 0) {
-        throw new RangeError("Clock.advanceTo: slot must be non-negative");
-      }
-      if (slot < current) {
-        throw new RangeError("Clock.advanceTo: cannot move backward");
-      }
-      current = slot;
-    },
+    advanceTo(slot: number): void {},
   };
 }
killedBy: Clock.advanceTo moves the current slot forward
statusReason: expected +0 to be 150 // Object.is equality

[Killed] BooleanLiteral
src/engine/clock.ts:35:11
       return current;
     },
     advanceTo(slot: number): void {
-      if (!Number.isSafeInteger(slot)) {
+      if (Number.isSafeInteger(slot)) {
         throw new RangeError("Clock.advanceTo: slot must be a safe integer");
       }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: slot must be a safe integer

[Killed] BlockStatement
src/engine/clock.ts:35:40
       return current;
     },
     advanceTo(slot: number): void {
-      if (!Number.isSafeInteger(slot)) {
-        throw new RangeError("Clock.advanceTo: slot must be a safe integer");
-      }
+      if (!Number.isSafeInteger(slot)) {}
       if (slot < 0) {
         throw new RangeError("Clock.advanceTo: slot must be non-negative");
killedBy: Clock.advanceTo throws when the target slot is not an integer
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/engine/clock.ts:36:30
     },
     advanceTo(slot: number): void {
       if (!Number.isSafeInteger(slot)) {
-        throw new RangeError("Clock.advanceTo: slot must be a safe integer");
+        throw new RangeError("");
       }
       if (slot < 0) {
killedBy: Clock.advanceTo throws when the target slot is not an integer
statusReason: expected [Function] to throw error matching /safe integer/ but got ''

[Killed] EqualityOperator
src/engine/clock.ts:38:11
       if (!Number.isSafeInteger(slot)) {
         throw new RangeError("Clock.advanceTo: slot must be a safe integer");
       }
-      if (slot < 0) {
+      if (slot >= 0) {
         throw new RangeError("Clock.advanceTo: slot must be non-negative");
       }
killedBy: Clock.advanceTo moves the current slot forward
statusReason: Clock.advanceTo: slot must be non-negative

[Killed] ConditionalExpression
src/engine/clock.ts:41:11
       if (slot < 0) {
         throw new RangeError("Clock.advanceTo: slot must be non-negative");
       }
-      if (slot < current) {
+      if (true) {
         throw new RangeError("Clock.advanceTo: cannot move backward");
       }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Clock.advanceTo: cannot move backward

[Killed] EqualityOperator
src/engine/clock.ts:41:11
       if (slot < 0) {
         throw new RangeError("Clock.advanceTo: slot must be non-negative");
       }
-      if (slot < current) {
+      if (slot <= current) {
         throw new RangeError("Clock.advanceTo: cannot move backward");
       }
killedBy: Clock.advanceTo allows advancing to the same slot (a no-op)
statusReason: Clock.advanceTo: cannot move backward
