[Killed] BlockStatement
src/engine/compare-priority-fee.ts:9:74
  * scheduling order among equal fees, since `Array.prototype.sort` is
  * stable (ES2019).
  */
-export function comparePriorityFeeDescending(a: Order, b: Order): number {
-  if (a.priorityFee > b.priorityFee) {
-    return -1;
-  }
-  if (a.priorityFee < b.priorityFee) {
-    return 1;
-  }
-  return 0;
-}
+export function comparePriorityFeeDescending(a: Order, b: Order): number {}
 
killedBy: runEngine orders within a slot by priority fee, higher first
statusReason: expected [ 'low', 'high' ] to deeply equal [ 'high', 'low' ]

[Killed] EqualityOperator
src/engine/compare-priority-fee.ts:10:7
  * stable (ES2019).
  */
 export function comparePriorityFeeDescending(a: Order, b: Order): number {
-  if (a.priorityFee > b.priorityFee) {
+  if (a.priorityFee <= b.priorityFee) {
     return -1;
   }
killedBy: runEngine orders within a slot by priority fee, higher first
statusReason: expected [ 'low', 'high' ] to deeply equal [ 'high', 'low' ]

[Killed] ConditionalExpression
src/engine/compare-priority-fee.ts:10:7
  * stable (ES2019).
  */
 export function comparePriorityFeeDescending(a: Order, b: Order): number {
-  if (a.priorityFee > b.priorityFee) {
+  if (false) {
     return -1;
   }
killedBy: runEngine orders within a slot by priority fee, higher first
statusReason: expected [ 'low', 'high' ] to deeply equal [ 'high', 'low' ]

[Killed] UnaryOperator
src/engine/compare-priority-fee.ts:11:12
  */
 export function comparePriorityFeeDescending(a: Order, b: Order): number {
   if (a.priorityFee > b.priorityFee) {
-    return -1;
+    return +1;
   }
   if (a.priorityFee < b.priorityFee) {
killedBy: runEngine orders within a slot by priority fee, higher first
statusReason: expected [ 'low', 'high' ] to deeply equal [ 'high', 'low' ]

[Killed] EqualityOperator
src/engine/compare-priority-fee.ts:13:7
   if (a.priorityFee > b.priorityFee) {
     return -1;
   }
-  if (a.priorityFee < b.priorityFee) {
+  if (a.priorityFee <= b.priorityFee) {
     return 1;
   }
killedBy: comparePriorityFeeDescending returns 0 when the priority fees are equal
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/engine/compare-priority-fee.ts:13:7
   if (a.priorityFee > b.priorityFee) {
     return -1;
   }
-  if (a.priorityFee < b.priorityFee) {
+  if (a.priorityFee >= b.priorityFee) {
     return 1;
   }
killedBy: comparePriorityFeeDescending returns 1 when a has the lower priority fee
statusReason: expected +0 to be 1 // Object.is equality
