[Killed] ArithmeticOperator
src/engine/rng.ts:1:20
-const UINT32_MAX = 2 ** 32 - 1;
+const UINT32_MAX = 2 ** 32 + 1;
 
 /**
killedBy: createRng throws when the seed exceeds the uint32 range
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/engine/rng.ts:18:49
 }
 
 /** mulberry32: a small, fast, deterministic PRNG. Not cryptographic. */
-function mulberry32(seed: number): () => number {
-  let state = seed;
-  return function next(): number {
-    state = (state + 0x6d2b79f5) | 0;
-    let t = Math.imul(state ^ (state >>> 15), 1 | state);
-    t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
-    return ((t ^ (t >>> 14)) >>> 0) / 4294967296;
-  };
-}
+function mulberry32(seed: number): () => number {}
 
 /** FNV-1a: a small, fast, deterministic string hash, used to derive fork seeds. */
killedBy: createSniperActors creates `count` distinct scheduled actors with distinct ids
statusReason: next is not a function

[Killed] BlockStatement
src/engine/rng.ts:20:34
 /** mulberry32: a small, fast, deterministic PRNG. Not cryptographic. */
 function mulberry32(seed: number): () => number {
   let state = seed;
-  return function next(): number {
-    state = (state + 0x6d2b79f5) | 0;
-    let t = Math.imul(state ^ (state >>> 15), 1 | state);
-    t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
-    return ((t ^ (t >>> 14)) >>> 0) / 4294967296;
-  };
+  return function next(): number {};
 }
 
killedBy: createSniperActors creates `count` distinct scheduled actors with distinct ids
statusReason: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
src/engine/rng.ts:21:14
 function mulberry32(seed: number): () => number {
   let state = seed;
   return function next(): number {
-    state = (state + 0x6d2b79f5) | 0;
+    state = (state - 0x6d2b79f5) | 0;
     let t = Math.imul(state ^ (state >>> 15), 1 | state);
     t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
killedBy: createRng matches pinned values for seed 42 (docs/07: determinism is load-bearing)
statusReason: expected [ 0.4543753587640822, …(2) ] to deeply equal [ 0.6011037519201636, …(2) ]

[Killed] ArithmeticOperator
src/engine/rng.ts:23:10
   return function next(): number {
     state = (state + 0x6d2b79f5) | 0;
     let t = Math.imul(state ^ (state >>> 15), 1 | state);
-    t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
+    t = (t - Math.imul(t ^ t >>> 7, 61 | t)) ^ t;
     return ((t ^ (t >>> 14)) >>> 0) / 4294967296;
   };
killedBy: createRng matches pinned values for seed 42 (docs/07: determinism is load-bearing)
statusReason: expected [ 0.4301930582150817, …(2) ] to deeply equal [ 0.6011037519201636, …(2) ]

[Killed] ArithmeticOperator
src/engine/rng.ts:24:12
     state = (state + 0x6d2b79f5) | 0;
     let t = Math.imul(state ^ (state >>> 15), 1 | state);
     t = (t + Math.imul(t ^ (t >>> 7), 61 | t)) ^ t;
-    return ((t ^ (t >>> 14)) >>> 0) / 4294967296;
+    return ((t ^ t >>> 14) >>> 0) * 4294967296;
   };
 }
killedBy: createSniperActors samples spend within [spendMin, spendMax], deterministically per seed
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/engine/rng.ts:29:41
 }
 
 /** FNV-1a: a small, fast, deterministic string hash, used to derive fork seeds. */
-function fnv1a32(value: string): number {
-  let hash = 0x811c9dc5;
-  for (let i = 0; i < value.length; i++) {
-    hash ^= value.charCodeAt(i);
-    hash = Math.imul(hash, 0x01000193);
-  }
-  return hash >>> 0;
-}
+function fnv1a32(value: string): number {}
 
 /**
killedBy: Rng.fork matches a pinned value for seed 42 forked as "sniper-0"
statusReason: expected 0.6011037519201636 to be 0.09641121770255268 // Object.is equality

[Killed] ConditionalExpression
src/engine/rng.ts:31:19
 /** FNV-1a: a small, fast, deterministic string hash, used to derive fork seeds. */
 function fnv1a32(value: string): number {
   let hash = 0x811c9dc5;
-  for (let i = 0; i < value.length; i++) {
+  for (let i = 0; false; i++) {
     hash ^= value.charCodeAt(i);
     hash = Math.imul(hash, 0x01000193);
killedBy: Rng.fork matches a pinned value for seed 42 forked as "sniper-0"
statusReason: expected 0.1804595955181867 to be 0.09641121770255268 // Object.is equality

[Killed] EqualityOperator
src/engine/rng.ts:31:19
 /** FNV-1a: a small, fast, deterministic string hash, used to derive fork seeds. */
 function fnv1a32(value: string): number {
   let hash = 0x811c9dc5;
-  for (let i = 0; i < value.length; i++) {
+  for (let i = 0; i <= value.length; i++) {
     hash ^= value.charCodeAt(i);
     hash = Math.imul(hash, 0x01000193);
killedBy: Rng.fork matches a pinned value for seed 42 forked as "sniper-0"
statusReason: expected 0.9656870381440967 to be 0.09641121770255268 // Object.is equality

[Killed] BlockStatement
src/engine/rng.ts:49:46
  * rng.next(); // always the same value for seed 42
  * ```
  */
-export function createRng(seed: number): Rng {
-  if (!Number.isSafeInteger(seed) || seed < 0 || seed > UINT32_MAX) {
-    throw new RangeError("createRng: seed must be a uint32");
-  }
-  const next = mulberry32(seed);
-  return {
-    next,
-    nextInt(maxExclusive: number): number {
-      if (!Number.isInteger(maxExclusive)) {
-        throw new RangeError("Rng.nextInt: maxExclusive must be an integer");
-      }
-      if (maxExclusive <= 0) {
-        throw new RangeError("Rng.nextInt: maxExclusive must be positive");
-      }
-      return Math.floor(next() * maxExclusive);
-    },
-    fork(id: string): Rng {
-      return createRng((seed ^ fnv1a32(id)) >>> 0);
-    },
-  };
-}
+export function createRng(seed: number): Rng {}
 
killedBy: createRng is deterministic: the same seed produces the same sequence
statusReason: Cannot read properties of undefined (reading 'next')

[Killed] EqualityOperator
src/engine/rng.ts:50:50
  * ```
  */
 export function createRng(seed: number): Rng {
-  if (!Number.isSafeInteger(seed) || seed < 0 || seed > UINT32_MAX) {
+  if (!Number.isSafeInteger(seed) || seed < 0 || seed >= UINT32_MAX) {
     throw new RangeError("createRng: seed must be a uint32");
   }
killedBy: createRng (properties) next() always returns a value in [0, 1)
statusReason: Property failed after 85 tests
{ seed: 42, path: "84", endOnFailure: true }
Counterexample: [4294967295]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/engine/rng.ts:50:38
  * ```
  */
 export function createRng(seed: number): Rng {
-  if (!Number.isSafeInteger(seed) || seed < 0 || seed > UINT32_MAX) {
+  if (!Number.isSafeInteger(seed) || false || seed > UINT32_MAX) {
     throw new RangeError("createRng: seed must be a uint32");
   }
killedBy: createRng throws when the seed is negative
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
src/engine/rng.ts:54:10
     throw new RangeError("createRng: seed must be a uint32");
   }
   const next = mulberry32(seed);
-  return {
-    next,
-    nextInt(maxExclusive: number): number {
-      if (!Number.isInteger(maxExclusive)) {
-        throw new RangeError("Rng.nextInt: maxExclusive must be an integer");
-      }
-      if (maxExclusive <= 0) {
-        throw new RangeError("Rng.nextInt: maxExclusive must be positive");
-      }
-      return Math.floor(next() * maxExclusive);
-    },
-    fork(id: string): Rng {
-      return createRng((seed ^ fnv1a32(id)) >>> 0);
-    },
-  };
+  return {};
 }
 
killedBy: createRng is deterministic: the same seed produces the same sequence
statusReason: a.next is not a function

[Killed] BlockStatement
src/engine/rng.ts:56:43
   const next = mulberry32(seed);
   return {
     next,
-    nextInt(maxExclusive: number): number {
-      if (!Number.isInteger(maxExclusive)) {
-        throw new RangeError("Rng.nextInt: maxExclusive must be an integer");
-      }
-      if (maxExclusive <= 0) {
-        throw new RangeError("Rng.nextInt: maxExclusive must be positive");
-      }
-      return Math.floor(next() * maxExclusive);
-    },
+    nextInt(maxExclusive: number): number {},
     fork(id: string): Rng {
       return createRng((seed ^ fnv1a32(id)) >>> 0);
killedBy: Rng.nextInt returns an integer in [0, maxExclusive)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/engine/rng.ts:57:11
   return {
     next,
     nextInt(maxExclusive: number): number {
-      if (!Number.isInteger(maxExclusive)) {
+      if (Number.isInteger(maxExclusive)) {
         throw new RangeError("Rng.nextInt: maxExclusive must be an integer");
       }
killedBy: Rng.nextInt returns an integer in [0, maxExclusive)
statusReason: Rng.nextInt: maxExclusive must be an integer

[Killed] ConditionalExpression
src/engine/rng.ts:57:11
   return {
     next,
     nextInt(maxExclusive: number): number {
-      if (!Number.isInteger(maxExclusive)) {
+      if (true) {
         throw new RangeError("Rng.nextInt: maxExclusive must be an integer");
       }
killedBy: Rng.nextInt returns an integer in [0, maxExclusive)
statusReason: Rng.nextInt: maxExclusive must be an integer

[Killed] EqualityOperator
src/engine/rng.ts:60:11
       if (!Number.isInteger(maxExclusive)) {
         throw new RangeError("Rng.nextInt: maxExclusive must be an integer");
       }
-      if (maxExclusive <= 0) {
+      if (maxExclusive > 0) {
         throw new RangeError("Rng.nextInt: maxExclusive must be positive");
       }
killedBy: Rng.nextInt returns an integer in [0, maxExclusive)
statusReason: Rng.nextInt: maxExclusive must be positive

[Killed] BlockStatement
src/engine/rng.ts:60:30
       if (!Number.isInteger(maxExclusive)) {
         throw new RangeError("Rng.nextInt: maxExclusive must be an integer");
       }
-      if (maxExclusive <= 0) {
-        throw new RangeError("Rng.nextInt: maxExclusive must be positive");
-      }
+      if (maxExclusive <= 0) {}
       return Math.floor(next() * maxExclusive);
     },
killedBy: Rng.nextInt throws when maxExclusive is zero
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/engine/rng.ts:63:25
       if (maxExclusive <= 0) {
         throw new RangeError("Rng.nextInt: maxExclusive must be positive");
       }
-      return Math.floor(next() * maxExclusive);
+      return Math.floor(next() / maxExclusive);
     },
     fork(id: string): Rng {
killedBy: determinism (docs/07) changing only the seed changes the result (proves the Rng is wired in)
statusReason: expected [ { slot: +0, …(7) }, …(30) ] to not deeply equal [ { slot: +0, …(7) }, …(30) ]

[Killed] BlockStatement
src/engine/rng.ts:65:27
       }
       return Math.floor(next() * maxExclusive);
     },
-    fork(id: string): Rng {
-      return createRng((seed ^ fnv1a32(id)) >>> 0);
-    },
+    fork(id: string): Rng {},
   };
 }
killedBy: Rng.fork is deterministic: the same id produces the same child sequence
statusReason: Cannot read properties of undefined (reading 'next')
