[Killed] BlockStatement
src/engine/wallet.ts:16:64
  *
  * @throws {RangeError} If `quoteBalance` is negative.
  */
-export function createWallet(quoteBalance: bigint): WalletView {
-  if (quoteBalance < 0n) {
-    throw new RangeError("createWallet: quoteBalance must be non-negative");
-  }
-  return { quoteBalance, baseBalance: 0n, entryPrice: null };
-}
+export function createWallet(quoteBalance: bigint): WalletView {}
 
 /**
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: Cannot read properties of undefined (reading 'baseBalance')

[Killed] EqualityOperator
src/engine/wallet.ts:17:7
  * @throws {RangeError} If `quoteBalance` is negative.
  */
 export function createWallet(quoteBalance: bigint): WalletView {
-  if (quoteBalance < 0n) {
+  if (quoteBalance >= 0n) {
     throw new RangeError("createWallet: quoteBalance must be non-negative");
   }
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: createWallet: quoteBalance must be non-negative

[Killed] ConditionalExpression
src/engine/wallet.ts:17:7
  * @throws {RangeError} If `quoteBalance` is negative.
  */
 export function createWallet(quoteBalance: bigint): WalletView {
-  if (quoteBalance < 0n) {
+  if (false) {
     throw new RangeError("createWallet: quoteBalance must be non-negative");
   }
killedBy: createWallet throws when the starting quote balance is negative
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/engine/wallet.ts:33:71
  *
  * @throws {RangeError} If the fill would spend more than the wallet holds.
  */
-export function applyFill(wallet: WalletView, fill: Fill): WalletView {
-  if (fill.side === "buy") {
-    if (fill.quoteAmount > wallet.quoteBalance) {
-      throw new RangeError("applyFill: insufficient quote balance");
-    }
-    return {
-      quoteBalance: wallet.quoteBalance - fill.quoteAmount,
-      baseBalance: wallet.baseBalance + fill.baseAmount,
-      entryPrice:
-        wallet.entryPrice ?? (fill.baseAmount > 0n ? price(fill.quoteAmount, fill.baseAmount) : null),
-    };
-  }
-  if (fill.baseAmount > wallet.baseBalance) {
-    throw new RangeError("applyFill: insufficient base balance");
-  }
-  const baseBalance = wallet.baseBalance - fill.baseAmount;
-  return {
-    quoteBalance: wallet.quoteBalance + fill.quoteAmount,
-    baseBalance,
-    entryPrice: baseBalance === 0n ? null : wallet.entryPrice,
-  };
-}
+export function applyFill(wallet: WalletView, fill: Fill): WalletView {}
 
killedBy: runEngine runs a single actor's buy order and updates the market and wallet
statusReason: expected undefined to be 0n // Object.is equality

[Killed] EqualityOperator
src/engine/wallet.ts:34:7
  * @throws {RangeError} If the fill would spend more than the wallet holds.
  */
 export function applyFill(wallet: WalletView, fill: Fill): WalletView {
-  if (fill.side === "buy") {
+  if (fill.side !== "buy") {
     if (fill.quoteAmount > wallet.quoteBalance) {
       throw new RangeError("applyFill: insufficient quote balance");
killedBy: applyFill applies a buy fill: quote decreases, base increases
statusReason: applyFill: insufficient base balance

[Killed] BlockStatement
src/engine/wallet.ts:34:28
  * @throws {RangeError} If the fill would spend more than the wallet holds.
  */
 export function applyFill(wallet: WalletView, fill: Fill): WalletView {
-  if (fill.side === "buy") {
-    if (fill.quoteAmount > wallet.quoteBalance) {
-      throw new RangeError("applyFill: insufficient quote balance");
-    }
-    return {
-      quoteBalance: wallet.quoteBalance - fill.quoteAmount,
-      baseBalance: wallet.baseBalance + fill.baseAmount,
-      entryPrice:
-        wallet.entryPrice ?? (fill.baseAmount > 0n ? price(fill.quoteAmount, fill.baseAmount) : null),
-    };
-  }
+  if (fill.side === "buy") {}
   if (fill.baseAmount > wallet.baseBalance) {
     throw new RangeError("applyFill: insufficient base balance");
killedBy: determinism (docs/07) running the same scenario twice with the same seed gives byte-identical results
statusReason: applyFill: insufficient base balance

[Killed] ConditionalExpression
src/engine/wallet.ts:35:9
  */
 export function applyFill(wallet: WalletView, fill: Fill): WalletView {
   if (fill.side === "buy") {
-    if (fill.quoteAmount > wallet.quoteBalance) {
+    if (false) {
       throw new RangeError("applyFill: insufficient quote balance");
     }
killedBy: applyFill throws on a buy that exceeds the quote balance
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/engine/wallet.ts:35:9
  */
 export function applyFill(wallet: WalletView, fill: Fill): WalletView {
   if (fill.side === "buy") {
-    if (fill.quoteAmount > wallet.quoteBalance) {
+    if (fill.quoteAmount <= wallet.quoteBalance) {
       throw new RangeError("applyFill: insufficient quote balance");
     }
killedBy: applyFill applies a buy fill: quote decreases, base increases
statusReason: applyFill: insufficient quote balance

[Killed] StringLiteral
src/engine/wallet.ts:36:28
 export function applyFill(wallet: WalletView, fill: Fill): WalletView {
   if (fill.side === "buy") {
     if (fill.quoteAmount > wallet.quoteBalance) {
-      throw new RangeError("applyFill: insufficient quote balance");
+      throw new RangeError("");
     }
     return {
killedBy: applyFill throws on a buy that exceeds the quote balance
statusReason: expected [Function] to throw error matching /insufficient/ but got ''

[Killed] ObjectLiteral
src/engine/wallet.ts:38:12
     if (fill.quoteAmount > wallet.quoteBalance) {
       throw new RangeError("applyFill: insufficient quote balance");
     }
-    return {
-      quoteBalance: wallet.quoteBalance - fill.quoteAmount,
-      baseBalance: wallet.baseBalance + fill.baseAmount,
-      entryPrice:
-        wallet.entryPrice ?? (fill.baseAmount > 0n ? price(fill.quoteAmount, fill.baseAmount) : null),
-    };
+    return {};
   }
   if (fill.baseAmount > wallet.baseBalance) {
killedBy: applyFill applies a buy fill: quote decreases, base increases
statusReason: expected undefined to be 990000n // Object.is equality

[Killed] ArithmeticOperator
src/engine/wallet.ts:39:21
       throw new RangeError("applyFill: insufficient quote balance");
     }
     return {
-      quoteBalance: wallet.quoteBalance - fill.quoteAmount,
+      quoteBalance: wallet.quoteBalance + fill.quoteAmount,
       baseBalance: wallet.baseBalance + fill.baseAmount,
       entryPrice:
killedBy: applyFill applies a buy fill: quote decreases, base increases
statusReason: expected 1010000n to be 990000n // Object.is equality

[Killed] ArithmeticOperator
src/engine/wallet.ts:40:20
     }
     return {
       quoteBalance: wallet.quoteBalance - fill.quoteAmount,
-      baseBalance: wallet.baseBalance + fill.baseAmount,
+      baseBalance: wallet.baseBalance - fill.baseAmount,
       entryPrice:
         wallet.entryPrice ?? (fill.baseAmount > 0n ? price(fill.quoteAmount, fill.baseAmount) : null),
killedBy: applyFill applies a buy fill: quote decreases, base increases
statusReason: expected -9802n to be 9802n // Object.is equality

[Killed] EqualityOperator
src/engine/wallet.ts:42:31
       quoteBalance: wallet.quoteBalance - fill.quoteAmount,
       baseBalance: wallet.baseBalance + fill.baseAmount,
       entryPrice:
-        wallet.entryPrice ?? (fill.baseAmount > 0n ? price(fill.quoteAmount, fill.baseAmount) : null),
+        wallet.entryPrice ?? (fill.baseAmount >= 0n ? price(fill.quoteAmount, fill.baseAmount) : null),
     };
   }
killedBy: applyFill applies a zero-amount buy fill without setting an entry price or throwing
statusReason: price: den must be positive

[Killed] EqualityOperator
src/engine/wallet.ts:42:31
       quoteBalance: wallet.quoteBalance - fill.quoteAmount,
       baseBalance: wallet.baseBalance + fill.baseAmount,
       entryPrice:
-        wallet.entryPrice ?? (fill.baseAmount > 0n ? price(fill.quoteAmount, fill.baseAmount) : null),
+        wallet.entryPrice ?? (fill.baseAmount <= 0n ? price(fill.quoteAmount, fill.baseAmount) : null),
     };
   }
killedBy: applyFill sets entryPrice on the first buy
statusReason: expected null to deeply equal { num: 10000n, den: 9802n }

[Killed] ConditionalExpression
src/engine/wallet.ts:45:7
         wallet.entryPrice ?? (fill.baseAmount > 0n ? price(fill.quoteAmount, fill.baseAmount) : null),
     };
   }
-  if (fill.baseAmount > wallet.baseBalance) {
+  if (false) {
     throw new RangeError("applyFill: insufficient base balance");
   }
killedBy: applyFill throws on a sell that exceeds the base balance
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/engine/wallet.ts:45:7
         wallet.entryPrice ?? (fill.baseAmount > 0n ? price(fill.quoteAmount, fill.baseAmount) : null),
     };
   }
-  if (fill.baseAmount > wallet.baseBalance) {
+  if (fill.baseAmount <= wallet.baseBalance) {
     throw new RangeError("applyFill: insufficient base balance");
   }
killedBy: runEngine fills a sell order, updating the market and wallet
statusReason: applyFill: insufficient base balance

[Killed] StringLiteral
src/engine/wallet.ts:46:26
     };
   }
   if (fill.baseAmount > wallet.baseBalance) {
-    throw new RangeError("applyFill: insufficient base balance");
+    throw new RangeError("");
   }
   const baseBalance = wallet.baseBalance - fill.baseAmount;
killedBy: applyFill throws on a sell that exceeds the base balance
statusReason: expected [Function] to throw error matching /insufficient/ but got ''

[Killed] ArithmeticOperator
src/engine/wallet.ts:48:23
   if (fill.baseAmount > wallet.baseBalance) {
     throw new RangeError("applyFill: insufficient base balance");
   }
-  const baseBalance = wallet.baseBalance - fill.baseAmount;
+  const baseBalance = wallet.baseBalance + fill.baseAmount;
   return {
     quoteBalance: wallet.quoteBalance + fill.quoteAmount,
killedBy: runEngine fills a sell order, updating the market and wallet
statusReason: expected 19604n to be 0n // Object.is equality

[Killed] ArithmeticOperator
src/engine/wallet.ts:50:19
   }
   const baseBalance = wallet.baseBalance - fill.baseAmount;
   return {
-    quoteBalance: wallet.quoteBalance + fill.quoteAmount,
+    quoteBalance: wallet.quoteBalance - fill.quoteAmount,
     baseBalance,
     entryPrice: baseBalance === 0n ? null : wallet.entryPrice,
killedBy: applyFill applies a sell fill: base decreases, quote increases
statusReason: expected -5024n to be 5024n // Object.is equality

[Killed] EqualityOperator
src/engine/wallet.ts:52:17
   return {
     quoteBalance: wallet.quoteBalance + fill.quoteAmount,
     baseBalance,
-    entryPrice: baseBalance === 0n ? null : wallet.entryPrice,
+    entryPrice: baseBalance !== 0n ? null : wallet.entryPrice,
   };
 }
killedBy: applyFill clears entryPrice once the full base balance is sold
statusReason: expected { num: 10000n, den: 9802n } to be null

[Killed] ConditionalExpression
src/engine/wallet.ts:52:17
   return {
     quoteBalance: wallet.quoteBalance + fill.quoteAmount,
     baseBalance,
-    entryPrice: baseBalance === 0n ? null : wallet.entryPrice,
+    entryPrice: false ? null : wallet.entryPrice,
   };
 }
killedBy: applyFill clears entryPrice once the full base balance is sold
statusReason: expected { num: 10000n, den: 9802n } to be null
