[Killed] BlockStatement
src/math/bps-of.ts:18:60
  * bpsOf(1_000_000n, 500n); // 50_000n (5% of 1,000,000)
  * ```
  */
-export function bpsOf(amount: bigint, bps: bigint): bigint {
-  // No non-negative check here: mulDiv already validates both factors, and
-  // duplicating it left untestable mutants (docs/07) with nothing behavioral
-  // to distinguish them from mulDiv's own guard.
-  return mulDiv(amount, bps, BPS_DENOMINATOR);
-}
+export function bpsOf(amount: bigint, bps: bigint): bigint {}
 
killedBy: bpsOf computes a share expressed in basis points
statusReason: expected undefined to be 50000n // Object.is equality
