[Killed] BlockStatement
src/math/ceil-div.ts:12:73
  * ceilDiv(11n, 5n); // 3n
  * ```
  */
-export function ceilDiv(numerator: bigint, denominator: bigint): bigint {
-  if (numerator < 0n || denominator < 0n) {
-    throw new RangeError("ceilDiv: inputs must be non-negative");
-  }
-  if (denominator === 0n) {
-    throw new RangeError("ceilDiv: division by zero");
-  }
-  return (numerator + denominator - 1n) / denominator;
-}
+export function ceilDiv(numerator: bigint, denominator: bigint): bigint {}
 
killedBy: ceilDiv returns the exact quotient when divisible
statusReason: expected undefined to be 2n // Object.is equality

[Killed] EqualityOperator
src/math/ceil-div.ts:13:7
  * ```
  */
 export function ceilDiv(numerator: bigint, denominator: bigint): bigint {
-  if (numerator < 0n || denominator < 0n) {
+  if (numerator <= 0n || denominator < 0n) {
     throw new RangeError("ceilDiv: inputs must be non-negative");
   }
killedBy: ceilDiv returns 0 for a zero numerator
statusReason: ceilDiv: inputs must be non-negative

[Killed] EqualityOperator
src/math/ceil-div.ts:13:25
  * ```
  */
 export function ceilDiv(numerator: bigint, denominator: bigint): bigint {
-  if (numerator < 0n || denominator < 0n) {
+  if (numerator < 0n || denominator >= 0n) {
     throw new RangeError("ceilDiv: inputs must be non-negative");
   }
killedBy: ceilDiv returns the exact quotient when divisible
statusReason: ceilDiv: inputs must be non-negative

[Killed] BlockStatement
src/math/ceil-div.ts:16:27
   if (numerator < 0n || denominator < 0n) {
     throw new RangeError("ceilDiv: inputs must be non-negative");
   }
-  if (denominator === 0n) {
-    throw new RangeError("ceilDiv: division by zero");
-  }
+  if (denominator === 0n) {}
   return (numerator + denominator - 1n) / denominator;
 }
killedBy: ceilDiv throws on a zero denominator
statusReason: expected [Function] to throw error matching /division by zero/ but got 'Division by zero'

[Killed] ConditionalExpression
src/math/ceil-div.ts:16:7
   if (numerator < 0n || denominator < 0n) {
     throw new RangeError("ceilDiv: inputs must be non-negative");
   }
-  if (denominator === 0n) {
+  if (true) {
     throw new RangeError("ceilDiv: division by zero");
   }
killedBy: ceilDiv returns the exact quotient when divisible
statusReason: ceilDiv: division by zero

[Killed] StringLiteral
src/math/ceil-div.ts:17:26
     throw new RangeError("ceilDiv: inputs must be non-negative");
   }
   if (denominator === 0n) {
-    throw new RangeError("ceilDiv: division by zero");
+    throw new RangeError("");
   }
   return (numerator + denominator - 1n) / denominator;
killedBy: ceilDiv throws on a zero denominator
statusReason: expected [Function] to throw error matching /division by zero/ but got ''

[Killed] ArithmeticOperator
src/math/ceil-div.ts:19:10
   if (denominator === 0n) {
     throw new RangeError("ceilDiv: division by zero");
   }
-  return (numerator + denominator - 1n) / denominator;
+  return (numerator + denominator - 1n) * denominator;
 }
 
killedBy: ceilDiv returns the exact quotient when divisible
statusReason: expected 70n to be 2n // Object.is equality

[Killed] ArithmeticOperator
src/math/ceil-div.ts:19:11
   if (denominator === 0n) {
     throw new RangeError("ceilDiv: division by zero");
   }
-  return (numerator + denominator - 1n) / denominator;
+  return (numerator - denominator - 1n) / denominator;
 }
 
killedBy: ceilDiv returns the exact quotient when divisible
statusReason: expected 0n to be 2n // Object.is equality
