[Killed] BlockStatement
src/math/min-max-big.ts:9:54
  * minBig(3n, 7n); // 3n
  * ```
  */
-export function minBig(a: bigint, b: bigint): bigint {
-  return a < b ? a : b;
-}
+export function minBig(a: bigint, b: bigint): bigint {}
 
 /**
killedBy: minBig returns the smaller of two bigints when the smaller is first
statusReason: expected undefined to be 3n // Object.is equality

[Killed] ConditionalExpression
src/math/min-max-big.ts:10:10
  * ```
  */
 export function minBig(a: bigint, b: bigint): bigint {
-  return a < b ? a : b;
+  return false ? a : b;
 }
 
killedBy: minBig returns the smaller of two bigints when the smaller is first
statusReason: expected 7n to be 3n // Object.is equality

[Killed] EqualityOperator
src/math/min-max-big.ts:10:10
  * ```
  */
 export function minBig(a: bigint, b: bigint): bigint {
-  return a < b ? a : b;
+  return a >= b ? a : b;
 }
 
killedBy: minBig returns the smaller of two bigints when the smaller is first
statusReason: expected 7n to be 3n // Object.is equality

[Killed] BlockStatement
src/math/min-max-big.ts:21:54
  * maxBig(3n, 7n); // 7n
  * ```
  */
-export function maxBig(a: bigint, b: bigint): bigint {
-  return a > b ? a : b;
-}
+export function maxBig(a: bigint, b: bigint): bigint {}
 
killedBy: createQuoteNeverBelowPctOfPeak fails at the first slot the reserve drops below the threshold of its running peak
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/math/min-max-big.ts:22:10
  * ```
  */
 export function maxBig(a: bigint, b: bigint): bigint {
-  return a > b ? a : b;
+  return false ? a : b;
 }
 
killedBy: createQuoteNeverBelowPctOfPeak fails at the first slot the reserve drops below the threshold of its running peak
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/math/min-max-big.ts:22:10
  * ```
  */
 export function maxBig(a: bigint, b: bigint): bigint {
-  return a > b ? a : b;
+  return a <= b ? a : b;
 }
 
killedBy: createQuoteNeverBelowPctOfPeak fails at the first slot the reserve drops below the threshold of its running peak
statusReason: expected true to be false // Object.is equality
