[Killed] BlockStatement
src/math/mul-div.ts:17:75
  * mulDiv(5n, 5n, 3n); // 8n
  * ```
  */
-export function mulDiv(a: bigint, b: bigint, denominator: bigint): bigint {
-  if (a < 0n || b < 0n || denominator < 0n) {
-    throw new RangeError("mulDiv: inputs must be non-negative");
-  }
-  if (denominator === 0n) {
-    throw new RangeError("mulDiv: division by zero");
-  }
-  return (a * b) / denominator;
-}
+export function mulDiv(a: bigint, b: bigint, denominator: bigint): bigint {}
 
killedBy: mulDiv (properties) floors: result * denominator <= a * b < (result + 1) * denominator
statusReason: Property failed after 1 tests
{ seed: 42, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0n,0n,1n]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/math/mul-div.ts:18:27
  * ```
  */
 export function mulDiv(a: bigint, b: bigint, denominator: bigint): bigint {
-  if (a < 0n || b < 0n || denominator < 0n) {
+  if (a < 0n || b < 0n || false) {
     throw new RangeError("mulDiv: inputs must be non-negative");
   }
killedBy: mulDiv throws on a negative denominator
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/math/mul-div.ts:18:45
  * ```
  */
 export function mulDiv(a: bigint, b: bigint, denominator: bigint): bigint {
-  if (a < 0n || b < 0n || denominator < 0n) {
-    throw new RangeError("mulDiv: inputs must be non-negative");
-  }
+  if (a < 0n || b < 0n || denominator < 0n) {}
   if (denominator === 0n) {
     throw new RangeError("mulDiv: division by zero");
killedBy: bpsOf throws on a negative amount
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/math/mul-div.ts:19:26
  */
 export function mulDiv(a: bigint, b: bigint, denominator: bigint): bigint {
   if (a < 0n || b < 0n || denominator < 0n) {
-    throw new RangeError("mulDiv: inputs must be non-negative");
+    throw new RangeError("");
   }
   if (denominator === 0n) {
killedBy: bpsOf throws on a negative amount
statusReason: expected [Function] to throw error matching /non-negative/ but got ''

[Killed] EqualityOperator
src/math/mul-div.ts:21:7
   if (a < 0n || b < 0n || denominator < 0n) {
     throw new RangeError("mulDiv: inputs must be non-negative");
   }
-  if (denominator === 0n) {
+  if (denominator !== 0n) {
     throw new RangeError("mulDiv: division by zero");
   }
killedBy: mulDiv (properties) is commutative in its two factors
statusReason: Property failed after 1 tests
{ seed: 42, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0n,0n,1n]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/math/mul-div.ts:21:7
   if (a < 0n || b < 0n || denominator < 0n) {
     throw new RangeError("mulDiv: inputs must be non-negative");
   }
-  if (denominator === 0n) {
+  if (false) {
     throw new RangeError("mulDiv: division by zero");
   }
killedBy: mulDiv throws on a zero denominator
statusReason: expected [Function] to throw error matching /division by zero/ but got 'Division by zero'

[Killed] StringLiteral
src/math/mul-div.ts:22:26
     throw new RangeError("mulDiv: inputs must be non-negative");
   }
   if (denominator === 0n) {
-    throw new RangeError("mulDiv: division by zero");
+    throw new RangeError("");
   }
   return (a * b) / denominator;
killedBy: mulDiv throws on a zero denominator
statusReason: expected [Function] to throw error matching /division by zero/ but got ''

[Killed] ArithmeticOperator
src/math/mul-div.ts:24:11
   if (denominator === 0n) {
     throw new RangeError("mulDiv: division by zero");
   }
-  return (a * b) / denominator;
+  return (a / b) / denominator;
 }
 
killedBy: mulDiv returns the exact result when divisible
statusReason: expected 0n to be 10n // Object.is equality

[Killed] ArithmeticOperator
src/math/mul-div.ts:24:10
   if (denominator === 0n) {
     throw new RangeError("mulDiv: division by zero");
   }
-  return (a * b) / denominator;
+  return a * b * denominator;
 }
 
killedBy: bpsOf computes a share expressed in basis points
statusReason: expected 5000000000000n to be 50000n // Object.is equality
