[Killed] BlockStatement
src/math/price.ts:21:56
  * price(3n, 2n); // { num: 3n, den: 2n } -- 1.5 quote per base
  * ```
  */
-export function price(num: bigint, den: bigint): Price {
-  if (num < 0n) {
-    throw new RangeError("price: num must be non-negative");
-  }
-  if (den <= 0n) {
-    throw new RangeError("price: den must be positive");
-  }
-  return { num, den };
-}
+export function price(num: bigint, den: bigint): Price {}
 
 /**
killedBy: hasReachedMultiple returns true when the current price has reached the target multiple
statusReason: Cannot read properties of undefined (reading 'num')

[Killed] ConditionalExpression
src/math/price.ts:22:7
  * ```
  */
 export function price(num: bigint, den: bigint): Price {
-  if (num < 0n) {
+  if (false) {
     throw new RangeError("price: num must be non-negative");
   }
killedBy: price throws on a negative numerator
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/math/price.ts:22:7
  * ```
  */
 export function price(num: bigint, den: bigint): Price {
-  if (num < 0n) {
+  if (num >= 0n) {
     throw new RangeError("price: num must be non-negative");
   }
killedBy: applyFill applies a buy fill: quote decreases, base increases
statusReason: price: num must be non-negative

[Killed] ConditionalExpression
src/math/price.ts:25:7
   if (num < 0n) {
     throw new RangeError("price: num must be non-negative");
   }
-  if (den <= 0n) {
+  if (false) {
     throw new RangeError("price: den must be positive");
   }
killedBy: price throws on a zero denominator
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/math/price.ts:25:18
   if (num < 0n) {
     throw new RangeError("price: num must be non-negative");
   }
-  if (den <= 0n) {
-    throw new RangeError("price: den must be positive");
-  }
+  if (den <= 0n) {}
   return { num, den };
 }
killedBy: price throws on a zero denominator
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
src/math/price.ts:28:10
   if (den <= 0n) {
     throw new RangeError("price: den must be positive");
   }
-  return { num, den };
+  return {};
 }
 
killedBy: applyFill sets entryPrice on the first buy
statusReason: expected {} to deeply equal { num: 10000n, den: 9802n }

[Killed] BlockStatement
src/math/price.ts:40:62
  * comparePrice(price(1n, 2n), price(2n, 4n)); // 0 -- both are 0.5
  * ```
  */
-export function comparePrice(a: Price, b: Price): -1 | 0 | 1 {
-  const left = a.num * b.den;
-  const right = b.num * a.den;
-  if (left < right) {
-    return -1;
-  }
-  if (left > right) {
-    return 1;
-  }
-  return 0;
-}
+export function comparePrice(a: Price, b: Price): -1 | 0 | 1 {}
 
killedBy: comparePrice returns 0 for equal prices with different representations
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/math/price.ts:41:16
  * ```
  */
 export function comparePrice(a: Price, b: Price): -1 | 0 | 1 {
-  const left = a.num * b.den;
+  const left = a.num / b.den;
   const right = b.num * a.den;
   if (left < right) {
killedBy: comparePrice returns 0 for equal prices with different representations
statusReason: expected -1 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/math/price.ts:42:17
  */
 export function comparePrice(a: Price, b: Price): -1 | 0 | 1 {
   const left = a.num * b.den;
-  const right = b.num * a.den;
+  const right = b.num / a.den;
   if (left < right) {
     return -1;
killedBy: comparePrice returns 0 for equal prices with different representations
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/math/price.ts:43:7
 export function comparePrice(a: Price, b: Price): -1 | 0 | 1 {
   const left = a.num * b.den;
   const right = b.num * a.den;
-  if (left < right) {
+  if (false) {
     return -1;
   }
killedBy: comparePrice returns -1 when the first price is lower
statusReason: expected +0 to be -1 // Object.is equality

[Killed] ConditionalExpression
src/math/price.ts:43:7
 export function comparePrice(a: Price, b: Price): -1 | 0 | 1 {
   const left = a.num * b.den;
   const right = b.num * a.den;
-  if (left < right) {
+  if (true) {
     return -1;
   }
killedBy: comparePrice returns 0 for equal prices with different representations
statusReason: expected -1 to be +0 // Object.is equality

[Killed] UnaryOperator
src/math/price.ts:44:12
   const left = a.num * b.den;
   const right = b.num * a.den;
   if (left < right) {
-    return -1;
+    return +1;
   }
   if (left > right) {
killedBy: comparePrice returns -1 when the first price is lower
statusReason: expected 1 to be -1 // Object.is equality

[Killed] EqualityOperator
src/math/price.ts:46:7
   if (left < right) {
     return -1;
   }
-  if (left > right) {
+  if (left <= right) {
     return 1;
   }
killedBy: comparePrice returns 0 for equal prices with different representations
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/math/price.ts:46:7
   if (left < right) {
     return -1;
   }
-  if (left > right) {
+  if (true) {
     return 1;
   }
killedBy: comparePrice returns 0 for equal prices with different representations
statusReason: expected 1 to be +0 // Object.is equality
