[Killed] ArrowFunction
src/mechanics/fee-buyback.ts:15:22
   readonly minBuy: bigint;
 }
 
-const NO_OP_RESULT = (slot: number, id: string): MechanicEvent => ({
-  slot,
-  mechanicId: id,
-  baseBurned: 0n,
-  quoteSpent: 0n,
-});
+const NO_OP_RESULT = () => undefined;
 
 /**
killedBy: createFeeBuybackMechanic skips the buy when the share is below minBuy (dust)
statusReason: expected undefined to deeply equal { slot: 100, …(3) }

[Killed] ObjectLiteral
src/mechanics/fee-buyback.ts:15:68
   readonly minBuy: bigint;
 }
 
-const NO_OP_RESULT = (slot: number, id: string): MechanicEvent => ({
-  slot,
-  mechanicId: id,
-  baseBurned: 0n,
-  quoteSpent: 0n,
-});
+const NO_OP_RESULT = (slot: number, id: string): MechanicEvent => ({});
 
 /**
killedBy: createFeeBuybackMechanic skips the buy when the share is below minBuy (dust)
statusReason: expected {} to deeply equal { slot: 100, …(3) }

[Killed] BlockStatement
src/mechanics/fee-buyback.ts:32:98
  * @param id - This mechanic's id.
  * @param config - The interval, fee share, and dust threshold.
  */
-export function createFeeBuybackMechanic(id: string, config: FeeBuybackMechanicConfig): Mechanic {
-  return {
-    id,
-    due(slot: number): boolean {
-      return slot > 0 && slot % config.intervalSlots === 0;
-    },
-    apply(ctx: MechanicContext): MechanicEvent {
-      const fees = ctx.market.withdrawFees();
-      const buyAmount = bpsOf(fees, config.feeShareBps);
-      if (buyAmount < config.minBuy || buyAmount === 0n) {
-        return NO_OP_RESULT(ctx.slot, id);
-      }
-      const outcome = ctx.market.buy({ quoteIn: buyAmount, minBaseOut: 0n });
-      if (!outcome.ok) {
-        return NO_OP_RESULT(ctx.slot, id);
-      }
-      if (outcome.amountOut > 0n) {
-        ctx.market.burnFromPool(outcome.amountOut);
-      }
-      return { slot: ctx.slot, mechanicId: id, baseBurned: outcome.amountOut, quoteSpent: buyAmount };
-    },
-  };
-}
+export function createFeeBuybackMechanic(id: string, config: FeeBuybackMechanicConfig): Mechanic {}
 
killedBy: createFeeBuybackMechanic is due every intervalSlots, starting after slot 0
statusReason: Cannot read properties of undefined (reading 'due')

[Killed] BlockStatement
src/mechanics/fee-buyback.ts:35:32
 export function createFeeBuybackMechanic(id: string, config: FeeBuybackMechanicConfig): Mechanic {
   return {
     id,
-    due(slot: number): boolean {
-      return slot > 0 && slot % config.intervalSlots === 0;
-    },
+    due(slot: number): boolean {},
     apply(ctx: MechanicContext): MechanicEvent {
       const fees = ctx.market.withdrawFees();
killedBy: createFeeBuybackMechanic is due every intervalSlots, starting after slot 0
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/mechanics/fee-buyback.ts:36:14
   return {
     id,
     due(slot: number): boolean {
-      return slot > 0 && slot % config.intervalSlots === 0;
+      return slot > 0 || slot % config.intervalSlots === 0;
     },
     apply(ctx: MechanicContext): MechanicEvent {
killedBy: createFeeBuybackMechanic is due every intervalSlots, starting after slot 0
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/mechanics/fee-buyback.ts:36:14
   return {
     id,
     due(slot: number): boolean {
-      return slot > 0 && slot % config.intervalSlots === 0;
+      return slot <= 0 && slot % config.intervalSlots === 0;
     },
     apply(ctx: MechanicContext): MechanicEvent {
killedBy: createFeeBuybackMechanic is due every intervalSlots, starting after slot 0
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/mechanics/fee-buyback.ts:38:48
     due(slot: number): boolean {
       return slot > 0 && slot % config.intervalSlots === 0;
     },
-    apply(ctx: MechanicContext): MechanicEvent {
-      const fees = ctx.market.withdrawFees();
-      const buyAmount = bpsOf(fees, config.feeShareBps);
-      if (buyAmount < config.minBuy || buyAmount === 0n) {
-        return NO_OP_RESULT(ctx.slot, id);
-      }
-      const outcome = ctx.market.buy({ quoteIn: buyAmount, minBaseOut: 0n });
-      if (!outcome.ok) {
-        return NO_OP_RESULT(ctx.slot, id);
-      }
-      if (outcome.amountOut > 0n) {
-        ctx.market.burnFromPool(outcome.amountOut);
-      }
-      return { slot: ctx.slot, mechanicId: id, baseBurned: outcome.amountOut, quoteSpent: buyAmount };
-    },
+    apply(ctx: MechanicContext): MechanicEvent {},
   };
 }
killedBy: createFeeBuybackMechanic withdraws fees, buys with feeShareBps of them, and burns the purchased base
statusReason: expected [] to deeply equal [ 5000n ]

[Killed] ConditionalExpression
src/mechanics/fee-buyback.ts:41:40
     apply(ctx: MechanicContext): MechanicEvent {
       const fees = ctx.market.withdrawFees();
       const buyAmount = bpsOf(fees, config.feeShareBps);
-      if (buyAmount < config.minBuy || buyAmount === 0n) {
+      if (buyAmount < config.minBuy || false) {
         return NO_OP_RESULT(ctx.slot, id);
       }
killedBy: createFeeBuybackMechanic skips entirely when there are no fees to withdraw
statusReason: expected [ 0n ] to deeply equal []

[Killed] EqualityOperator
src/mechanics/fee-buyback.ts:41:40
     apply(ctx: MechanicContext): MechanicEvent {
       const fees = ctx.market.withdrawFees();
       const buyAmount = bpsOf(fees, config.feeShareBps);
-      if (buyAmount < config.minBuy || buyAmount === 0n) {
+      if (buyAmount < config.minBuy || buyAmount !== 0n) {
         return NO_OP_RESULT(ctx.slot, id);
       }
killedBy: createFeeBuybackMechanic withdraws fees, buys with feeShareBps of them, and burns the purchased base
statusReason: expected [] to deeply equal [ 5000n ]

[Killed] ObjectLiteral
src/mechanics/fee-buyback.ts:44:38
       if (buyAmount < config.minBuy || buyAmount === 0n) {
         return NO_OP_RESULT(ctx.slot, id);
       }
-      const outcome = ctx.market.buy({ quoteIn: buyAmount, minBaseOut: 0n });
+      const outcome = ctx.market.buy({});
       if (!outcome.ok) {
         return NO_OP_RESULT(ctx.slot, id);
killedBy: createFeeBuybackMechanic withdraws fees, buys with feeShareBps of them, and burns the purchased base
statusReason: expected [ undefined ] to deeply equal [ 5000n ]

[Killed] ConditionalExpression
src/mechanics/fee-buyback.ts:45:11
         return NO_OP_RESULT(ctx.slot, id);
       }
       const outcome = ctx.market.buy({ quoteIn: buyAmount, minBaseOut: 0n });
-      if (!outcome.ok) {
+      if (true) {
         return NO_OP_RESULT(ctx.slot, id);
       }
killedBy: createFeeBuybackMechanic withdraws fees, buys with feeShareBps of them, and burns the purchased base
statusReason: expected [] to deeply equal [ 4000n ]

[Killed] BooleanLiteral
src/mechanics/fee-buyback.ts:45:11
         return NO_OP_RESULT(ctx.slot, id);
       }
       const outcome = ctx.market.buy({ quoteIn: buyAmount, minBaseOut: 0n });
-      if (!outcome.ok) {
+      if (outcome.ok) {
         return NO_OP_RESULT(ctx.slot, id);
       }
killedBy: createFeeBuybackMechanic withdraws fees, buys with feeShareBps of them, and burns the purchased base
statusReason: expected [] to deeply equal [ 4000n ]

[Killed] BlockStatement
src/mechanics/fee-buyback.ts:48:35
       if (!outcome.ok) {
         return NO_OP_RESULT(ctx.slot, id);
       }
-      if (outcome.amountOut > 0n) {
-        ctx.market.burnFromPool(outcome.amountOut);
-      }
+      if (outcome.amountOut > 0n) {}
       return { slot: ctx.slot, mechanicId: id, baseBurned: outcome.amountOut, quoteSpent: buyAmount };
     },
killedBy: createFeeBuybackMechanic withdraws fees, buys with feeShareBps of them, and burns the purchased base
statusReason: expected [] to deeply equal [ 4000n ]

[Killed] EqualityOperator
src/mechanics/fee-buyback.ts:48:11
       if (!outcome.ok) {
         return NO_OP_RESULT(ctx.slot, id);
       }
-      if (outcome.amountOut > 0n) {
+      if (outcome.amountOut >= 0n) {
         ctx.market.burnFromPool(outcome.amountOut);
       }
killedBy: createFeeBuybackMechanic skips the burn when the buy succeeds but yields zero base (dust rounding)
statusReason: expected [ 0n ] to deeply equal []

[Killed] CallExpression
src/mechanics/fee-buyback.ts:49:9
         return NO_OP_RESULT(ctx.slot, id);
       }
       if (outcome.amountOut > 0n) {
-        ctx.market.burnFromPool(outcome.amountOut);
+        ;
       }
       return { slot: ctx.slot, mechanicId: id, baseBurned: outcome.amountOut, quoteSpent: buyAmount };
killedBy: createFeeBuybackMechanic withdraws fees, buys with feeShareBps of them, and burns the purchased base
statusReason: expected [] to deeply equal [ 4000n ]
