[Killed] BlockStatement
src/mechanics/lp-burn.ts:25:90
  * @param id - This mechanic's id.
  * @param config - The burn schedule.
  */
-export function createLpBurnMechanic(id: string, config: LpBurnMechanicConfig): Mechanic {
-  return {
-    id,
-    due(slot: number): boolean {
-      return slot > 0 && slot % config.burnIntervalSlots === 0;
-    },
-    apply(ctx: MechanicContext): MechanicEvent {
-      const step = minBig(
-        BigInt(Math.floor(ctx.slot / config.stepEverySlots)),
-        BigInt(config.perHourBps.length - 1),
-      );
-      /* v8 ignore next -- coverage-ignore: unreachable, `step` is always clamped to a valid index of perHourBps by minBig above; the fallback exists only for TS's noUncheckedIndexedAccess. */
-      const rateBps = config.perHourBps[Number(step)] ?? 0n;
-      const baseReserve = ctx.market.state().baseReserve;
-      const burnAmount = bpsOf(baseReserve, rateBps);
-      if (burnAmount > 0n) {
-        ctx.market.burnFromPool(burnAmount);
-      }
-      return { slot: ctx.slot, mechanicId: id, baseBurned: burnAmount, quoteSpent: 0n };
-    },
-  };
-}
+export function createLpBurnMechanic(id: string, config: LpBurnMechanicConfig): Mechanic {}
 
killedBy: createLpBurnMechanic is due every burnIntervalSlots, starting after slot 0
statusReason: Cannot read properties of undefined (reading 'due')

[Killed] ObjectLiteral
src/mechanics/lp-burn.ts:26:10
  * @param config - The burn schedule.
  */
 export function createLpBurnMechanic(id: string, config: LpBurnMechanicConfig): Mechanic {
-  return {
-    id,
-    due(slot: number): boolean {
-      return slot > 0 && slot % config.burnIntervalSlots === 0;
-    },
-    apply(ctx: MechanicContext): MechanicEvent {
-      const step = minBig(
-        BigInt(Math.floor(ctx.slot / config.stepEverySlots)),
-        BigInt(config.perHourBps.length - 1),
-      );
-      /* v8 ignore next -- coverage-ignore: unreachable, `step` is always clamped to a valid index of perHourBps by minBig above; the fallback exists only for TS's noUncheckedIndexedAccess. */
-      const rateBps = config.perHourBps[Number(step)] ?? 0n;
-      const baseReserve = ctx.market.state().baseReserve;
-      const burnAmount = bpsOf(baseReserve, rateBps);
-      if (burnAmount > 0n) {
-        ctx.market.burnFromPool(burnAmount);
-      }
-      return { slot: ctx.slot, mechanicId: id, baseBurned: burnAmount, quoteSpent: 0n };
-    },
-  };
+  return {};
 }
 
killedBy: createLpBurnMechanic is due every burnIntervalSlots, starting after slot 0
statusReason: mechanic.due is not a function

[Killed] BlockStatement
src/mechanics/lp-burn.ts:28:32
 export function createLpBurnMechanic(id: string, config: LpBurnMechanicConfig): Mechanic {
   return {
     id,
-    due(slot: number): boolean {
-      return slot > 0 && slot % config.burnIntervalSlots === 0;
-    },
+    due(slot: number): boolean {},
     apply(ctx: MechanicContext): MechanicEvent {
       const step = minBig(
killedBy: createLpBurnMechanic is due every burnIntervalSlots, starting after slot 0
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/mechanics/lp-burn.ts:29:14
   return {
     id,
     due(slot: number): boolean {
-      return slot > 0 && slot % config.burnIntervalSlots === 0;
+      return slot <= 0 && slot % config.burnIntervalSlots === 0;
     },
     apply(ctx: MechanicContext): MechanicEvent {
killedBy: createLpBurnMechanic is due every burnIntervalSlots, starting after slot 0
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/mechanics/lp-burn.ts:29:14
   return {
     id,
     due(slot: number): boolean {
-      return slot > 0 && slot % config.burnIntervalSlots === 0;
+      return slot >= 0 && slot % config.burnIntervalSlots === 0;
     },
     apply(ctx: MechanicContext): MechanicEvent {
killedBy: createLpBurnMechanic is due every burnIntervalSlots, starting after slot 0
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/mechanics/lp-burn.ts:31:48
     due(slot: number): boolean {
       return slot > 0 && slot % config.burnIntervalSlots === 0;
     },
-    apply(ctx: MechanicContext): MechanicEvent {
-      const step = minBig(
-        BigInt(Math.floor(ctx.slot / config.stepEverySlots)),
-        BigInt(config.perHourBps.length - 1),
-      );
-      /* v8 ignore next -- coverage-ignore: unreachable, `step` is always clamped to a valid index of perHourBps by minBig above; the fallback exists only for TS's noUncheckedIndexedAccess. */
-      const rateBps = config.perHourBps[Number(step)] ?? 0n;
-      const baseReserve = ctx.market.state().baseReserve;
-      const burnAmount = bpsOf(baseReserve, rateBps);
-      if (burnAmount > 0n) {
-        ctx.market.burnFromPool(burnAmount);
-      }
-      return { slot: ctx.slot, mechanicId: id, baseBurned: burnAmount, quoteSpent: 0n };
-    },
+    apply(ctx: MechanicContext): MechanicEvent {},
   };
 }
killedBy: createLpBurnMechanic burns the first step's rate from the base reserve, quote untouched
statusReason: expected [] to deeply equal [ 50000n ]

[Killed] ArithmeticOperator
src/mechanics/lp-burn.ts:33:27
     },
     apply(ctx: MechanicContext): MechanicEvent {
       const step = minBig(
-        BigInt(Math.floor(ctx.slot / config.stepEverySlots)),
+        BigInt(Math.floor(ctx.slot * config.stepEverySlots)),
         BigInt(config.perHourBps.length - 1),
       );
killedBy: createLpBurnMechanic burns the first step's rate from the base reserve, quote untouched
statusReason: expected [ 40000n ] to deeply equal [ 50000n ]

[Killed] ArithmeticOperator
src/mechanics/lp-burn.ts:34:16
     apply(ctx: MechanicContext): MechanicEvent {
       const step = minBig(
         BigInt(Math.floor(ctx.slot / config.stepEverySlots)),
-        BigInt(config.perHourBps.length - 1),
+        BigInt(config.perHourBps.length + 1),
       );
       /* v8 ignore next -- coverage-ignore: unreachable, `step` is always clamped to a valid index of perHourBps by minBig above; the fallback exists only for TS's noUncheckedIndexedAccess. */
killedBy: createLpBurnMechanic stays on the last rate once past the end of the schedule
statusReason: expected [] to deeply equal [ 10000n ]

[Killed] LogicalOperator
src/mechanics/lp-burn.ts:37:23
         BigInt(config.perHourBps.length - 1),
       );
       /* v8 ignore next -- coverage-ignore: unreachable, `step` is always clamped to a valid index of perHourBps by minBig above; the fallback exists only for TS's noUncheckedIndexedAccess. */
-      const rateBps = config.perHourBps[Number(step)] ?? 0n;
+      const rateBps = config.perHourBps[Number(step)] && 0n;
       const baseReserve = ctx.market.state().baseReserve;
       const burnAmount = bpsOf(baseReserve, rateBps);
killedBy: createLpBurnMechanic burns the first step's rate from the base reserve, quote untouched
statusReason: expected [] to deeply equal [ 50000n ]

[Killed] EqualityOperator
src/mechanics/lp-burn.ts:40:11
       const rateBps = config.perHourBps[Number(step)] ?? 0n;
       const baseReserve = ctx.market.state().baseReserve;
       const burnAmount = bpsOf(baseReserve, rateBps);
-      if (burnAmount > 0n) {
+      if (burnAmount >= 0n) {
         ctx.market.burnFromPool(burnAmount);
       }
killedBy: createLpBurnMechanic skips burning (no-op event) when the computed amount rounds to zero
statusReason: expected [ 0n ] to deeply equal []

[Killed] ConditionalExpression
src/mechanics/lp-burn.ts:40:11
       const rateBps = config.perHourBps[Number(step)] ?? 0n;
       const baseReserve = ctx.market.state().baseReserve;
       const burnAmount = bpsOf(baseReserve, rateBps);
-      if (burnAmount > 0n) {
+      if (false) {
         ctx.market.burnFromPool(burnAmount);
       }
killedBy: createLpBurnMechanic burns the first step's rate from the base reserve, quote untouched
statusReason: expected [] to deeply equal [ 50000n ]

[Killed] CallExpression
src/mechanics/lp-burn.ts:41:9
       const baseReserve = ctx.market.state().baseReserve;
       const burnAmount = bpsOf(baseReserve, rateBps);
       if (burnAmount > 0n) {
-        ctx.market.burnFromPool(burnAmount);
+        ;
       }
       return { slot: ctx.slot, mechanicId: id, baseBurned: burnAmount, quoteSpent: 0n };
killedBy: createLpBurnMechanic burns the first step's rate from the base reserve, quote untouched
statusReason: expected [] to deeply equal [ 50000n ]
