[Killed] MethodExpression
src/scenario/actor-config.schema.ts:11:19
 } from "./unit-strings.schema.js";
 
 const PositiveIntSchema = z.number().int().positive();
-const BpsSchema = z.number().int().min(0).max(10_000);
+const BpsSchema = z.number().int().min(0).min(10_000);
 
 /**
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/scenario/actor-config.schema.ts:11:19
 } from "./unit-strings.schema.js";
 
 const PositiveIntSchema = z.number().int().positive();
-const BpsSchema = z.number().int().min(0).max(10_000);
+const BpsSchema = z.number().int().max(0).max(10_000);
 
 /**
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/scenario/actor-config.schema.ts:33:20
  * after 150 slots (~1 min) (docs/03).
  */
 const SniperActorConfigSchema = z.strictObject({
-  group: z.literal("sniper"),
+  group: z.literal(""),
   count: PositiveIntSchema,
   spend: AmountRangeStringSchema,
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
src/scenario/actor-config.schema.ts:47:49
  * from one source; sells in tranches. Defaults: 10 wallets, 20% tranches
  * every 10 min (docs/03).
  */
-const BundlerActorConfigSchema = z.strictObject({
-  group: z.literal("bundler"),
-  wallets: PositiveIntSchema.default(10),
-  totalSpend: AmountStringSchema,
-  trancheBps: BpsSchema.default(2000),
-  sellEvery: DurationStringSchema.default("10m"),
-});
+const BundlerActorConfigSchema = z.strictObject({});
 
 /**

[Killed] StringLiteral
src/scenario/actor-config.schema.ts:52:43
   wallets: PositiveIntSchema.default(10),
   totalSpend: AmountStringSchema,
   trancheBps: BpsSchema.default(2000),
-  sellEvery: DurationStringSchema.default("10m"),
+  sellEvery: DurationStringSchema.default(""),
 });
 
killedBy: ActorConfigSchema accepts a bundler actor with defaults
statusReason: expected { group: 'bundler', wallets: 10, …(3) } to deeply equal { group: 'bundler', wallets: 10, …(3) }

[Killed] StringLiteral
src/scenario/actor-config.schema.ts:60:20
  * trigger. Defaults: at 30 min, sell at 3x (docs/03).
  */
 const WhaleActorConfigSchema = z.strictObject({
-  group: z.literal("whale"),
+  group: z.literal(""),
   spend: AmountStringSchema,
   at: DurationStringSchema.default("30m"),
killedBy: ActorConfigSchema accepts a whale actor with defaults
statusReason: [
  {
    "code": "invalid_union",
    "errors": [],
    "note": "No matching discriminator",
    "discriminator": "group",
    "options": [
      "retail",

[Killed] StringLiteral
src/scenario/actor-config.schema.ts:71:20
  * exceeds a threshold. Default: 30% drawdown (docs/03).
  */
 const PanicSellerActorConfigSchema = z.strictObject({
-  group: z.literal("panicSeller"),
+  group: z.literal(""),
   count: PositiveIntSchema,
   holdings: AmountRangeStringSchema,
killedBy: ActorConfigSchema accepts a panicSeller actor with defaults
statusReason: [
  {
    "code": "invalid_union",
    "errors": [],
    "note": "No matching discriminator",
    "discriminator": "group",
    "options": [
      "retail",
