[Killed] StringLiteral
src/scenario/actor-group.schema.ts:11:3
   "retail",
   "sniper",
   "bundler",
-  "whale",
+  "",
   "panicSeller",
   "flipper",
killedBy: ActorGroupSchema accepts each documented actor group
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/scenario/actor-group.schema.ts:13:3
   "bundler",
   "whale",
   "panicSeller",
-  "flipper",
+  "",
 ]);
 
killedBy: ActorGroupSchema accepts each documented actor group
statusReason: expected false to be true // Object.is equality
