[Survived] ObjectLiteral
src/scenario/check-config.schema.ts:8:55
 const BpsSchema = z.number().int().nonnegative();
 
 /** `quoteNeverBelowPctOfPeak`: pool quote reserve never drops below `bps` of its running peak (docs/04). */
-const QuoteNeverBelowPctOfPeakSchema = z.strictObject({
-  kind: z.literal("quoteNeverBelowPctOfPeak"),
-  bps: BpsSchema,
-});
+const QuoteNeverBelowPctOfPeakSchema = z.strictObject({});
 
 /** `groupSupplyShareBelow`: supply held by `group` at time `at` stays below `bps` of circulating supply (docs/04). */

[Killed] StringLiteral
src/scenario/check-config.schema.ts:9:19
 
 /** `quoteNeverBelowPctOfPeak`: pool quote reserve never drops below `bps` of its running peak (docs/04). */
 const QuoteNeverBelowPctOfPeakSchema = z.strictObject({
-  kind: z.literal("quoteNeverBelowPctOfPeak"),
+  kind: z.literal(""),
   bps: BpsSchema,
 });
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/scenario/check-config.schema.ts:15:19
 
 /** `groupSupplyShareBelow`: supply held by `group` at time `at` stays below `bps` of circulating supply (docs/04). */
 const GroupSupplyShareBelowSchema = z.strictObject({
-  kind: z.literal("groupSupplyShareBelow"),
+  kind: z.literal(""),
   group: ActorGroupSchema,
   at: DurationStringSchema,
killedBy: CheckConfigSchema accepts a groupSupplyShareBelow check
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/scenario/check-config.schema.ts:29:63
 });
 
 /** The v1 check catalog (docs/04). */
-export const CheckConfigSchema = z.discriminatedUnion("kind", [
-  QuoteNeverBelowPctOfPeakSchema,
-  GroupSupplyShareBelowSchema,
-  MaxDrawdownBelowSchema,
-]);
+export const CheckConfigSchema = z.discriminatedUnion("kind", []);
 
killedBy: CheckConfigSchema accepts a quoteNeverBelowPctOfPeak check
statusReason: expected false to be true // Object.is equality
