[Killed] StringLiteral
src/scenario/market-config.schema.ts:19:19
 
 /** `math/cpmm`: a constant-product pool (docs/06). */
 const CpmmMarketConfigSchema = z.strictObject({
-  kind: z.literal("cpmm"),
+  kind: z.literal(""),
   quote: AmountStringSchema,
   base: BaseUnitsStringSchema,
killedBy: ScenarioConfigSchema applies documented top-level defaults for a minimal scenario
statusReason: [
  {
    "code": "invalid_union",
    "errors": [],
    "note": "No matching discriminator",
    "discriminator": "kind",
    "options": [
      "pump-curve",

[Survived] StringLiteral
src/scenario/market-config.schema.ts:26:56
 });
 
 /** The v1 market catalog: `PumpCurveConfig | CpmmConfig` (docs/02, docs/06). */
-export const MarketConfigSchema = z.discriminatedUnion("kind", [
+export const MarketConfigSchema = z.discriminatedUnion("", [
   PumpCurveMarketConfigSchema,
   CpmmMarketConfigSchema,
