[Survived] ObjectLiteral
src/scenario/mechanic-config.schema.ts:12:51
  * `lpBurn`: burns a stepped schedule of the pool's base reserve every
  * `stepEvery`, without adding quote -- the draining mechanic (docs/02).
  */
-const LpBurnMechanicConfigSchema = z.strictObject({
-  kind: z.literal("lpBurn"),
-  perHour: z.array(PercentStringSchema).min(1),
-  stepEvery: DurationStringSchema.default("24h"),
-});
+const LpBurnMechanicConfigSchema = z.strictObject({});
 
 /**

[Killed] MethodExpression
src/scenario/mechanic-config.schema.ts:14:12
  */
 const LpBurnMechanicConfigSchema = z.strictObject({
   kind: z.literal("lpBurn"),
-  perHour: z.array(PercentStringSchema).min(1),
+  perHour: z.array(PercentStringSchema).max(1),
   stepEvery: DurationStringSchema.default("24h"),
 });
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/scenario/mechanic-config.schema.ts:24:42
  */
 const FeeBuybackMechanicConfigSchema = z.strictObject({
   kind: z.literal("feeBuyback"),
-  interval: DurationStringSchema.default("1h"),
+  interval: DurationStringSchema.default(""),
   feeShareBps: z.number().int().min(0).max(10_000).default(10_000),
   minBuy: AmountStringSchema.optional(),
killedBy: MechanicConfigSchema defaults feeBuyback's interval, feeShareBps, and minBuy
statusReason: expected { kind: 'feeBuyback', …(2) } to deeply equal { kind: 'feeBuyback', …(3) }

[Killed] MethodExpression
src/scenario/mechanic-config.schema.ts:25:16
 const FeeBuybackMechanicConfigSchema = z.strictObject({
   kind: z.literal("feeBuyback"),
   interval: DurationStringSchema.default("1h"),
-  feeShareBps: z.number().int().min(0).max(10_000).default(10_000),
+  feeShareBps: z.number().int().min(0).min(10_000).default(10_000),
   minBuy: AmountStringSchema.optional(),
 });
killedBy: MechanicConfigSchema rejects a feeShareBps above 10_000
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/scenario/mechanic-config.schema.ts:25:16
 const FeeBuybackMechanicConfigSchema = z.strictObject({
   kind: z.literal("feeBuyback"),
   interval: DurationStringSchema.default("1h"),
-  feeShareBps: z.number().int().min(0).max(10_000).default(10_000),
+  feeShareBps: z.number().int().max(0).max(10_000).default(10_000),
   minBuy: AmountStringSchema.optional(),
 });
killedBy: MechanicConfigSchema accepts a feeBuyback config
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/scenario/mechanic-config.schema.ts:30:58
 });
 
 /** The v1 mechanic catalog (docs/02). */
-export const MechanicConfigSchema = z.discriminatedUnion("kind", [
+export const MechanicConfigSchema = z.discriminatedUnion("", [
   LpBurnMechanicConfigSchema,
   FeeBuybackMechanicConfigSchema,
