[Killed] ObjectLiteral
src/scenario/scenario-config.schema.ts:10:42
 
 const UINT32_MAX = 2 ** 32 - 1;
 
-const TokenConfigSchema = z.strictObject({
-  symbol: z.string().min(1).default("TEST"),
-  decimals: z.number().int().nonnegative().default(6),
-  supply: BaseUnitsStringSchema,
-});
+const TokenConfigSchema = z.strictObject({});
 
 /**
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/scenario/scenario-config.schema.ts:11:11
 const UINT32_MAX = 2 ** 32 - 1;
 
 const TokenConfigSchema = z.strictObject({
-  symbol: z.string().min(1).default("TEST"),
+  symbol: z.string().max(1).default("TEST"),
   decimals: z.number().int().nonnegative().default(6),
   supply: BaseUnitsStringSchema,
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/scenario/scenario-config.schema.ts:11:37
 const UINT32_MAX = 2 ** 32 - 1;
 
 const TokenConfigSchema = z.strictObject({
-  symbol: z.string().min(1).default("TEST"),
+  symbol: z.string().min(1).default(""),
   decimals: z.number().int().nonnegative().default(6),
   supply: BaseUnitsStringSchema,
killedBy: ScenarioConfigSchema applies documented top-level defaults for a minimal scenario
statusReason: expected { symbol: '', decimals: 6, …(1) } to deeply equal { symbol: 'TEST', decimals: 6, …(1) }

[Killed] ObjectLiteral
src/scenario/scenario-config.schema.ts:23:52
  * Unknown keys are rejected at every level (`.strictObject`), so a typo
  * fails loudly instead of being silently ignored.
  */
-export const ScenarioConfigSchema = z.strictObject({
-  schemaVersion: z.literal(1),
-  name: z.string().min(1).max(120),
-  seed: z.number().int().nonnegative().max(UINT32_MAX).default(42),
-  duration: DurationStringSchema,
-  sampleEvery: DurationStringSchema.default("1m"),
-  slotMs: z.number().int().positive().default(400),
-  token: TokenConfigSchema,
-  market: MarketConfigSchema,
-  mechanics: z.array(MechanicConfigSchema).default([]),
-  actors: z.array(ActorConfigSchema).default([]),
-  checks: z.array(CheckConfigSchema).default([]),
-});
+export const ScenarioConfigSchema = z.strictObject({});
 
 /** The parsed, defaulted form of a {@link ScenarioConfigSchema}. */
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/scenario/scenario-config.schema.ts:25:9
  */
 export const ScenarioConfigSchema = z.strictObject({
   schemaVersion: z.literal(1),
-  name: z.string().min(1).max(120),
+  name: z.string().min(1).min(120),
   seed: z.number().int().nonnegative().max(UINT32_MAX).default(42),
   duration: DurationStringSchema,
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/scenario/scenario-config.schema.ts:25:9
  */
 export const ScenarioConfigSchema = z.strictObject({
   schemaVersion: z.literal(1),
-  name: z.string().min(1).max(120),
+  name: z.string().max(1).max(120),
   seed: z.number().int().nonnegative().max(UINT32_MAX).default(42),
   duration: DurationStringSchema,
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/scenario/scenario-config.schema.ts:26:9
 export const ScenarioConfigSchema = z.strictObject({
   schemaVersion: z.literal(1),
   name: z.string().min(1).max(120),
-  seed: z.number().int().nonnegative().max(UINT32_MAX).default(42),
+  seed: z.number().int().nonnegative().min(UINT32_MAX).default(42),
   duration: DurationStringSchema,
   sampleEvery: DurationStringSchema.default("1m"),
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/scenario/scenario-config.schema.ts:28:45
   name: z.string().min(1).max(120),
   seed: z.number().int().nonnegative().max(UINT32_MAX).default(42),
   duration: DurationStringSchema,
-  sampleEvery: DurationStringSchema.default("1m"),
+  sampleEvery: DurationStringSchema.default(""),
   slotMs: z.number().int().positive().default(400),
   token: TokenConfigSchema,
killedBy: ScenarioConfigSchema applies documented top-level defaults for a minimal scenario
statusReason: expected '' to be '1m' // Object.is equality
