[Killed] Regex
src/scenario/unit-strings.schema.ts:13:10
 /** A single amount, e.g. `"2 SOL"` or `"0.5 SOL"` (see `math/parse-amount.ts`). */
 export const AmountStringSchema = z
   .string()
-  .regex(/^[\d.]+\s+SOL$/, 'expected an amount like "2 SOL"');
+  .regex(/^[\d.]+\sSOL$/, 'expected an amount like "2 SOL"');
 
 /**
killedBy: AmountStringSchema accepts more than one space between the value and the unit
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/scenario/unit-strings.schema.ts:13:10
 /** A single amount, e.g. `"2 SOL"` or `"0.5 SOL"` (see `math/parse-amount.ts`). */
 export const AmountStringSchema = z
   .string()
-  .regex(/^[\d.]+\s+SOL$/, 'expected an amount like "2 SOL"');
+  .regex(/^[\d.]\s+SOL$/, 'expected an amount like "2 SOL"');
 
 /**
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/scenario/unit-strings.schema.ts:22:10
  */
 export const AmountRangeStringSchema = z
   .string()
-  .regex(/^[\d.]+(-[\d.]+)?\s+SOL$/, 'expected an amount like "2 SOL" or a range like "0.1-1 SOL"');
+  .regex(/^[\d.]+(-[\d.])?\s+SOL$/, 'expected an amount like "2 SOL" or a range like "0.1-1 SOL"');
 
 /**
killedBy: ActorConfigSchema accepts a flipper actor with defaults
statusReason: [
  {
    "origin": "string",
    "code": "invalid_format",
    "format": "regex",
    "pattern": "/^[\\d.]+(-[\\d.])?\\s+SOL$/",
    "path": [
      "spend"

[Killed] Regex
src/scenario/unit-strings.schema.ts:22:10
  */
 export const AmountRangeStringSchema = z
   .string()
-  .regex(/^[\d.]+(-[\d.]+)?\s+SOL$/, 'expected an amount like "2 SOL" or a range like "0.1-1 SOL"');
+  .regex(/^[\D.]+(-[\d.]+)?\s+SOL$/, 'expected an amount like "2 SOL" or a range like "0.1-1 SOL"');
 
 /**
killedBy: ScenarioConfigSchema accepts a full, realistic scenario
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/scenario/unit-strings.schema.ts:31:10
  */
 export const BaseUnitsStringSchema = z
   .string()
-  .regex(/^\d+(\.\d+)?$/, 'expected a plain decimal string like "1000000"');
+  .regex(/^\d+(\.\d+)?/, 'expected a plain decimal string like "1000000"');
 
 /** A percentage, e.g. `"5%"` or `"0.5%"` (see `math/parse-percent.ts`). */
killedBy: BaseUnitsStringSchema rejects a string with an underscore separator
statusReason: expected true to be false // Object.is equality

[Killed] Regex
src/scenario/unit-strings.schema.ts:31:10
  */
 export const BaseUnitsStringSchema = z
   .string()
-  .regex(/^\d+(\.\d+)?$/, 'expected a plain decimal string like "1000000"');
+  .regex(/^\d(\.\d+)?$/, 'expected a plain decimal string like "1000000"');
 
 /** A percentage, e.g. `"5%"` or `"0.5%"` (see `math/parse-percent.ts`). */
killedBy: BaseUnitsStringSchema accepts a plain integer string
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/scenario/unit-strings.schema.ts:34:53
   .regex(/^\d+(\.\d+)?$/, 'expected a plain decimal string like "1000000"');
 
 /** A percentage, e.g. `"5%"` or `"0.5%"` (see `math/parse-percent.ts`). */
-export const PercentStringSchema = z.string().regex(/^[\d.]+%$/, 'expected a percentage like "5%"');
+export const PercentStringSchema = z.string().regex(/^[\d.]+%/, 'expected a percentage like "5%"');
 
 /** A relative duration, e.g. `"6h"` or `"90m"` (see `math/parse-duration.ts`). */
killedBy: PercentStringSchema rejects trailing content after the %
statusReason: expected true to be false // Object.is equality

[Killed] Regex
src/scenario/unit-strings.schema.ts:39:10
 /** A relative duration, e.g. `"6h"` or `"90m"` (see `math/parse-duration.ts`). */
 export const DurationStringSchema = z
   .string()
-  .regex(/^[\d.]+(s|m|h|d)$/, 'expected a duration like "6h"');
+  .regex(/^[\d.](s|m|h|d)$/, 'expected a duration like "6h"');
 
 /**
killedBy: DurationStringSchema accepts a minute duration
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/scenario/unit-strings.schema.ts:39:31
 /** A relative duration, e.g. `"6h"` or `"90m"` (see `math/parse-duration.ts`). */
 export const DurationStringSchema = z
   .string()
-  .regex(/^[\d.]+(s|m|h|d)$/, 'expected a duration like "6h"');
+  .regex(/^[\d.]+(s|m|h|d)$/, "");
 
 /**
killedBy: DurationStringSchema reports a helpful error message
statusReason: expected 'Invalid string: must match pattern /^…' to be 'expected a duration like "6h"' // Object.is equality

[Killed] Regex
src/scenario/unit-strings.schema.ts:48:10
  */
 export const SlotOrDurationStringSchema = z
   .string()
-  .regex(/^(slot:\d+|hour:\d+|[\d.]+(s|m|h|d))$/, 'expected "6h", "slot:0", or "hour:31"');
+  .regex(/^(slot:\D+|hour:\d+|[\d.]+(s|m|h|d))$/, 'expected "6h", "slot:0", or "hour:31"');
 
killedBy: SlotOrDurationStringSchema accepts an absolute slot
statusReason: expected false to be true // Object.is equality
